{
  "id": "americorpsgov_blogs_2013_04_04_over_730_mayors_join_salute_national_servicehtml",
  "url": "https://americorps.gov/blogs/2013-04-04/over-730-mayors-join-salute-national-service",
  "title": "over-730-mayors-join-salute-national-service",
  "content": "Over 730 Mayors Join Salute to National Service | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Over 730 Mayors Join Salute to National Service Submitted by admin on Thu, 04/04/2013 - 00:00 Next week more than 730 mayors, collectively representing nearly 100 million Americans in all 50 states, will join together to recognize the impact of national service participants in AmeriCorps and Senior Corps programs who are making a difference in their communities. The first-ever Mayors Day of Recognition for National Service on Tuesday, April 9, is being led by Cities of Service ; the National League of Cities ; Philadelphia Mayor Michael Nutter, president of the U.S. Conference of Mayors ; and the Corporation for National and Community Service (CNCS), the federal agency that administers AmeriCorps and Senior Corps. “It is a testament to the effectiveness of AmeriCorps and Senior Corps programs that nearly one-third of Americans will have their mayor participating in this first-ever Day of Recognition,” said Wendy Spencer, CEO of CNCS. “We're proud to stand with this bipartisan group of mayors. These leaders are shining a bright light on the many ways AmeriCorps members and Senior Corps volunteers are improving neighborhoods and transforming lives across the country.” As the federal agency for service and volunteering, CNCS annually engages more than 5 million citizens in service at more than 70,000 locations in 8,500 cities across the country through AmeriCorps, Senior Corps, and other programs. “National service is a vital resource for America's cities,” Mayor Nutter said. “By unleashing the power of citizens, AmeriCorps and Senior Corps programs have a positive and lasting impact – making our cities better places to live.” Participating mayors will make site visits, issue proclamations, and host roundtables and celebrations during the day. All events are designed to highlight how national service works for cities and focuses on three groups that benefit from the program: the recipients of service, the people who serve, and the larger community and nation. The initiative has already gained support from a range of cities large and small, and a full list of participating mayors can be found on the CNCS website . Previous Chavez Day of Service Sows Seeds of Healthy Eating, Sustainability Next Mentoring, Mathematics, and More Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2013-04-04/over-730-mayors-join-salute-national-service",
    "http://www.citiesofservice.org/",
    "http://www.nlc.org/",
    "http://usmayors.org/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2013-04-04/over-730-mayors-join-salute-national-service&amp;title=Over 730 Mayors Join Salute to National Service",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2013-04-04/over-730-mayors-join-salute-national-service&amp;title=Over 730 Mayors Join Salute to National Service&amp;source=https://americorps.gov/blogs/2013-04-04/over-730-mayors-join-salute-national-service",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2013-04-04/over-730-mayors-join-salute-national-service&amp;url=https://americorps.gov/blogs/2013-04-04/over-730-mayors-join-salute-national-service&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2013-03-28/chavez-day-service-sows-seeds-healthy-eating-sustainability",
    "https://americorps.gov/blogs/2014-05-30/mentoring-mathematics-and-more",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2013",
  "subdomain_2": "04",
  "subdomain_3": "04"
}