{
  "id": "americorpsgov_blogs_2021_04_05_help_health_human_services_support_migrant_childrenhtml",
  "url": "https://americorps.gov/blogs/2021-04-05/help-health-human-services-support-migrant-children",
  "title": "help-health-human-services-support-migrant-children",
  "content": "Help Health and Human Services Support Migrant Children | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Help Health and Human Services Support Migrant Children Submitted by pnolan on Mon, 04/05/2021 - 14:59 Apr 05, 2021 AmeriCorps Staff HHS is hiring for short-term assignments Migrant children are currently being housed by U.S. Customs & Border Protection in holding areas that were not meant for children beyond a short period of time. They are alone, scared, separated from family. The support these children, the Department of Health and Human Services is asking for you to help provide needed on-the-ground support. The Office of Refugee Resettlement is offering paid, short-term positions dedicated to supporting government response efforts to the surge of unaccompanied children in certain areas of the country. The unaccompanied child program provides a safe and appropriate environment to children and youth who enter the United States without immigration status and without a parent or legal guardian who is able to provide for their physical and mental well-being. HHS is seeking people who have the ability to coordinate, collaborate, communicate, and organize in the following roles: On the Ground Support Field Program Specialists – Field Program Specialists generally work in one of two capacities: Youth Care Workers – ensures line of sight supervision of UC to ensure safety of all children and staff at all times and will not necessarily be working with the children one-on-one. Jobs this role is being used to perform may include: hallway monitors, administrative support, and escorts for children to and from areas; Case Management – assists with the collection of contact information from UCs for parents or relatives in home country and family members in the US. Preferred Spanish proficiency as well as those familiar with indigenous dialects spoken in Mexico, Guatemala, Honduras, and/or El Salvador Field liaison – serves as an on-the-ground point of contact, which may involve coordinating information flow between ORR staff and stakeholders Volunteer coordination and reception – maintains accountability, security, assignments, and coordination of onsite volunteers; provides support for information technology needs on the ground; works across agencies, organizations, and teams to ensure seamless integration of volunteers into daily operations onsite Virtual Support Executive Communications Liaison – works closely with ORR leadership on briefing materials and responding to incoming communications Rapid Response and Interagency Coordination – works closely with ORR leadership and staff to coordinate with partner agencies Quality and Program Performance Officer – works on the development and evaluation of policies Program subject matter experts – supports ORR’s Chief of Staff Project Officer Support – reviews and makes recommendations on unsolicited grant and contract proposals, works on Funding Opportunity Announcements, reviews and supports grant applications, queues up grant awards for processing, engages with care providers/grantees on bed capacity; and assists with data/information requests; Attorneys or policy analysts – helps with work associated with structuring and signing interagency agreements (within government) or other agreements (volunteer organizations and others) and state licensing issues. Budget background a plus. Paralegal support – assists with researching, documenting, and tracking legal and policy-related matters; Assistant – helps coordinate items for external clearance, tracks and follows up on tasks, and notes, and sends meeting requests; Budget support – provides budget execution support, including initiating purchase actions and providing assistance with data/information requests. Requirements Individuals willing to serve on short- to mid-term (3-12 month) assignments Individuals may be hired through a contract with the government On the ground staff are expected to work 12-hour staggered shifts and will be selected for their roles, depending in part on their language proficiency. To apply, submit your interest through the Department of Health and Human Services’ Office of Refugee Resettlement Volunteer Platform at https://orrresponse.force.com/s/ Previous Vice President, Second Gentleman Visit Sites Where AmeriCorps is ‘Here to Help’ Next AmeriCorps is Tackling the Climate Crisis and Building a Clean Energy Future Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2021-04-05/help-health-human-services-support-migrant-children",
    "https://orrresponse.force.com/s/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2021-04-05/help-health-human-services-support-migrant-children&amp;title=Help Health and Human Services Support Migrant Children",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2021-04-05/help-health-human-services-support-migrant-children&amp;title=Help Health and Human Services Support Migrant Children&amp;source=https://americorps.gov/blogs/2021-04-05/help-health-human-services-support-migrant-children",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2021-04-05/help-health-human-services-support-migrant-children&amp;url=https://americorps.gov/blogs/2021-04-05/help-health-human-services-support-migrant-children&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2021-03-23/vice-president-second-gentleman-visit-sites-where-americorps-here-help",
    "https://americorps.gov/blogs/2021-04-23/americorps-tackling-climate-crisis-building-clean-energy-future",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2021",
  "subdomain_2": "04",
  "subdomain_3": "05"
}