{
  "id": "americorpsgov_blogs_2024_07_18_americorps_30_six_years_later_recovery_continueshtml",
  "url": "https://americorps.gov/blogs/2024-07-18/americorps-30-six-years-later-recovery-continues",
  "title": "americorps-30-six-years-later-recovery-continues",
  "content": "AmeriCorps 30: Six Years Later, Recovery Continues | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps 30: Six Years Later, Recovery Continues Submitted by dsong on Wed, 07/17/2024 - 13:34 Jul 18, 2024 Jordan C. Plante, Stephanie Chan Earlier this year, bundled up against the chilly January weather, a resident in Chadbourn, North Carolina, finally saw the walls go up on their new home, nearly six years after Hurricane Florence devastated the community. AmeriCorps NCCC Assistant Program Directors Jordan C. Plante and Stephanie Chan share the impact of national service in disaster recovery. When Hurricane Florence made landfall on September 14, 2018, in North Carolina, it dropped 30 inches of rain and brought wind gusts over 100 mph. The state saw $16.7 billion in damages, flooding of more than 74,000 structures, and more than 5,000 people in need of rescue from floodwaters. Immediately, AmeriCorps Disaster Services Unit coordinated with FEMA on a mission assignment that brought in nine AmeriCorps Disaster Response Teams from around the country to assist with response and support a variety of urgent tasks, including mucking and gutting homes to remove debris, emergency mold suppression of residences, conducting needs assessments, supporting call centers, and providing support to partner agencies. After it was declared a federal disaster, AmeriCorps DSU provided technical assistance to connect AmeriCorps response support options through a FEMA mission assignment. Many of these teams arrived within 48 hours of the storm making landfall, providing much-needed support to communities across the state during the initial phase of disaster response. One of the programs that responded to the storm was the Utah Conservation Corps . UCC led a group of other A-DRTs, including AmeriCorps NCCC , Conservation Corps Minnesota and Iowa , St. Bernard Project , Washington Conservation Corp s, and Conservation Corps New Mexic o. More than 138 AmeriCorps members from these programs served residents across the state. After deployment, UCC Incident Commander Kayla Williams said, “I am proud of what we have accomplished here. These AmeriCorps members have been so dedicated to this work and these communities. It will be hard for everyone to leave this community because of what still needs to be accomplished here and how much we have connected to these towns, but we have left this area knowing that we put in our all.” As Kayla noted, disaster recovery takes time, often far more than most are aware. Previous Next Six years after Hurricane Florence, the recovery from the disaster continues. Since 2018, more than 440 AmeriCorps members have served more than 90,000 hours on 42 unique long-term recovery projects across the state. The most recent one took place in Chadbourn, North Carolina, this past spring, and another is set to begin this fall, just before the sixth anniversary of the storm in September. AmeriCorps NCCC understands that disaster recovery takes time, which is why the program model allows for continued community support long after the initial response. A recently signed memorandum of understanding between AmeriCorps NCCC Southern Region and the North Carolina Commission on Volunteerism and Community Service attests to this strong commitment to supporting local communities for the long haul. It prioritizes a community-led approach and streamlines the process of utilizing AmeriCorps NCCC as part of recovery and relief efforts in times of disaster. In Times of Tragedy and Triumph, AmeriCorps Answers the Call to Service For the past 30 years, AmeriCorps has been at the forefront of supporting disaster recovery efforts across the nation. Whether it’s Hurricane Florence, Hurricane Katrina, the Maui Wildfires, 9/11 Day attacks, or smaller local disasters such as the Rolling Fork-Silver City tornado in Mississippi, AmeriCorps members have always answered the call to service. Learn more about AmeriCorps’ disaster recovery efforts and join the thousands like those serving with AmeriCorps NCCC . Previous AmeriCorps 30: National Service Helps Communities Prepare, Prevent, and Protect Next AmeriCorps 30: From Student to Colleague, A Mentor and Mentee’s National Service Journey Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2024-07-18/americorps-30-six-years-later-recovery-continues",
    "https://americorps.gov/about/what-we-do/disaster-services-unit",
    "https://www.usu.edu/ucc/",
    "https://americorps.gov/serve/americorps/americorps-nccc",
    "https://conservationcorps.org/",
    "https://www.sbpusa.org/",
    "https://ecology.wa.gov/about-us/jobs-at-ecology/washington-conservation-corps",
    "https://corpsnm.org/",
    "https://www.nc.gov/working/volunteer-opportunities/volunteernc/nc-commission-volunteerism-community-service",
    "https://socialpresskit.com/americorps30",
    "https://americorps.gov/serve/americorps/americorps-nccc/join-archive",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2024-07-18/americorps-30-six-years-later-recovery-continues&amp;title=AmeriCorps 30: Six Years Later, Recovery Continues",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2024-07-18/americorps-30-six-years-later-recovery-continues&amp;title=AmeriCorps 30: Six Years Later, Recovery Continues&amp;source=https://americorps.gov/blogs/2024-07-18/americorps-30-six-years-later-recovery-continues",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2024-07-18/americorps-30-six-years-later-recovery-continues&amp;url=https://americorps.gov/blogs/2024-07-18/americorps-30-six-years-later-recovery-continues&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2024-07-11/americorps-30-national-service-helps-communities-prepare-prevent-protect",
    "https://americorps.gov/blogs/2024-08-13/americorps-30-student-colleague-mentor-mentees-national-service-journey",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2024",
  "subdomain_2": "07",
  "subdomain_3": "18"
}