{
  "id": "americorpsgov_blogs_2024_09_26_national_service_addresses_nations_substance_use_disorder_crisishtml",
  "url": "https://americorps.gov/blogs/2024-09-26/national-service-addresses-nations-substance-use-disorder-crisis",
  "title": "national-service-addresses-nations-substance-use-disorder-crisis",
  "content": "National Service Addresses the Nation's Substance Use Disorder Crisis | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb National Service Addresses the Nation's Substance Use Disorder Crisis Submitted by dsong on Wed, 09/25/2024 - 16:32 Sep 26, 2024 AmeriCorps Staff The ongoing opioid epidemic, including both substance use and related mortality rates, remains a public health emergency in the United States. The Centers for Disease Control and Prevention reported that drug overdoses have claimed over a million lives since 1999 , with annual deaths increasing by 14 percent from 2020 to 2021. Although recent data suggest positive news that there is a possible decline in opioid overdose deaths, communities across the country continue to face significant challenges with regard to substance use prevention and support for individuals living in recovery. AmeriCorps has long been a supporter of efforts to address this ongoing crisis. Through programs such as Public Health AmeriCorps, members serve across the country to provide peer recovery coaching, help individuals navigate to appropriate resources, and offer support and project management to help expand capacity and make recovery possible for more Americans. We work with organizations to combat the opioid crisis through a variety of program models to expand the reach and impact of education, prevention, and recovery efforts. From Addiction to Transforming Lives AmeriCorps member Julie is serving her second term with Public Health AmeriCorps in Wisconsin, helping transform the lives of those in recovery. As someone who is navigating her own recovery journey, Julie created a peer-to-peer support program that could help other women in her community facing the same struggles. As a member of Public Health AmeriCorps, she received the training and support needed to launch Sober Strong. This program incorporates exercise into recovery at her host site, the YMCA of Chippewa Valley. \"If somebody had told me to join a group exercise because your recovery would take off from there, I would have done it long before I joined. I decided then to be that person,\" said Julie. \"I'm living proof that we can do hard things and we can recover. And it's with this experience that I hope I can convey to these women that no matter what happens in your life, no matter how far you feel like you've fallen, you can always come back.\" From weekly support meetings to a group exercise class, one-on-one recovery coaching, and a free clothing shop, Julie and Sober Strong are changing the lives of women living in recovery. A Recovery Coach's Journey to Accomplishing His Dream Through the Marshfield Clinic Health System Recovery Corps program , members of Public Health AmeriCorps provide one-on-one contact and community education across rural Wisconsin to support those affected by their own or someone else's substance use. The Recovery Corps program is the first of its kind in Wisconsin that trains individuals to become recovery coaches. AmeriCorps member Christian serves as a recovery coach in the program, helping with housing needs and partnering to resolve personal and environmental obstacles. \"I looked for ways that I could help other people because I noticed that it was hard for people who haven't been through recovery to talk about recovery, even if they're professionals. I think without our program, [the community would] be in a much darker place than we are currently,\" said Christian. Christian has found a way to transform the lives of those battling substance use disorder and his life, too, through Public Health AmeriCorps. When a local detox facility closed, Christian coordinated with local hospitals to ensure his clients received continuous support so that their recovery journey was uninterrupted. AmeriCorps' Office of Research and Evaluation's latest evidence findings focused on recovery coach programs show that more time spent with a recovery coach significantly benefits individuals’ recovery journeys. This adds to the evidence suggesting that time spent with a recovery coach may be important for recovery outcomes. While supporting those in need, Christian is also gaining the experience to fulfill his goal of becoming a licensed therapist. Through the partnership with the CDC, Public Health AmeriCorps recruits, trains, and develops the next generation of public health leaders. \"A doctor doesn't have the capacity to do it all or the experience, so that's where recovery coaches come in. They're an extension of the care team to make sure that when somebody walks out of that doctor's office, that somebody has got them. Because you're recovering twenty-four-seven,\" said Marshfield Clinic Health System Community Health Manager Meagan Barnett. AmeriCorps studies found that recovery coaches with lived experience with substance use disorder, like Christian, service helps them maintain their own recovery. Recovery coaches are believed to be important for building rapport and increasing recovery efforts across the nation. The National Service Movement Supports the Nation's Healthy Future Americans like Julie and Christian demonstrate how everyone can help fight the ongoing public health crises in our country, and at the same time, how they can gain experience to set them on a pathway from service to a career in public health, behavioral health, or recovery support. \"When I entered into recovery, I started to look for ways that I could help other people because I noticed that it was hard for people who haven't been through recovery to talk about recovery, even if they're professionals. The issue we see is the same issue that we see in all communities across the country. We have people who desperately want to be sober but physically cannot without getting sick. The importance of the AmeriCorps program, especially with the recovery coaches, is that we are a bridge between other organizations,\" said Christian. Whether you have lived experience or know someone who struggles with substance use disorder, anyone can serve to help make recovery possible. Previous Employing Older Workers Benefits Everyone Next AmeriCorps 30: The AmeriCorps Movement Continues Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2024-09-26/national-service-addresses-nations-substance-use-disorder-crisis",
    "https://www.cdc.gov/nchs/hus/topics/drug-overdose-deaths.htm",
    "https://www.npr.org/2024/09/18/nx-s1-5107417/overdose-fatal-fentanyl-death-opioid#:~:text=U.S.%20overdose%20deaths%20fell%20for%20the%20first%20time%20since%202020&amp;text=A%20line%20chart%20showing%20U.S.,over%20100%20thousand%20in%202024.&amp;text=Between%20April%202023%20and%20April,overdose%20deaths%20declined%20by%2010%25",
    "https://americorps.gov/serve/americorps/americorps-state-national/public-health-americorps",
    "https://www.ymca-cv.org/hip",
    "https://marshamer.memberclicks.net/recovery-corps",
    "https://www.americorps.gov/evidence-exchange/bundled-evaluation-capacity-building-project-americorps-supported-recovery-coach",
    "https://www.americorps.gov/evidence-exchange/bundled-evaluation-capacity-building-project-americorps-supported-recovery-coach",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2024-09-26/national-service-addresses-nations-substance-use-disorder-crisis&amp;title=National Service Addresses the Nation&amp;#039;s Substance Use Disorder Crisis",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2024-09-26/national-service-addresses-nations-substance-use-disorder-crisis&amp;title=National Service Addresses the Nation&amp;#039;s Substance Use Disorder Crisis&amp;source=https://americorps.gov/blogs/2024-09-26/national-service-addresses-nations-substance-use-disorder-crisis",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2024-09-26/national-service-addresses-nations-substance-use-disorder-crisis&amp;url=https://americorps.gov/blogs/2024-09-26/national-service-addresses-nations-substance-use-disorder-crisis&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2024-09-24/employing-older-workers-benefits-everyone",
    "https://americorps.gov/blogs/2024-09-30/americorps-30-americorps-movement-continues",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "Office of Research and Evaluation; Public Health AmeriCorps",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2024",
  "subdomain_2": "09",
  "subdomain_3": "26"
}