{
  "id": "americorpsgov_blogs_2023_09_21_30th_anniversary_honor_serving_americorps_inaugural_classhtml",
  "url": "https://americorps.gov/blogs/2023-09-21/30th-anniversary-honor-serving-americorps-inaugural-class",
  "title": "30th-anniversary-honor-serving-americorps-inaugural-class",
  "content": "30th Anniversary: The Honor of Serving with AmeriCorps’ Inaugural Class | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb 30th Anniversary: The Honor of Serving with AmeriCorps’ Inaugural Class Submitted by dsong on Wed, 09/20/2023 - 15:26 Sep 21, 2023 Rob Haynes To commemorate AmeriCorps’ 30th anniversary, alumnus Rob Haynes shares what service was like in the 1994 AmeriCorps inaugural class. I was 18 years old and had just graduated from high school when President Bill Clinton announced the creation of AmeriCorps in 1993. I jumped at the chance to join the inaugural class of AmeriCorps members because I wasn’t quite ready to go to college. Not only this but my life was framed around service. My parents and my biggest hero, Muhammad Ali, were my inspiration to join the inaugural class. My parents were firm believers in serving others. They volunteered with local nonprofits in our hometown and taught me that leadership is shown through my actions, not just my words. Muhammad Ali’s compassion for others and desire for peace have always driven me to serve and make a difference. My decision to join AmeriCorps also stemmed from knowing that this was an opportunity to get out of my comfort zone and challenge myself. For 18 years, I had never lived outside my home state of Kentucky. I thought AmeriCorps would be a unique experience to meet new people, travel, and serve my country. And it was. The Startup of Service Serving in the inaugural class was a pivotal point that changed the course of my life from the moment I raised my hand and took the pledge. AmeriCorps had the feel of a modern-day startup. Our leadership team was strong, and they empowered the members to be engaged in constructive criticism and think about the best ways to accomplish our shared mission. We created new processes to learn the best way to work with each other and complete our tasks. Not all our ideas were successful, but it was exciting to be part of a program that was new and find ways to work together without the experience from previous years. We all gathered for the right reasons – we all wanted to make a difference in our communities. This is why my service with AmeriCorps NCCC was an extraordinary experience despite the challenges of being a brand-new team. Serving alongside a group of individuals from different walks of life every day, you learn how to work with each other live in harmony and serve the greater good. Rob’s inaugural class serving in 1994. I was honored to receive the “Most Inspirational Corps Member” award from my team during my service. This moment holds a special place in my heart because my team members nominated me for bringing kindness and joy to our work. I strongly believe that there are no obstacles that we cannot overcome as long as we work together. But the most memorable moment from my service was when our team joined the Red Cross in New Orleans, La., to support disaster recovery efforts after the Great Flood in 1995. Our team distributed needed supplies to survivors and served meals in the community after people lost their homes to the flood. Though the circumstances were challenging, I fell in love with the community, culture, and people of that special place. We were in New Orleans for six weeks and it made an impact on me. So much so that I returned to serve the community 10 years later. In 2005, I served to help community members after Hurricane Katrina devastated communities and volunteered to support recovery efforts following the Deepwater Horizon oil spill in 2010 . Finding My Future Through Service AmeriCorps was truly a life-changing year for me. My goals as a teen were to earn a business degree and expand my family’s restaurant. I dreamed of being a famous chef, restaurateur, and hotel owner in the Caribbean. When I returned from AmeriCorps, I was forever changed.  While I managed my family’s restaurant, I started a community garden. The calling to serve was there. I left to finish college, worked in local and state government, and then eventually moved to the West to manage AmeriCorps programs in Utah and the Mountain Region Office . AmeriCorps altered the course of my life and led me to a career in public service, social justice, economic development, and corporate social responsibility. Inaugural class of AmeriCorps members, including Rob, in 1994 Choose Service to Experience Life Through AmeriCorps, I learned service opens our perspectives and allows us to experience different opportunities, personalities, and cultures. There are eight billion people in the world, different communities, and various ways in which people find happiness through connection. Listening to others and serving others is the best way to learn empathy and true compassion. I’m proud to say that I was one of the first Americans to join AmeriCorps. It’s inspiring to see the growth of national service over the past 30 years, and it’s exciting to see how AmeriCorps has evolved. I encourage all young people in America to consider service with AmeriCorps to expand their horizons and become the true leaders of our nation . Happy 30th anniversary, AmeriCorps, and thank you for helping me find my purpose. Rob Haynes is the manager of community investments and public affairs for Boeing Global Engagement in Colorado and Utah. A native of Kentucky, Rob has served in numerous government roles on the local, state, and federal levels. He brings 25 years of passion, service, and a commitment to working with others to make the world a little better each day. He has served as chief of staff to the President of the Louisville Metro Council in Louisville, Ky., as communications administrator and public relations specialist, as a local government advisor and federal grant manager for the Kentucky Governor, and as executive director of the Kentucky Office of Business for the Secretary of State. He also served as a program officer in the Utah State Office for the Corporation for National and Community Service and as a portfolio manager in the Mountain Region Office of AmeriCorps. Rob is married to a returned Peace Corps volunteer who served in Mali. She is a research epidemiologist for the National Institute of Occupational Safety and Health. Previous America Unites on 9/11 Day of Service Next The Avengers of Civic Engagement Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-09-21/30th-anniversary-honor-serving-americorps-inaugural-class",
    "https://americorps.gov/serve/americorps/americorps-nccc",
    "https://americorps.gov/newsroom/press-releases/2010/americorps-front-lines-disaster-recovery",
    "https://americorps.gov/contact/region-offices",
    "https://americorps.gov/serve",
    "https://americorps.gov/about/americorps30/events",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-09-21/30th-anniversary-honor-serving-americorps-inaugural-class&amp;title=30th Anniversary: The Honor of Serving with AmeriCorps’ Inaugural Class",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-09-21/30th-anniversary-honor-serving-americorps-inaugural-class&amp;title=30th Anniversary: The Honor of Serving with AmeriCorps’ Inaugural Class&amp;source=https://americorps.gov/blogs/2023-09-21/30th-anniversary-honor-serving-americorps-inaugural-class",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-09-21/30th-anniversary-honor-serving-americorps-inaugural-class&amp;url=https://americorps.gov/blogs/2023-09-21/30th-anniversary-honor-serving-americorps-inaugural-class&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-09-15/america-unites-911-day-service",
    "https://americorps.gov/blogs/2023-09-29/avengers-civic-engagement",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "09",
  "subdomain_3": "21"
}