{
  "id": "americorpsgov_blogs_2017_11_09_thank_you_our_veteranshtml",
  "url": "https://americorps.gov/blogs/2017-11-09/thank-you-our-veterans",
  "title": "thank-you-our-veterans",
  "content": "A Thank You to Our Veterans | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb A Thank You to Our Veterans Submitted by admin on Thu, 11/09/2017 - 10:23 Nov 09, 2017 The Corporation for National and Community Service joins the Department of Veterans Affairs and the federal family during the commemoration of National Veterans and Military Families Month and Veterans Day on Sunday, Nov. 11 – a fitting tribute as we enter this season of thanks. Some history first. On the eleventh hour of the eleventh day of the eleventh month in 1918, an armistice went into effect, effectively signaling cessation of hostilities between Allied nations and Germany marking the end of World War I, “the war to end all wars.” President Woodrow Wilson proclaimed November 11, 1919, as the first commemoration of Armistice Day – the precursor of Veterans Day in the United States – noting how the day should be observed: “To us in America, the reflections of Armistice Day will be filled with solemn pride in the heroism of those who died in the country’s service and with gratitude for the victory, both because of the thing from which it has freed us and because of the opportunity it has given America …\" Our veterans are cut from a different cloth, serving as defenders of American principles and protectors of freedom around the globe. In peace and in wartime, each generation has accepted this responsibility by facing danger with unparalleled valor and taken on the challenges before them with an unbreakable spirit and will to complete their mission. We are honored that more than 23,500 veterans choose to serve our nation again through our AmeriCorps and Senior Corps programs. U.S. Marine veteran Paola Gomez joined the VetsWork GreenCorps program, which works to mitigate wildfires on public lands in 11 states while training military veterans in careers in natural resource management and wildland firefighting. Even though Gomez suffered a personal tragedy when her mother died shortly before she joined AmeriCorps, she kept her commitment to the program and overcame her lack of wilderness experience to thrive in the program. She committed to a second year to train more AmeriCorps members and to share the experience with more of her fellow veterans. Veteran Gordon Long has served with the Rochester, N.Y., RSVP Veteran Corps for the last 11 years. He is a volunteer driver for Fairport Baptist Home, Vets Driving Vets, and Penfield Symphony Orchestra. Last year, Long drove 2,700 miles and devoted 233 hours to helping individuals get to doctor appointments, grocery stores, and social activities, allowing more than 200 older adults to maintain their independence at home. The RSVP Vet-to-Vet Program matches veteran RSVP volunteers with other veterans, helping connect them to services and programs through the Southern Maine Agency on Aging, Maine Veterans Services, the VA, and other social and support services. There are 60 veteran pairs serving through RSVP, where they build camaraderie through shared experiences and break down walls that can lead to isolation. One Vet-to-Vet volunteer is a Marine who embraces the motto “leave no man behind” in his service. He visits five veterans each week, mowing lawns, taking lonely veterans to lunch, performing minor house and car repairs, going grocery shopping, and talking with vets who may not see anyone else that day. He also serves as a VA certified Veterans’ Service Officer who helps veterans enroll in the VA system and gain access to benefits and services they have earned. Darrell Whitman served two tours in Iraq and knew he wanted to give back to other veterans when he returned to the Gila River Indian community. Darrell and his brother Joey began addressing the needs in his community that he heard about through his membership in the local American Legion Post. He created projects to identify and honor veterans and assisted them with transportation. He has expanded his knowledge and gained additional resources to help the community, especially in the area of employment and economic opportunity, through his three years in the AmeriCorps Veterans Serving Veterans program. His program coordinator says, “Darrell is one of the most passionate, selfless and service-oriented people that I’ve had the pleasure of meeting.” And our CNCS programs and initiatives have the great privilege to assist more than 750,000 veterans and military families. The Washington State Department of Veterans Affairs Vet Corps taps the knowledge, skills, and abilities of veterans by engaging them in AmeriCorps. These members act as peer mentors to veterans and military families at colleges and with community partner sites across the state, connecting them to information about veteran specific programs and services.  Through their service, they help increase veterans success in transitioning from military service to civilian life. Through the Sustainability Institute, Veterans Energy Conservation Corps AmeriCorps members provide energy efficient home repairs and updates that have a significant, long-term impact on housing affordability for homeowners in Charleston, S.C. While finding a unique experience to continue their service, these veterans complete certifications and gain experience that lead to new careers and opportunities. AmeriCorps members serving with the Making Veterans Priority program provide transitional support, resources, and supplemental assistance to veterans and military families across the Tennessee. They offer assistance to veterans and military families during  pre-deployment, deployment, and reintegration, helping connect them to educational benefits, employment services, and crisis intervention services, as well as completing home repairs and projects. Catholic Charities USA engages veterans and military family members to serve as AmeriCorps Peer Navigators. These AmeriCorps members serve veterans, active military members, and military families across Georgia, Massachusetts, Missouri, New Jersey, Pennsylvania, Texas, and Virginia. They ensure that veterans and their families are able to access their benefits, while supporting additional health, mental health, educational, and social service needs. These AmeriCorps members also play a significant role in leveraging additional volunteers responsible for case management and variety of community based projects. Through the University of Maryland Legacy Corps for Veteran and Military Families, AmeriCorps members provide caregiver support services to veteran and military families across California, Florida, Idaho, Illinois, Maine, Minnesota, New Mexico, New York, and Rhode Island. These AmeriCorps members provide respite and offer companionship to veterans, allowing them to remain in their homes and communities and offer support to caregivers and family members. Vets Helping Vets RSVP program in Dane County Wisconsin matches veterans in need with fellow veterans who are Senior Corps RSVP volunteers. Through this program, RSVP volunteers provide rides to veterans and their families who need transportation to medical appointments and other meetings. This summer, the program and its RSVP volunteers were recognized as the Senior Corps program of the year by Serve Wisconsin. With more than 700 RSVP  volunteer drivers across Dane County, the program has made real impact providing more than 8,500 rides to more than 1,100 passengers. We’ve really just scratched the surface of the thousands of service stories we enable by serving with and supporting our veterans and military families. You can see this service in schools, community centers, faith-based organizations, VA facilities, our parklands, and pretty much anywhere you can imagine. We consider it a great honor that so many who have served our nation through the military choose to serve again through our Senior Corps and AmeriCorps national service programs. We are privileged to learn from your examples of leadership and commitment to making our nation a better place for all Americans. We hear this phase a lot, but it can never be repeated enough. … To all the veterans who have answered when our nation called – thank you for your service. View More From our Blog Previous National Service Makes Tax Day a Little Less Taxing Next Hometown Heroes: Dominic Gonzalez Gives Back to San Antonio with AmeriCorps VISTA Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2017-11-09/thank-you-our-veterans",
    "https://nationalservice.tumblr.com/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2017-11-09/thank-you-our-veterans&amp;title=A Thank You to Our Veterans",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2017-11-09/thank-you-our-veterans&amp;title=A Thank You to Our Veterans&amp;source=https://americorps.gov/blogs/2017-11-09/thank-you-our-veterans",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2017-11-09/thank-you-our-veterans&amp;url=https://americorps.gov/blogs/2017-11-09/thank-you-our-veterans&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2017-04-18/national-service-makes-tax-day-little-less-taxing",
    "https://americorps.gov/blogs/2017-12-19/hometown-heroes-dominic-gonzalez-gives-back-san-antonio-americorps-vista",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA",
  "focus_population": [
    "Veterans and Military Families"
  ],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2017",
  "subdomain_2": "11",
  "subdomain_3": "09"
}