{
  "id": "americorpsgov_blogs_2019_05_29_want_healthier_happier_life_volunteer_senior_corpshtml",
  "url": "https://americorps.gov/blogs/2019-05-29/want-healthier-happier-life-volunteer-senior-corps",
  "title": "want-healthier-happier-life-volunteer-senior-corps",
  "content": "Want a Healthier, Happier Life? Volunteer with Senior Corps | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Want a Healthier, Happier Life? Volunteer with Senior Corps Submitted by admin on Wed, 05/29/2019 - 13:28 May 08, 2019 Debroah Cox-Roush, Director, Senior Corps Join CNCS as we celebrate Older Americans Month Community leader, mentor, disaster responder, tutor, patient advocate – these are just a few terms I am proud to use to describe Senior Corps volunteers. Tailored to adults age 55 and over, our Senior Corps Foster Grandparent, Senior Companion, and RSVP volunteer programs include more than 200,000 seniors nationwide who engage in volunteer activities that support critical community services that improve the quality of life for all generations. Now, as we enter May and Older Americans Month , I am delighted to report that while our volunteers are helping others, they are also improving their own health. The Benefits of Senior Corps Service How do I know this? We conducted a rigorous, independent study of more than 1,000 of our Foster Grandparent and Senior Companion volunteers across a three-year period to determine if their service had any effect on their overall health and well-being. The results of the study were astounding and confirmed what we had long suspected – volunteering in Senior Corps bears tremendous health benefits . Our volunteers reported higher self-rated health scores compared to other older adults in similar circumstances who did not volunteer. After two years of service in Senior Corps, 84 percent of older adults reported improved or stable health. And, of those who reported depression at the beginning of the study, 78 percent said they felt less depressed after two years of volunteering. This study shows lower mortality rates, increased strength and energy, lower rates of depression, and fewer physical limitations in those who volunteer in our programs. Combating Depression Beyond the health benefits, what really excites me about this study is the potential it demonstrates for older adults. Older adults are especially vulnerable to health problems linked to depression and social isolation, and often face increased barriers to finding volunteer opportunities. Seniors with financial or physical limitations are also underrepresented in volunteering and are considered a high-risk for poorer health outcomes and other health disparities. Eighty percent of the individuals in this study have household incomes of $20,000 or less and are often underrepresented in other volunteer programs. Senior Corps provides access, structure, and financial support for programs that engage older Americans who otherwise would not be able to volunteer. As a result, volunteers are actively serving their communities, feeling a sense of accomplishment and purpose, and reaping the health benefits. Keeping Up with a Growing Population For more than five decades, older Americans have been serving their communities through Senior Corps programs that meet needs in education, health care, and other safety net services across the country. These volunteers contribute more than 55 million hours annually, service worth more than $1 billion to the U.S. economy. The contributions of senior volunteers will likely grow as this age group grows to make up one-fifth of the U.S. population by 2030. We know older adults are tremendous assets who provide enormous social and economic benefits to their communities. So, if you or a senior in your community wants to live a healthier, happier life – join Senior Corps. And join us as we celebrate Older Americans Month and support Senior Corps by spreading the word about the personal and community benefits of volunteering. Click here to read President Trump’s Older Americans Month Proclamation Deborah Cox-Roush is Director of Senior Corps at the Corporation for National and Community Service. Click here to learn more about Senior Corps and visit our Healthy Volunteers page to discover more about the health benefits of Senior Corps volunteering . Previous True Tales of Lives and Futures that were #MadeInAmeriCorps Next Combating Social Isolation with Service Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2019-05-29/want-healthier-happier-life-volunteer-senior-corps",
    "https://acl.gov/oam/2019/older-americans-month-2019",
    "https://www.whitehouse.gov/presidential-actions/presidential-proclamation-older-americans-month-2019/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2019-05-29/want-healthier-happier-life-volunteer-senior-corps&amp;title=Want a Healthier, Happier Life? Volunteer with Senior Corps",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2019-05-29/want-healthier-happier-life-volunteer-senior-corps&amp;title=Want a Healthier, Happier Life? Volunteer with Senior Corps&amp;source=https://americorps.gov/blogs/2019-05-29/want-healthier-happier-life-volunteer-senior-corps",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2019-05-29/want-healthier-happier-life-volunteer-senior-corps&amp;url=https://americorps.gov/blogs/2019-05-29/want-healthier-happier-life-volunteer-senior-corps&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2019-05-29/true-tales-lives-and-futures-were-madeinamericorps",
    "https://americorps.gov/blogs/2019-05-29/combating-social-isolation-service",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2019",
  "subdomain_2": "05",
  "subdomain_3": "29"
}