{
  "id": "americorpsgov_blogs_2023_01_20_mlk_day_2023_coast_coast_americans_stepped_honor_dr_martin_luther_king_jrhtml",
  "url": "https://americorps.gov/blogs/2023-01-20/mlk-day-2023-coast-coast-americans-stepped-honor-dr-martin-luther-king-jr",
  "title": "mlk-day-2023-coast-coast-americans-stepped-honor-dr-martin-luther-king-jr",
  "content": "MLK Day 2023: Coast to Coast, Americans Stepped up in honor of Dr. Martin Luther King, Jr.  | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb MLK Day 2023: Coast to Coast, Americans Stepped up in honor of Dr. Martin Luther King, Jr. Submitted by dsong on Thu, 01/19/2023 - 14:53 Jan 20, 2023 AmeriCorps Staff In honor of Dr. Martin Luther King, Jr., Americans stepped up during the 2023 MLK Day of Service to build bridges and heal divides across the nation. Thousands of Americans joined service projects to help create the Beloved Community of Dr. King’s dreams. Volunteers united in Dr. King’s legacy by assembling care packages for community members impacted by natural disasters, revamping schools, joining local park cleanups, and helping those who are food insecure. Check out some of the MLK Day service projects from across the nation: Alabamians Clean Up Birmingham AmeriCorps members with Black Warrior Riverkeeper teamed up with Birmingham City Councilor Clinton Woods and local volunteers to clean up the Alabama city. More than 90 volunteers gathered to clear over one ton of litter. Our #MLKDay #AmeriCorps Cleanup with Birmingham City Council’s Councilor Clinton Woods featured 93 volunteers who removed 1,791.5 lbs of litter from #Birmingham District 1! To join future cleanups, please visit: https://t.co/V9hROsfrgI pic.twitter.com/gIGryJW1XC< BWRiverkeeper (@BWRiverkeeper) January 18, 2023 The Golden State Gives Back to the Environment Volunteers gathered in Southern California to participate in L.A. Works and Los Angeles Memorial Coliseum’s MLK Day of Service—the largest volunteer event in the county. They helped create urban greening kits for school programs and youth centers, hosted a panel discussion on environmental stewardship, assembled disaster preparedness kits for underserved communities, and more. Shout out to all those who made it a day on & not a day off with @LAWorksNow at @lacoliseum for their annual #MLKDay of Service — volunteers assembled Urban Greening Kits to serve South LA’s school program & youth centers.👏🌳 Find an opp. near you.⤵️ https://t.co/jr9Yk4m5xk pic.twitter.com/jgO0Z4UhT7 — California Volunteers (@CalVolunteers) January 17, 2023 Older Adults Lead by Example AmeriCorps Seniors volunteers and students in Albuquerque, N.M. shared their gratitude for community members this MLK Day of Service. Together, they wrote cards and painted their gratitude on rocks for veterans, teachers, and fellow older adults in the community. Young Adults in North Carolina Paint the Town Members of Habitat for Humanity, Greensboro joined forces with volunteers to revamp the city. More than 300 volunteers served on construction projects, like repainting and building fences, and cleanups to help beautify the community. View this post on Instagram A post shared by Habitat Greensboro (@habitat_gso) Vice President Joins AmeriCorps CEO for MLK Day of Service Project And in Washington, DC, there was no shortage of service. Vice President Kamala volunteered with AmeriCorps CEO Michael D. Smith and US Department of Education Secretary Miguel Cardona at George Washington University for the campus’ annual service event that draws hundreds of students, staff, and faculty. Led by GW Serves JumpStart , the administration leaders and campus volunteers created activities for children to learn numbers and recognize colors. We each have a responsibility as citizens to make our communities better. On this National Day of Service, @SecCardona and I spent time with young leaders in honor of Rev. Dr. Martin Luther King, Jr. pic.twitter.com/MWTNWYgEYV — Vice President Kamala Harris (@VP) January 16, 2023 Americans like these volunteers put Dr. King’s words, “Darkness cannot drive out darkness: only light can do that. Hate cannot drive out hate: only love can do that,” into action. Over the past week, that love could be felt across the nation as Americans united in their communities to serve and heal divides. Through volunteerism, we showed up in full force for our neighbors to deliver on the promise of Dr. King’s example. This year was a defining moment, and AmeriCorps encourages you to keep the momentum going. Engage your community. Find volunteer opportunities to take constructive action and carry Dr. King’s mission throughout the rest of the year. Learn more about the Martin Luther King, Jr., National Day of Service at AmeriCorps.gov/MLKDay. Previous From Presidents to Doctors and Neighbors, Americans Help Create Dr. King’s Beloved Community Next Fight Hunger During National Canned Food Month Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-01-20/mlk-day-2023-coast-coast-americans-stepped-honor-dr-martin-luther-king-jr",
    "https://blackwarriorriver.org/",
    "https://twitter.com/hashtag/MLKDay?src=hash&amp;amp;ref_src=twsrc%5Etfw",
    "https://twitter.com/hashtag/AmeriCorps?src=hash&amp;amp;ref_src=twsrc%5Etfw",
    "https://twitter.com/hashtag/Birmingham?src=hash&amp;amp;ref_src=twsrc%5Etfw",
    "https://t.co/V9hROsfrgI",
    "https://twitter.com/BWRiverkeeper/status/1615731070380523521?ref_src=twsrc%5Etfw",
    "https://twitter.com/hashtag/AmeriCorpsWeek?src=hash&amp;ref_src=twsrc%5Etfw",
    "https://twitter.com/AmeriCorps?ref_src=twsrc%5Etfw",
    "https://t.co/S2QYOGD4xb",
    "https://twitter.com/AmeriCorpsCEO/status/1503168687313928196?ref_src=twsrc%5Etfw",
    "https://www.laworks.com/",
    "https://www.lacoliseum.com/",
    "https://twitter.com/LAWorksNow?ref_src=twsrc%5Etfw",
    "https://twitter.com/lacoliseum?ref_src=twsrc%5Etfw",
    "https://twitter.com/hashtag/MLKDay?src=hash&amp;ref_src=twsrc%5Etfw",
    "https://t.co/jr9Yk4m5xk",
    "https://t.co/jgO0Z4UhT7",
    "https://twitter.com/CalVolunteers/status/1615190051734056961?ref_src=twsrc%5Etfw",
    "https://www.cabq.gov/seniors?fbclid=IwAR1mhf5Dd6qlbsQzM646cIw3D4jfspVdlSL2DRFNU3BRSuMVFoLr0Vka9K0",
    "https://habitatgreensboro.org/",
    "https://www.instagram.com/p/CnZ2mYnu28F/?utm_source=ig_embed&amp;utm_campaign=loading",
    "https://www.instagram.com/p/CnZ2mYnu28F/?utm_source=ig_embed&amp;utm_campaign=loading",
    "https://www.instagram.com/p/CnZ2mYnu28F/?utm_source=ig_embed&amp;utm_campaign=loading",
    "https://serve.gwu.edu/jumpstart-gw#:~:text=Jumpstart%20is%20a%20national%20AmeriCorps,neighborhoods%20for%20an%20academic%20year.",
    "https://twitter.com/SecCardona?ref_src=twsrc%5Etfw",
    "https://t.co/MWTNWYgEYV",
    "https://twitter.com/VP/status/1615128775410212864?ref_src=twsrc%5Etfw",
    "https://americorps.gov/join/find-volunteer-opportunity#/",
    "http://americorps.gov/MLKDay",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-01-20/mlk-day-2023-coast-coast-americans-stepped-honor-dr-martin-luther-king-jr&amp;title=MLK Day 2023: Coast to Coast, Americans Stepped up in honor of Dr. Martin Luther King, Jr. ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-01-20/mlk-day-2023-coast-coast-americans-stepped-honor-dr-martin-luther-king-jr&amp;title=MLK Day 2023: Coast to Coast, Americans Stepped up in honor of Dr. Martin Luther King, Jr. &amp;source=https://americorps.gov/blogs/2023-01-20/mlk-day-2023-coast-coast-americans-stepped-honor-dr-martin-luther-king-jr",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-01-20/mlk-day-2023-coast-coast-americans-stepped-honor-dr-martin-luther-king-jr&amp;url=https://americorps.gov/blogs/2023-01-20/mlk-day-2023-coast-coast-americans-stepped-honor-dr-martin-luther-king-jr&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2022-12-23/presidents-doctors-neighbors-americans-help-create-dr-kings-beloved-community",
    "https://americorps.gov/blogs/2023-02-15/fight-hunger-during-national-canned-food-month",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [
    "Urban"
  ],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "01",
  "subdomain_3": "20"
}