{
  "id": "americorpsgov_blogs_2023_04_05_national_public_health_week_explore_your_future_public_health_americorpshtml",
  "url": "https://americorps.gov/blogs/2023-04-05/national-public-health-week-explore-your-future-public-health-americorps",
  "title": "national-public-health-week-explore-your-future-public-health-americorps",
  "content": "This National Public Health Week Explore Your Future with Public Health AmeriCorps | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb This National Public Health Week Explore Your Future with Public Health AmeriCorps Submitted by eschneider on Thu, 03/30/2023 - 11:08 Apr 05, 2023 AmeriCorps staff Are you looking to make a difference in your community while also establishing a fulfilling and successful career? In celebration of National Public Health Week, AmeriCorps is raising awareness of Public Health AmeriCorps, a new program in partnership with CDC that is recruiting, training, and developing the next generation of public health leaders. “AmeriCorps connects incredible people like you to programs that are improving our nation by serving others,” says AJ Pearlman, Public Health AmeriCorps director. “Togethering, we aim to open doors for people who want to make an impact. Joining Public Health AmeriCorps is an opportunity to drive change while also gaining valuable, first-hand experience to jumpstart your career in public health.” Public Health AmeriCorps is currently recruiting thousands of people to serve in public health roles at health departments, government agencies, community-based organizations, schools, and other settings across the US. Depending on organizational and community needs, some common roles include: nutrition education; vaccine confidence and uptake support; mental health training and mentorship; chronic disease education and management; and garden to table programming tackling food insecurity. For example, AmeriCorps members helped more than 2.5 million people at COVID-19 vaccination sites and conducted 1.7 million wellness checks. Members are also helping women and veterans access healthy foods through a garden-to-table program, assisting local emergency management programs to prepare for the next disaster, providing mental wellness counseling to students, and much more. AmeriCorps members and AmeriCorps Seniors volunteers serving during the height of the pandemic. “We all saw the importance of a strong public health system during the COVID-19 pandemic. While many of today’s public health needs are related to COVID-19 recovery, our nation is also grappling with critical challenges around mental health, substance abuse, health equity, nutrition, access to care, climate change, and more,” says Pearlman. “That’s why we’re recruiting and training changemakers who want to help address these urgent challenges in their communities.” Members receive on-site, hands-on experience and have access to a comprehensive training program. In addition, members receive benefits including: education award (applicable to higher education or student loan forgiveness); student loan deferment or forbearance; living allowance; and training from experts. Adults of all ages and backgrounds are eligible to join Public Health AmeriCorps—whether you’ve never thought about public health as a career or have some experience but need help with a path forward. Public Health AmeriCorps is focused on recruiting members who live in, come from, and represent the communities they serve. Visit AmeriCorps.gov/PublicHealth for a complete list of opportunities and guidance on how to apply. Part-time and full-time roles are available in rural and urban locations across nearly every state, DC, Guam and Puerto Rico. Contact publichealth@americorps.gov with any questions. Previous AmeriCorps Members and Volunteers Build Meaningful Relationships to Help Students Succeed Next Arizona’s Older Adults Display the Power of Service Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-04-05/national-public-health-week-explore-your-future-public-health-americorps",
    "http://www.americorps.gov/publichealth",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-04-05/national-public-health-week-explore-your-future-public-health-americorps&amp;title=This National Public Health Week Explore Your Future with Public Health AmeriCorps ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-04-05/national-public-health-week-explore-your-future-public-health-americorps&amp;title=This National Public Health Week Explore Your Future with Public Health AmeriCorps &amp;source=https://americorps.gov/blogs/2023-04-05/national-public-health-week-explore-your-future-public-health-americorps",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-04-05/national-public-health-week-explore-your-future-public-health-americorps&amp;url=https://americorps.gov/blogs/2023-04-05/national-public-health-week-explore-your-future-public-health-americorps&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-03-24/americorps-members-volunteers-build-meaningful-relationships-help-students-succeed",
    "https://americorps.gov/blogs/2023-05-08/arizonas-older-adults-display-power-service",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors; Public Health AmeriCorps",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "04",
  "subdomain_3": "05"
}