{
  "id": "americorpsgov_blogs_2023_09_29_avengers_civic_engagementhtml",
  "url": "https://americorps.gov/blogs/2023-09-29/avengers-civic-engagement",
  "title": "avengers-civic-engagement",
  "content": "The Avengers of Civic Engagement | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb The Avengers of Civic Engagement Submitted by dsong on Fri, 09/29/2023 - 16:33 Sep 29, 2023 AmeriCorps Staff Every day, there are individuals who make a significant impact on the world around them. These are the everyday superheroes who improve our lives through selfless acts of kindness and service. From the volunteer at the local food bank to the neighbor helping you with groceries, these individuals are heroes of our communities. They may not wear capes or have superpowers, but their actions make a real difference in the lives of those around them. As we look back at some of the most triumphant moments of service during AmeriCorps’ 30th anniversary celebrations, let’s explore how Americans show up and embrace civic engagement. Earlier in 2023, AmeriCorps released our Volunteering and Civic Life in America research, which showed that 60.7 million Americans volunteered more than 4.1 billion hours between September 2020 and 2021. This is estimated to have an economic value of $122.9 billion. Our latest analysis shows that Americans also make a difference in their communities in a myriad of other ways. These Americans are the everyday heroes of our nation – the avengers of civic engagement. The assembled team of avengers has four different types of heroes: joiners, neighbors, advocates, and informers. Together, these heroes work in tandem to help create lasting change in our communities. The Joiners Even during the height of the COVID-19 pandemic, Americans continued to serve through organizations. These Americans joined, volunteered with, and donated to local nonprofit and community-based organizations, finding new ways to engage with their communities and foster a sense of constructive action, civic participation, and belonging. These “joiners” continue to support American schools and shelters, hospitals and hotlines, food banks, and civic, nonprofit, tribal, and faith-based organizations across the country. Take for example this past September 11 National Day of Service and Remembrance . Americans from all walks of life united to honor and remember the lives lost that day through volunteerism. More than 1,500 community members, including the Chicago State University women’s basketball team, volunteered to help pack more than 450,000 meals. These volunteers joined thousands of volunteers across the country to pack more than 6.5 million meals for communities in need. Serve Illinois and AmeriCorps members at the 2023 9/11 Day meal pack The Neighbors We also see Americans volunteer informally every day. Despite challenges, Americans continue to serve each other and their communities, giving their time to help neighbors in need during one of our most challenging times. They helped neighbors by doing favors like watching each other’s children, running errands, checking on older adult neighbors, and other activities to lend a hand. These acts of kindness were as simple as talking to each other or uniting neighbors to do something positive for their community. Historically, we’ve seen the impact neighbors have on the next generation. Paul and Louise Squibb were Neighbors known for tidying up their town of Cambria, Calif. Decades later, Beautify Cambria Association decided to keep their tradition alive by designating a “Squibbing” Day where community members honor Paul and Louise Squibb through neighborhood cleanups. In 2022, community members, old and young, participated in \"squibbing\" for 9/11 Day of Service, inspiring the next generation to take care of our planet. Paul and Louise Squibb in Cambria, Calif. The Advocates Advocates are the Americans who fulfill their civic duty through political engagement. Whether it be contacting public officials, donating to a political cause, attending public meetings, or voting in local elections, these ”advocates” help make change through the channels of democracy. Advocates use their voices and words to influence their network. Oftentimes they help raise awareness, promote, or advance a cause or social issues like climate change and racial equity. We see advocates use the power of their voices all around us in art, music, and social media. We see them sharing their stories through films, expressing their stance through their art and music, or even helping Americans vote at polling stations during elections. The Informers Informers are our friends and family who teach us about the important issues at stake. Whether it’s discussing challenges our nation faces at the dinner table or exchanging thoughts on our community’s most pressing issues with friends, informers help spread awareness and educate our immediate social circle. We see informers in the national service community, too, like our member Livvie . Livvie’s older sister, Sophie, decided to take a gap year and joined AmeriCorps NCCC after high school in 2020 during the COVID-19 pandemic. Sophie tutored kids, served at food pantries, helped at vaccination and testing clinics, and supported conservation efforts at the Montana State Parks. Livvie was inspired to join AmeriCorps NCCC’s Summer of Service program after hearing how Sophie’s service not only transformed communities across the nation but also her life perspective, too. Livvie served in Little Rock, Ark., at a nonprofit organization that aims to preserve and restore its historic property. For three months, Livvie made a difference in the Little Rock community, helping prepare and plant crops for their hunger relief garden; tending to gardens and livestock; building new fence lining and water stations in grazing pastures; and educating the community on where their food is from and how it's made. Livvie serving in Little Rock, Ark. Join the Avengers Americans from all walks of life choose to serve and make a difference in our communities every day – and they are heroes to their friends, families, neighbors, and strangers alike. Those who engage in their community often possess a variety of unique and valuable superpowers that enable them to make a difference in the world. These superpowers may include compassion, empathy, a strong sense of community, and a desire to help those in need. And service allows individuals to utilize these qualities in a meaningful way and contribute to a greater cause. Whether they’re donating books to the local school, encouraging community members to vote, or joining a nonprofit, Americans have their own unique skills to help strengthen our nation’s civic engagement and life. Join AmeriCorps’ efforts to support civic engagement across the nation. Find service opportunities that match your interests and passion . Plus, reap the health and education benefits national service offers members and volunteers. Learn more about the data and analysis behind the avengers of civic engagement. Thumbnail image credit to Mimi Teller, Red Cross Los Angeles Region Previous 30th Anniversary: The Honor of Serving with AmeriCorps’ Inaugural Class Next Recognizing the Strength and Culture of Indigenous Communities Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-09-29/avengers-civic-engagement",
    "https://americorps.gov/newsroom/press-release/607-million-americans-volunteered-2021-americorps-reports",
    "https://americorps.gov/blogs/2023-09-15/america-unites-911-day-service",
    "https://americorps.gov/stories/beautify-cambria-association",
    "https://americorps.gov/blogs/2023-07-20/summer-remember-my-familys-inspiration-make-difference-communities",
    "http://americorps.gov/FitFinder",
    "https://americorps.gov/members-volunteers/your-benefits",
    "https://data.americorps.gov/Volunteering-and-Civic-Engagement/2021-CEV-Current-Population-Survey-Civic-Engagemen/rgh8-g2uc",
    "https://osf.io/preprints/socarxiv/2b9hd/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-09-29/avengers-civic-engagement&amp;title=The Avengers of Civic Engagement",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-09-29/avengers-civic-engagement&amp;title=The Avengers of Civic Engagement&amp;source=https://americorps.gov/blogs/2023-09-29/avengers-civic-engagement",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-09-29/avengers-civic-engagement&amp;url=https://americorps.gov/blogs/2023-09-29/avengers-civic-engagement&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-09-21/30th-anniversary-honor-serving-americorps-inaugural-class",
    "https://americorps.gov/blogs/2023-10-06/recognizing-strength-culture-indigenous-communities",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "09",
  "subdomain_3": "29"
}