{
  "id": "americorpsgov_blogs_2023_03_17_americorps_unites_celebration_five_careers_you_can_train_public_health_americorpshtml",
  "url": "https://americorps.gov/blogs/2023-03-17/americorps-unites-celebration-five-careers-you-can-train-public-health-americorps",
  "title": "americorps-unites-celebration-five-careers-you-can-train-public-health-americorps",
  "content": "AmeriCorps Unites in Celebration: Five Careers You Can Train for in Public Health AmeriCorps | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps Unites in Celebration: Five Careers You Can Train for in Public Health AmeriCorps Submitted by rfrazier on Thu, 03/16/2023 - 19:36 Mar 17, 2023 AmeriCorps Staff Public health is at the root of many pressing community issues like pollution, disease, nutrition, gun violence, disaster preparedness, access to healthcare and more, which impacts community health. Hundreds of thousands of Americans work in public health, in a wide variety of interesting and exciting jobs. If you’re curious about a career in public health, it can be hard to know where to start. Serving with Public Health AmeriCorps can help you narrow down your interests, build skills, and decide which career path is right for you. Serve with Public Health AmeriCorps for one year in full-time or part-time roles at nonprofit, government, and community-based organizations. AmeriCorps members receive hands on experience, training from experts, a living allowance, student loan deferment or forbearance, and an education award that can be used for school or existing student loans. Not convinced, yet? Here are five careers that Public Health AmeriCorps service can prepare you for: 1. Community Health Worker On the frontlines, community health workers are closely tied to the communities they serve. They are trusted liaisons between health/social services and the community to improve service access, quality of service, and cultural competence. They perform activities like outreach, community education, social support, and advocacy. These organizations are actively recruiting AmeriCorps members to be trained as community health workers: Rio Arriba County Health and Human Services Department (New Mexico) Kentucky Health Departments Association (Kentucky) Volunteers of America (Colorado, Florida, Illinois, Kentucky, Minnesota, Nebraska, Puerto Rico, Texas) 2. Health Communication and Public Relations Effective communication can help people stay healthy. Health communication professionals help people understand health-related information, risks, and actions and inform community decisions around public health initiatives. These organizations are recruiting AmeriCorps members to support health communication: National Network of Public Health Institutes (Louisiana, Maine, Massachusetts, Puerto Rico, Washington, DC) Boston Public Health Commission (Massachusetts) George Mason University (Virginia) 3. Behavioral Scientist Ever wonder about the answers to big public health questions? Maybe you’ve wondered how social media affects mental health, or if playing video games correlates with a higher risk of violence? Behavioral scientists answer these tough questions by studying how people’s behaviors impact their health. Ultimately, their studies can inform how to have a healthier future. These organizations have behavioral health-related AmeriCorps positions available now: Health Federation of Philadelphia (California, Delaware, Pennsylvania) Wisconsin Association of Free & Charitable Clinics (Wisconsin) Healing Action Network, Inc. (Missouri) 4. Environmental Health Specialist Environmental Health Specialists help prevent the spread of diseases by performing critical work like restaurant inspections, water testing, and day care center evaluations. They also support emergency preparedness for natural disasters or disease outbreaks, like we just saw during the COVID-19 pandemic These organizations are recruiting AmeriCorps members to help prevent and limit the spread of infectious diseases: OCHIN, Inc . (Massachusetts, Minnesota, North Carolina, Ohio, Oregon, Wisconsin) Los Angeles County Department of Public Health (California) Arizona State University (Arizona, Florida, Indiana, Kansas, Kentucky, Massachusetts, New York, North Carolina, Ohio, Pennsylvania, Texas) 5. Community Health Center Case Manager Community Health Centers are hubs for all essential healthcare services. They are community-based organizations that serve populations with limited access to health care. Case managers help people navigate the healthcare system by connecting them to resources and services. These Community Health Centers are recruiting AmeriCorps members: Sixteenth Street Community Health Center (Wisconsin) Community Health Care Association of New York State (New York) Community Health Center, Inc. (Connecticut) Be a changemaker in your community now. Don’t wait until the next public health crisis. Whether you’re looking for a way to spend a gap year, gain post-graduate experience, or navigate a career transition, you can help address our country’s public health needs by serving with Public Health AmeriCorps. Apply today to build your resume and kickstart your career in public health. Don’t miss out! Previous AmeriCorps Unites in Celebration: Veterans Serve Because We Care Next Continue to Unite in Service: Choose AmeriCorps Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-03-17/americorps-unites-celebration-five-careers-you-can-train-public-health-americorps",
    "https://americorps.gov/about/what-we-do/public-health-americorps",
    "https://americorps.gov/funded-grants/public-health-americorps",
    "https://americorps.gov/funded-grants/public-health-americorps",
    "https://americorps.gov/funded-grants/public-health-americorps",
    "https://americorps.gov/funded-grants/public-health-americorps",
    "https://americorps.gov/funded-grants/public-health-americorps",
    "https://americorps.gov/funded-grants/public-health-americorps",
    "https://americorps.gov/funded-grants/public-health-americorps",
    "https://americorps.gov/funded-grants/public-health-americorps",
    "https://americorps.gov/funded-grants/public-health-americorps",
    "https://americorps.gov/funded-grants/public-health-americorps",
    "https://americorps.gov/funded-grants/public-health-americorps",
    "https://americorps.gov/funded-grants/public-health-americorps",
    "https://americorps.gov/funded-grants/public-health-americorps",
    "https://americorps.gov/funded-grants/public-health-americorps",
    "https://americorps.gov/funded-grants/public-health-americorps",
    "https://americorps.gov/about/what-we-do/public-health-americorps",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-03-17/americorps-unites-celebration-five-careers-you-can-train-public-health-americorps&amp;title=AmeriCorps Unites in Celebration: Five Careers You Can Train for in Public Health AmeriCorps ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-03-17/americorps-unites-celebration-five-careers-you-can-train-public-health-americorps&amp;title=AmeriCorps Unites in Celebration: Five Careers You Can Train for in Public Health AmeriCorps &amp;source=https://americorps.gov/blogs/2023-03-17/americorps-unites-celebration-five-careers-you-can-train-public-health-americorps",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-03-17/americorps-unites-celebration-five-careers-you-can-train-public-health-americorps&amp;url=https://americorps.gov/blogs/2023-03-17/americorps-unites-celebration-five-careers-you-can-train-public-health-americorps&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-03-16/americorps-unites-celebration-veterans-serve-because-we-care",
    "https://americorps.gov/blogs/2023-03-22/continue-unite-service-choose-americorps",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "Public Health AmeriCorps",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "03",
  "subdomain_3": "17"
}