{
  "id": "americorpsgov_blogs_2021_09_10_never_forget_our_fallen_honor_their_memory_through_servicehtml",
  "url": "https://americorps.gov/blogs/2021-09-10/never-forget-our-fallen-honor-their-memory-through-service",
  "title": "never-forget-our-fallen-honor-their-memory-through-service",
  "content": "Never Forget Our Fallen: Honor Their Memory Through Service | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Never Forget Our Fallen: Honor Their Memory Through Service Submitted by mbrodbeck on Fri, 09/10/2021 - 12:30 Sep 10, 2021 Mary Tobin Today, my heart aches for the 13 US troops killed in the suicide attack near the Kabul airport and their families, as they helped us end America’s longest war. My heart also still aches almost 20 years later for the 3,000 people we lost on September 11, 2001, and the first responders who sacrificed for all of us. When I grieve for our fallen and their families, I reflect on how best to honor their memory. To show that we will never forget the bravery of our heroes, we must remember the power of service. As our nation prepares to commemorate the 20th anniversary of the 9/11 attacks, we know our military—those young service members who willingly put themselves in harm’s way for their country—will continue to step up, to raise their hands, to serve. And so can you. America needs service now more than ever. We need people willing to honor our country and our heroes by serving at home, by being heroes to those who need our help. There is a place for everyone one of us in national service, regardless of gender, ethnicity, education, or background. Even if you can only serve for one day, as a volunteer, we need you in our ranks. From a young age, I was privileged to serve in many capacities—as a leader in JROTC in middle school, as a West Point graduate, as a two-tour Army combat veteran, and now at AmeriCorps helping bridge the gap between military and national service. Serving can mean shouldering a rifle or tutoring a child. Through my service, I hope to share what I have learned and convey how meaningful a life of service can be, personally, and how impactful it is in our communities and country. I deployed to Iraq twice. Some of my friends were killed supporting the simple right of people in another country to vote, the right to have a democracy like ours. My brothers and sisters lost their lives for an idea of America that goes beyond race or creed. They believed that the concept of America, the idea of a place where we are all treated equally, is worth sacrificing for and committing to service. That power of service to unite people from differing backgrounds in a common mission is greater than anything I have seen. My fallen brothers and sisters did great things through service, but even if they only served one human being, their sacrifice wasn’t in vain. Just this past month, we’ve seen service members rocking babies to sleep, helping get interpreters and families out of danger. We’ve seen Americans welcome evacuees into their homes as part of Operation Allies Welcome. But, you don’t need a military uniform to commit to service. Service can be as personal as helping one person—whether it’s holding a door for your elderly neighbor or donating supplies to a local school. This September 11, thousands of Americans across the country will be packing meals for those who are food insecure, beautifying community parks, or cleaning the headstones of fallen service members. 9/11 Day of Service and Remembrance lets Americans answer the call to serve here at home. My goal is to see this one-day act of service become an annual tradition for all Americans. It’s a time to reflect—and act—on what our nation can accomplish when people give others their time, their expertise, and their compassion for the common good. Bringing more people into a national service movement will unite us. It will strengthen our democracy. On this 9/11 Day, I challenge all of you to act. Even the smallest act of service, the simplest act of kindness, honors the American lives lost two decades ago and helps the nation transform a day of tragedy into a day of service. So, how will you step forward today and honor 9/11? To learn more about service opportunities through AmeriCorps programs, visit www.americorps.gov . Mary Tobin is a two-time combat veteran appointed by the Biden Administration to serve AmeriCorps as its senior advisor for veterans, military families, and wounded warriors. Previous Four Ways for Millennials and Gen Z to Make an Impact on 9/11 Next Colorado Tackles the Climate Crisis through Creation of State’s First Climate Corps Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2021-09-10/never-forget-our-fallen-honor-their-memory-through-service",
    "http://www.americorps.gov",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2021-09-10/never-forget-our-fallen-honor-their-memory-through-service&amp;title=Never Forget Our Fallen: Honor Their Memory Through Service ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2021-09-10/never-forget-our-fallen-honor-their-memory-through-service&amp;title=Never Forget Our Fallen: Honor Their Memory Through Service &amp;source=https://americorps.gov/blogs/2021-09-10/never-forget-our-fallen-honor-their-memory-through-service",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2021-09-10/never-forget-our-fallen-honor-their-memory-through-service&amp;url=https://americorps.gov/blogs/2021-09-10/never-forget-our-fallen-honor-their-memory-through-service&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2021-09-07/four-ways-millennials-gen-z-make-impact-911",
    "https://americorps.gov/blogs/2021-09-15/colorado-tackles-climate-crisis-through-creation-states-first-climate-corps",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2021",
  "subdomain_2": "09",
  "subdomain_3": "10"
}