{
  "id": "americorpsgov_blogs_2022_03_14_celebrate_americorps_all_weekhtml",
  "url": "https://americorps.gov/blogs/2022-03-14/celebrate-americorps-all-week",
  "title": "celebrate-americorps-all-week",
  "content": "Celebrate AmeriCorps All Week | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Celebrate AmeriCorps All Week Submitted by eschneider on Mon, 03/14/2022 - 14:14 Mar 14, 2022 AmeriCorps staff Dear Ameri-Family, Across the nation AmeriCorps continues to be a force multiplier bringing diverse individuals and institutions together to tackle some of the nation’s toughest challenges. During these extraordinary times, AmeriCorps members have provided extraordinary service by keeping our kids in school and on track, and helping our communities build back stronger than before. Please join me in continuing to celebrate these accomplishments throughout AmeriCorps Week, as we thank those who serve and support national service across our country and encourage others to follow in their footsteps. I hit the road over the weekend visiting Mississippi and Louisiana and I am looking forward to continuing visiting program sites this week in Alabama, DC, Virginia, and Minnesota to see the power of service in action. Get ready to show off your AmeriCorps gear Thursday on #DayOfTheA and stay tuned for the latest AmeriCorps Week news. Thank you for all your contributions to advance our mission. I am proud to be part of this team and all the work being done in communities around the country. Happy AmeriCorps Week! In Service, Michael AmeriCorps members and volunteers bring hope and opportunity to families and communities that need it most. Join us in celebrating #AmeriCorpsWeek and follow @AmeriCorps as we highlight stories across the country! pic.twitter.com/S2QYOGD4xb — Michael D. Smith (@AmeriCorpsCEO) March 14, 2022 Join the AmeriCorps Week Celebration We loved hearing about what you are planning throughout this week and can't wait to see it in action. Some of you are already featured in the news. Check it out! Senators Manchin and Capito welcomed five AmeriCorps NCCC teams to the Mountain state of West Virginia. These AmeriCorps members will support tax preparation, river and trail revitalization, and more. #AmeriThanks @Sen_JoeManchin & @SenCapito for welcoming 5⃣ @AmeriCorpsNCCC teams to the Mountain State of West Virginia! Together, these @AmeriCorps members will get things done to support tax prep, river + trail revitalization & more ⤵️ https://t.co/Mxsq6DTiHc — AmeriCorps NCCC (@AmeriCorpsNCCC) March 12, 2022 Read more AmeriCorps Week observed March 13-19 - Tullahoma News - March 10, 2022 AmeriCorps Week celebrating people helping tackle country's challenges - Yahoo news - March 10, 2022 Celebrating local heroes serving in AmeriCorps - Bethany Ridgeway – Coleman Today - March 10, 2022 Sens. Manchin, Capito announce five new AmeriCorps projects across West Virginia - WVNews - March 11, 2022 AmeriCorps Week kicks off Sunday, thanking volunteers serving in Weld and Larimer counties - The Denver Gazette - March 12, 2022 UG celebrates AmeriCorps partnership by recognizing AmeriCorps Week - Unified Government of Wyandotte County and Kansas City KS - March 11, 2022 Join Two Social Media Events Day of the A: Thursday, March 17 Show off your AmeriCorps gear – new logo, old logo – it doesn’t matter! Don your favorite tee, break out your old baseball cap, or show off your AmeriCorps-themed arts and crafts project. Take a photo and share it on your personal social media channels in honor of the #DayoftheA. Don't forget to tag @AmeriCorps and use the hashtag #DayoftheA in your posts. #AmeriThanks Thunderclap: Friday, March 18, noon ET End AmeriCorps Week with a bang by saying thank you to all our member and volunteers across the US. Join us on Friday by sharing our #AmeriThanks social media post found in the social press kit from your Twitter, Facebook, or Instagram account. Be sure to use the same graphic, include the hashtags #AmeriCorpsWeek and #AmeriThanks, and tag @AmeriCorps in your post. Need Engagement Ideas? We've got you covered! Share AmeriCorps' Impact. Through op-eds, letters to the editor, social media, or other communications channels, you can highlight the impact of the work members do in your community. Host an “honorary AmeriCorps  member”. Invite media, an elected official, a community leader, school principal, AmeriCorps alumnus, or other local dignitary to see AmeriCorps in action by becoming an “honorary AmeriCorps member” or by doing a site visit. In previous years, we've seen leaders from across the country participate in their local communities. More ideas This AmeriCorps Week join with us as we celebrate the impact of our programs and offer our thanks to members and volunteers for making an impact and serve others. Together, we can help the country recover and come back stronger. Together, we persevere. Together, we are AmeriCorps. Visit our website for more information and follow the digital conversation about AmeriCorps Week on AmeriCorps' Facebook, Twitter, Instagram, and LinkedIn. Happy AmeriCorps Week! Previous New $25K grants available to bring generations together in service Next National Service Alumna’s Passion for History Led Her to Find Lifelong Commitment to Serving People Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2022-03-14/celebrate-americorps-all-week",
    "https://twitter.com/hashtag/AmeriCorpsWeek?src=hash&amp;ref_src=twsrc%5Etfw",
    "https://twitter.com/AmeriCorps?ref_src=twsrc%5Etfw",
    "https://t.co/S2QYOGD4xb",
    "https://twitter.com/AmeriCorpsCEO/status/1503168687313928196?ref_src=twsrc%5Etfw",
    "https://www.wvnews.com/theet/news/sens-manchin-capito-announce-five-new-americorps-projects-across-west-virginia/article_bfbd2fc0-a162-11ec-992e-ebb9edaa9e10.html",
    "https://twitter.com/hashtag/AmeriThanks?src=hash&amp;ref_src=twsrc%5Etfw",
    "https://twitter.com/Sen_JoeManchin?ref_src=twsrc%5Etfw",
    "https://twitter.com/SenCapito?ref_src=twsrc%5Etfw",
    "https://twitter.com/AmeriCorpsNCCC?ref_src=twsrc%5Etfw",
    "https://twitter.com/AmeriCorps?ref_src=twsrc%5Etfw",
    "https://t.co/Mxsq6DTiHc",
    "https://twitter.com/AmeriCorpsNCCC/status/1502726926502436868?ref_src=twsrc%5Etfw",
    "https://www.tullahomanews.com/news/local/americorps-week-observed-march-13-19/article_f0525da6-9f17-11ec-b26b-df97fdab4b06.html",
    "https://news.yahoo.com/americorps-week-celebrating-people-helping-164501460.html",
    "https://www.colemantoday.com/news/celebrating-local-heroes-serving-in-americorps---bethany-ridgeway/article_c3d4f996-a00c-11ec-8e51-e731a20188c2.html",
    "https://www.wvnews.com/theet/news/sens-manchin-capito-announce-five-new-americorps-projects-across-west-virginia/article_bfbd2fc0-a162-11ec-992e-ebb9edaa9e10.html",
    "https://denvergazette.com/news/state/americorps-week-kicks-off-sunday-thanking-volunteers-serving-in-weld-and-larimer-counties/article_da9855bf-d454-5985-9111-975717649548.html",
    "https://www.wycokck.org/Engage-With-Us/News-articles/AmeriCorps-Week",
    "https://thesocialpresskit.com/americorpstoolkits",
    "https://thesocialpresskit.com/americorpstoolkits#",
    "https://americorps.gov/newsroom/events/americorps-week",
    "https://www.facebook.com/americorps",
    "http://twitter.com/AmeriCorps",
    "https://www.instagram.com/americorps/",
    "https://www.linkedin.com/company/americorps/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2022-03-14/celebrate-americorps-all-week&amp;title=Celebrate AmeriCorps All Week",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2022-03-14/celebrate-americorps-all-week&amp;title=Celebrate AmeriCorps All Week&amp;source=https://americorps.gov/blogs/2022-03-14/celebrate-americorps-all-week",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2022-03-14/celebrate-americorps-all-week&amp;url=https://americorps.gov/blogs/2022-03-14/celebrate-americorps-all-week&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2022-03-16/new-25k-grants-available-bring-generations-together-service",
    "https://americorps.gov/blogs/2022-03-23/national-service-alumnas-passion-history-led-her-find-lifelong-commitment-serving",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2022",
  "subdomain_2": "03",
  "subdomain_3": "14"
}