{
  "id": "americorpsgov_blogs_2020_04_20_volunteering_brings_out_best_americahtml",
  "url": "https://americorps.gov/blogs/2020-04-20/volunteering-brings-out-best-america",
  "title": "volunteering-brings-out-best-america",
  "content": "Volunteering Brings out the Best in America | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Volunteering Brings out the Best in America Submitted by admin on Mon, 04/20/2020 - 09:57 Apr 20, 2020 Barbara L. Stewart, CEO, Corporation for National and Community Service The threat posed by the coronavirus pandemic presents challenges unlike anything we have seen in recent history. Those providing essential services on the frontlines of this pandemic – nurses, doctors, emergency responders have our immense respect and appreciation for the sacrifices they make to protect our communities. Eager to make a difference, Americans across the country are looking for ways they, too, can help. At the Corporation for National and Community Service (CNCS), we are also asking the question, “What does volunteerism look like in the time of coronavirus?” For all of us who want to help our local communities, operating during a pandemic is new territory. How can we continue to meet community needs when health and safety calls for us to be apart? I find inspiration in stories from all across the country as individuals, nonprofits, companies, and our own AmeriCorps and Senior Corps volunteers find creative ways to meet community needs. Let me start with a few examples from our programs: Dedicated Senior Corps volunteers are performing “safe volunteering” by coordinating food delivery services for seniors, sewing masks for health care providers, and completing wellness checks with other seniors over the phone. AmeriCorps members are creating digital resources for students and parents. Schools are deploying AmeriCorps members to tutor children online and make sure they stay engaged through school closures. Governors and State Service Commissions are working together to stand up relief funds and volunteer networks, coordinate personal protective equipment drives, and provide mini-grants to organizations addressing COVID-19. More broadly, local volunteers help lead the way to meet community needs, especially during the time of coronavirus. They are neighbors helping neighbors by delivering meals or walking dogs for those who are at-risk or sheltered-in-place. Their small acts of kindness make a big difference and demonstrate that no matter the adversity we face, the American people will always find solutions to meet community needs. We see stories of people reaching out to others via social media, neighborhood listserves, group texts, or notes left taped to front doors. They are asking, “What can I do for you? Do you need something from the grocery store? Can I pick up dinner?” My work with volunteers has taught me that people are driven by an undeniable call to help others. Faced with the hurdles of social distancing, they still find a way to safely serve. Yes, we must follow Centers for Disease Control (CDC) recommendations, but you can still follow your heart if it calls you to assist your neighbors. In fact, we created a 10-step guide to help you safely serve your community during COVID-19 . This is not the “volunteering” we are used to, but we are evolving to meet the challenges of the day and finding new ways to serve. To reach the other side of this dangerous pandemic will require sacrifice, tenacity, and resilience from millions of Americans. It will also require strong community involvement as we ensure the safety of our friends and neighbors. We already know that volunteerism creates a sense of unity that allows our differences to fall away as we work together to address common needs. By coming together to aid one another, we create a culture that will last long after this threat subsides. Now is the time to ask: How can I help? What role can I play in our nation’s response to this pandemic? Lean in to meet the unmet needs of your community. Discover new ways to lend a hand and be open to accepting help if you are now the one who needs it. Stay safe and do your part to slow the spread of the coronavirus by following CDC guidelines and explore ways to safely support your community on our website . I offer my heartfelt thanks to everyone who is answering the call to serve their neighbors during this difficult time. I look forward to continuing to serve our nation alongside you. Barbara L. Stewart is the CEO of the Corporation for National and Community Service, the federal agency that leads AmeriCorps, Senior Corps, and the nation's volunteer efforts. Previous Senior Corps Shares Innovative Ways ‘Safe Volunteering’ Continues Next From City Living to Rural Serving, an AmeriCorps VISTA Finds a New Calling Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2020-04-20/volunteering-brings-out-best-america",
    "https://www.nationalservice.gov/",
    "https://www.nationalservice.gov/programs/senior-corps",
    "https://www.nationalservice.gov/programs/americorps",
    "https://www.nationalservice.gov/serve",
    "http://www.cdc.gov/coronavirus",
    "https://www.nationalservice.gov/serve",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2020-04-20/volunteering-brings-out-best-america&amp;title=Volunteering Brings out the Best in America",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2020-04-20/volunteering-brings-out-best-america&amp;title=Volunteering Brings out the Best in America&amp;source=https://americorps.gov/blogs/2020-04-20/volunteering-brings-out-best-america",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2020-04-20/volunteering-brings-out-best-america&amp;url=https://americorps.gov/blogs/2020-04-20/volunteering-brings-out-best-america&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2020-04-20/senior-corps-shares-innovative-ways-%E2%80%98safe-volunteering%E2%80%99-continues",
    "https://americorps.gov/blogs/2020-05-01/city-living-rural-serving-americorps-vista-finds-new-calling",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA",
  "focus_population": [
    "Schools",
    "Rural"
  ],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2020",
  "subdomain_2": "04",
  "subdomain_3": "20"
}