{
  "id": "americorpsgov_blogs_2020_06_19_june_19_covid_19_americorps_and_senior_corps_story_roundhtml",
  "url": "https://americorps.gov/blogs/2020-06-19/june-19-covid-19-americorps-and-senior-corps-story-round",
  "title": "june-19-covid-19-americorps-and-senior-corps-story-round",
  "content": "June 19: COVID-19 AmeriCorps and Senior Corps Story Round-Up | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb June 19: COVID-19 AmeriCorps and Senior Corps Story Round-Up Submitted by admin on Fri, 06/19/2020 - 14:15 Jun 19, 2020 CNCS AmeriCorps and Senior Corps continue to get things done for America. The challenges presented by the pandemic require solutions that are creative, flexible, and timely. Across the country, AmeriCorps and Senior Corps teams have risen to the occasion, answering the call to serve in new and innovative ways. Even in the face of adversity, our members and volunteers continue to improve lives, strengthen communities, and foster civic engagement. Stories of the Week This week’s stories highlight the incredible work of our AmeriCorps and Senior Corps members who continue to meet the needs of their communities despite the COVID-19 pandemic. We are inspired by their dedication to service as they work to make Americans safer, smarter, and healthier. Below are some examples of national service members going above and beyond in service to their country this week. Volunteers give back to seniors who help children in community (Indiana) A food drive was held Saturday for volunteers with the Foster Grandparent Program. The program works with children at schools across Indianapolis. “This is one of the best opportunities to give back, to get away from yourself and to really reevaluate what’s most important,” said DaJuan Major, assistant principal of Snacks Elementary School. Due to the coronavirus pandemic, volunteers haven’t been getting the stipend they would normally get. “We just do not know who may need a lifting hand, may need a phone call, show our seniors that you care,” said Shelida Kerr, director, Foster Grandparent Program. Pandemic Doesn’t Stop Girls, Inc. AmeriCorps Member (Alabama) Destiny Askew, a member of the YWCA Central Alabama Building Communities, Bettering Lives AmeriCorps program, is literally growing during the COVID-19 pandemic. While abiding by stay-at-home restrictions, Askew has repurposed some of her time to thrive in her home garden while teaching Girls, Inc. Students. Askew is assigned to Birmingham-based AmeriCorps partner agency Girls, Inc. She decided to creatively use her skills to make gardening videos to share virtually with her students. Askew has taught the students lessons about the plant cycle and how to create planters out of recycled materials. “It is important for members to continue serving now more than ever,” she said. “I believe our service is providing hope to those that might have lost it and compassion to those who may need it. Our world is at a turning point, and our service can help move our society toward a more charitable and humane direction.” Green Schools AmeriCorps adapts her work to meet hunger needs in Clark County (Washington) Clark County Green Schools utilizes the AmeriCorps program to extend our reach in Clark County schools. It's a national employment program that pairs young people with service opportunities. I've been serving in the program since October. My roles and responsibilities changed drastically over the past three months with the closing of schools. My own emergency response work has included growing and harvesting food for the Clark County Food Bank, sorting and repackaging donated items at the Share and FISH of Vancouver food pantries, and preparing and serving meals at the Share men's shelter. Though each of these organizations run separate programs and initiatives, they all provide emergency food and/or services to low-income people in the community and depend on volunteers to run many of their key operations. Youth Service Organization moves forward with COVID-Era adjustments (Utah) For 19 years, the Utah Conservation Corps (UCC) has provided opportunities for college students and young adult AmeriCorps members to make a positive impact in Utah’s parks and on public lands. The service-oriented program has become so popular that it attracts individuals from across the U.S. each year. Enter: pandemic. Suddenly the altruistic acts of these individuals become more challenging, as they move from one location to another across state lines and serve in parks near communities throughout Utah. Overcoming these challenges is critical both for the safety of the individuals AND for the communities they will visit. With the Help of AmeriCorps Members, She Graduated from High School at 65 (California) While most 65-year olds are planning their retirement, Estella Olivares, recent graduate of the Imperial Pathways Charter School, is only thinking of ways that she can continue her education. “Estella has been our oldest graduate up to this point. People her age tend to think about retirement, but I don’t think this woman is going to retire,” her counselor said. According to her teacher, one of the biggest obstacles for Estella was math class, but with the help of an AmeriCorps tutor and daily Zoom tutoring sessions, she managed to pass the class. AmeriCorps Iowa Members Respond during COVID-19 Crisis (Iowa) Volunteer Iowa, and the AmeriCorps Iowa programs it oversees, has been deeply engaged in the COVID-19 response effort since Iowa had its first positive cases in March. With over 38% of Iowa volunteers being 55+ and the most common volunteer area for older volunteers being food collection and distribution, we focused our response on filling gaps left in those areas experiencing increased need. By reassigning and deploying AmeriCorps members, and coordinating with younger volunteer groups like FFA and 4H, we are working with organizations statewide to innovate ways volunteers can assist safely while the need is greatest. Volunteer Iowa is working with an additional 68 community organizations across the state to place VISTA and AmeriCorps state members in over 90 NEW full-time COVID-19 recovery related positions this summer and beyond, to support ongoing needs as a result of the impact of COVID-19. Volunteer Connection: Senior Companion Program emphasizes virtual volunteering (Wisconsin) Senior Companion Program Inc. (SCP) is a ministry of the Racine Dominicans started at St. Catherine’s Infirmary in 1978 by Sister Michelle Olley and Sister Brenda Walsh. Since then SCP has nurtured mutually fulfilling experiences as enduring friendships have been forged. During COVID-19, SCP is emphasizing the virtual aspect of its project with both staff and volunteers keeping in touch with clients on the phone and through the mail. In fact, SCP has been the model for an RSVP virtual volunteering project. While Meals on Wheels RSVP volunteer drivers are on hiatus due to the COVID-19 pandemic, Meals on Wheels is keeping in touch with its clients by way of telephone while an alliance of Racine area restaurants prepare and deliver food. AmeriCorps programs to hire 350 contact tracers (Colorado) Local nonprofit and national service agencies are hiring for a new AmeriCorps contact-tracing program to assist public health officials in tracking the spread of the coronavirus. Conservation Legacy and Community Resource Center announced they were hiring 350 summer AmeriCorps Vista associates for the program, supported by Colorado Gov. Jared Polis. “We’re always engaged in national disaster response, which typically means a response to hurricanes, tornadoes and floods, but we think involving AmeriCorps members is a good opportunity and a good fit for us to do our national service work in a different avenue,” said Rob Spath, CEO of Conservation Legacy, a Durango-based nonprofit and partner in the statewide AmeriCorps contact-tracing program. Senior Corps volunteers to be recognized at drive-through event (Kentucky) Senior Corps volunteers will be honored at a drive-through event for their service to the community. \"Some of the hardest working older adult volunteers in Knoxville will be honored at this Drive Through Recognition,\" said Gina Whitfield, Foster Grandparent program manager, \"Usually, we are able to host a celebration meal for them, but this year we had to think outside the box to let them know how valuable they are as volunteers for homebound seniors, at-risk youth and the greater Knoxville Community. We can't thank them enough for hundreds and hundreds of hours of service they provide to our community.\" These are just a few examples of how AmeriCorps and Senior Corps programs continue to make an impact in communities across the country. No matter the circumstances, our programs have the flexibility and our national service members have the commitment to meet the needs of Americans wherever and whenever they are needed. Miss a previous update? Find them all here: June 11 Update: AmeriCorps and Senior Corps COVID-19 Response May 22 Update: AmeriCorps and Senior Corps COVID-19 Response May 14 Update: AmeriCorps and Senior Corps COVID-19 Response Previous June 11: AmeriCorps and Senior Corps COVID-19 Response Next AmeriCorps Members Helping Illinois Respond to COVID-19 Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2020-06-19/june-19-covid-19-americorps-and-senior-corps-story-round",
    "https://www.wishtv.com/news/local-news/volunteers-give-back-to-seniors-who-help-children-in-community/",
    "http://www.ywcabham.org/whats-new/06-15-2020/americorps-member-uses-green-thumb-engage-students",
    "https://clarkgreenschools.org/blog/green-schools-americorps-member-changes-her-work-to-meet-hunger-needs-in-clark-county",
    "https://www.heraldextra.com/sanpete-county/news/youth-service-organization-moves-forward-with-covid-era-adjustments/article_f92779f2-9eca-5e1e-ab47-500e9d06ef89.html",
    "https://www.ivpressonline.com/adelantevalle/consigue-graduarse-de-preparatoria-a-los-65-a-os/article_b3fa0e6a-b00a-11ea-87f5-b326dad4a189.html",
    "https://volunteeriowa.org/press-release/2020-06-12/americorps-iowa-members-respond-during-covid-19-crisis",
    "https://journaltimes.com/lifestyles/faith-and-values/volunteer-connection-senior-companion-program-emphasizes-virtual-volunteering/article_0c75a301-2df3-570e-a08f-af77e2b71cd3.html",
    "http://C:\\Users\\kaparker\\AppData\\Local\\Microsoft\\Windows\\INetCache\\Content.Outlook\\B2U0CFOX\\ https\\durangoherald.com\\articles\\327936-americorps-programs-to-hire-350-contact-tracers",
    "https://www.wvlt.tv/content/news/Senior-Corps-volunteers-to-be-recognized-at-drive-through-event-571100611.html",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2020-06-19/june-19-covid-19-americorps-and-senior-corps-story-round&amp;title=June 19: COVID-19 AmeriCorps and Senior Corps Story Round-Up",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2020-06-19/june-19-covid-19-americorps-and-senior-corps-story-round&amp;title=June 19: COVID-19 AmeriCorps and Senior Corps Story Round-Up&amp;source=https://americorps.gov/blogs/2020-06-19/june-19-covid-19-americorps-and-senior-corps-story-round",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2020-06-19/june-19-covid-19-americorps-and-senior-corps-story-round&amp;url=https://americorps.gov/blogs/2020-06-19/june-19-covid-19-americorps-and-senior-corps-story-round&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2020-06-11/june-11-americorps-and-senior-corps-covid-19-response",
    "https://americorps.gov/blogs/2020-07-15/americorps-members-helping-illinois-respond-covid-19",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [
    "Schools"
  ],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2020",
  "subdomain_2": "06",
  "subdomain_3": "19"
}