{
  "id": "americorpsgov_blogs_2024_01_18_mlk_day_2024_thank_you_building_beloved_communityhtml",
  "url": "https://americorps.gov/blogs/2024-01-18/mlk-day-2024-thank-you-building-beloved-community",
  "title": "mlk-day-2024-thank-you-building-beloved-community",
  "content": "MLK Day 2024: Thank You for Building the Beloved Community | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb MLK Day 2024: Thank You for Building the Beloved Community Submitted by rfrazier on Thu, 01/18/2024 - 15:07 Jan 18, 2024 AmeriCorps Staff For 30 years, AmeriCorps has led the MLK Day of Service, bringing Americans together to build bridges and heal divides across the nation. In 1994, Congress tasked AmeriCorps with leading Martin Luther King, Jr., Day, the only federal holiday designated as a National Day of Service, to encourage all Americans to volunteer to honor the life and legacy of Dr. King and improve their communities. Today, Americans and the world face compounding heartbreaking tragedy, highlighting inequities and injustices everywhere. Despite changing times, the importance of service remains unchanged – to overcome the forces that try to divide us, to see each other’s humanity, and give our neighbors a helping hand. For three decades, @AmeriCorps has been honored to lead the #MLKDayOfService and unite Americans to build the #BelovedCommunity . As you serve to make Dr. King's dream a reality, grab your #MondayMotivation from @TheKingCenter 's CEO, @BerniceKing . #MLKDay #AmeriCorps30 pic.twitter.com/GD6w0Ttvjw — AmeriCorps (@AmeriCorps) January 15, 2024 This MLK Day 2024, thousands of Americans nationwide united to build the Beloved Community of Dr. King’s dreams. Volunteers distributed fresh food, revamped their local schools, assembled care packages, and so much more to strengthen their communities. Each year, MLK Day Champions , organizations, and nonprofits from across the country join AmeriCorps and the King Center to honor Dr. King’s legacy and create lasting change for our communities. Check out some of the MLK Day service projects from across the nation: Zeta Phi Beta Sorority , Incorporated As an organization steeped in service and an AmeriCorps MLK Day Champion, the sisters of Zeta Phi Beta, Inc. showed up and showed out. From coast to coast, chapters of their sorority united to feed veterans, provide resources to expecting parents, host MLK Day marches and celebrations, and more. Listen to Zeta Phi Beta President and CEO Dr. Stace NC Grant on the AmeriCorps podcast, Unheard Voices of Service, discuss whether Dr. King's dream still carries weight today and how service can take us from charity to justice. City of Orlando As an MLK Champion, the City of Orlando united its residents to celebrate the life and legacy of Dr. King through service. Together they kicked off MLK Day with U.S. Hunger to pack one million meals to assist those struggling with food security. In the suburbs, 130 volunteers and their GreenUp initiative came together for a beautification project, planting 50 trees, mulching, and cleaning up litter. Residents of Orlando united through service to pack meals. Civic Works in the Snow It may have been cold and snowing but that didn’t stop volunteers serving with Civic Works . Their volunteers braved the icy weather to clean up our community outdoor spaces. Thank you to everyone who joined us for our MLK Day of Service this morning! 👏 Give a special applause to those who showed up for our outdoor projects! Check out our volunteer superstars cleaning up community spaces at Herring Run Parks and Hilltop Drive out in the snow! 🌱❄️ pic.twitter.com/CLfXSwTwK6 — Civic Works, Inc. (@CivicWorksInc) January 15, 2024 Reading Partners Combat Hunger In Colorado, Reading Partners joined forces with Volunteers of America and our AmeriCorps Seniors RSVP program to get things done for food and housing security in their community. United they spent the day of service building pantry boxes and hygiene kits for their neighbors. View this post on Instagram A post shared by Reading Partners Colorado (@readingpartnersco) President Biden Fired Up and Ready to Serve President Biden joined AmeriCorps CEO Michael D. Smith , Philadelphia Mayor Cherelle L. Parker, and AmeriCorps members with Philabundance . They honored Dr. King’s Legacy by spending the day packing boxes of food to help the community fight hunger. This afternoon I visited Philabundance, a hunger relief organization in Philadelphia, in honor of Dr. King. As we commemorate Dr. King, we must continue his unfinished struggle to perfect our union. To see each other as neighbors and not enemies. And to do our best to seek a… pic.twitter.com/P9ZHcKCEOf — President Biden (@POTUS) January 15, 2024 Thank you to everyone who helped bring in 2024 by taking action and showing up for your neighbors! In the last 30 years, we’ve seen how service transforms communities and lives – from young people channeling their passions into purpose and careers to older folks passing down wisdom while building meaning and fulfillment in their own lives. AmeriCorps members turn one year of service into a lifetime of giving back. During our 30th anniversary , we celebrate and usher in the next era of service to see how it will continue to evolve to meet our country’s ever-changing needs and deliver on the promise of Dr. King’s example. As the year continues, we encourage you to keep the momentum going. Find volunteer opportunities , help others, and honor Dr. King’s legacy throughout the rest of the year. Previous Remembering Dr. King through Service Next Celebrate 30 Years of AmeriCorps Throughout 2024 Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2024-01-18/mlk-day-2024-thank-you-building-beloved-community",
    "https://twitter.com/AmeriCorps?ref_src=twsrc%5Etfw",
    "https://twitter.com/hashtag/MLKDayOfService?src=hash&amp;ref_src=twsrc%5Etfw",
    "https://twitter.com/hashtag/BelovedCommunity?src=hash&amp;ref_src=twsrc%5Etfw",
    "https://twitter.com/hashtag/MondayMotivation?src=hash&amp;ref_src=twsrc%5Etfw",
    "https://twitter.com/TheKingCenter?ref_src=twsrc%5Etfw",
    "https://twitter.com/BerniceKing?ref_src=twsrc%5Etfw",
    "https://twitter.com/hashtag/MLKDay?src=hash&amp;ref_src=twsrc%5Etfw",
    "https://twitter.com/hashtag/AmeriCorps30?src=hash&amp;ref_src=twsrc%5Etfw",
    "https://t.co/GD6w0Ttvjw",
    "https://twitter.com/AmeriCorps/status/1746935767769780392?ref_src=twsrc%5Etfw",
    "https://www.americorps.gov/serve/volunteer/mlk-day/mlk-day-champions",
    "https://zphib1920.org/",
    "https://www.orlando.gov/Home",
    "https://ushunger.org/",
    "https://www.orlando.gov/Parks-the-Environment/GreenUp-Orlando",
    "https://civicworks.com/",
    "https://t.co/CLfXSwTwK6",
    "https://twitter.com/CivicWorksInc/status/1746947612765274132?ref_src=twsrc%5Etfw",
    "https://readingpartners.org/",
    "https://www.voa.org/",
    "https://americorps.gov/serve/americorps-seniors/americorps-seniors-rsvp",
    "https://www.instagram.com/p/C2JQxlnN5DX/?utm_source=ig_embed&amp;utm_campaign=loading",
    "https://www.instagram.com/p/C2JQxlnN5DX/?utm_source=ig_embed&amp;utm_campaign=loading",
    "https://www.instagram.com/p/C2JQxlnN5DX/?utm_source=ig_embed&amp;utm_campaign=loading",
    "https://twitter.com/AmeriCorpsCEO/status/1747007978841034940",
    "https://www.philabundance.org/",
    "https://t.co/P9ZHcKCEOf",
    "https://twitter.com/POTUS/status/1747016565600448875?ref_src=twsrc%5Etfw",
    "https://americorps.gov/about/americorps30",
    "https://americorps.gov/join/find-volunteer-opportunity#/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2024-01-18/mlk-day-2024-thank-you-building-beloved-community&amp;title=MLK Day 2024: Thank You for Building the Beloved Community  ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2024-01-18/mlk-day-2024-thank-you-building-beloved-community&amp;title=MLK Day 2024: Thank You for Building the Beloved Community  &amp;source=https://americorps.gov/blogs/2024-01-18/mlk-day-2024-thank-you-building-beloved-community",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2024-01-18/mlk-day-2024-thank-you-building-beloved-community&amp;url=https://americorps.gov/blogs/2024-01-18/mlk-day-2024-thank-you-building-beloved-community&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2024-01-15/remembering-dr-king-through-service",
    "https://americorps.gov/blogs/2024-01-31/celebrate-30-years-americorps-throughout-2024",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2024",
  "subdomain_2": "01",
  "subdomain_3": "18"
}