{
  "id": "americorpsgov_blogs_2019_09_24_recognizing_outstanding_americorps_service_and_innovationhtml",
  "url": "https://americorps.gov/blogs/2019-09-24/recognizing-outstanding-americorps-service-and-innovation",
  "title": "recognizing-outstanding-americorps-service-and-innovation",
  "content": "Recognizing Outstanding AmeriCorps Service and Innovation | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Recognizing Outstanding AmeriCorps Service and Innovation Submitted by admin on Tue, 09/24/2019 - 12:39 Sep 24, 2019 Izzy Woodruff, CNCS External Affairs We know all our AmeriCorps members and programs make a huge impact in communities across the country. But this year, a few exceptional AmeriCorps members and programs came to our attention, and we recognized them through the 2019 Excellence in AmeriCorps Awards. Here are their stories. Mandy’s Farm – VAMOS Program – 2019 Excellence in AmeriCorps Award for Engaging More People with Disabilities Mandy’s Farm’s VAMOS Program was created to fill a very specific need in Albuquerque, N.M., where there are currently 3,500 people on a waitlist for the Medicaid Developmental Disabilities Waiver. The wait can be as long as 13 years, forcing individuals with disabilities to go without the behavioral therapy, physical therapy and other resources they need to thrive. That’s where the VAMOS Program comes in. Serving 50 people each year, the VAMOS Program helps individuals with disabilities gain access and the skills needed to secure internships and jobs, and many of them return to VAMOS to serve as AmeriCorps members. In fact, six recipients of VAMOS resources over the past year have returned to serve as AmeriCorps members. And in the Spring 2019 cohort, 60 percent of the AmeriCorps members serving were VAMOS alums with disabilities. It really does mean so much for those receiving these services to see themselves in the AmeriCorps members who are helping them. Visit https://mandysfarm.org/vamos/ to learn more about the program. Spike Hosch (University of the South – South Cumberland Plateau VISTA Project) – BetterFi – 2019 Excellence in AmeriCorps Award for Most Significant Innovation The South Cumberland Plateau VISTA project, which is dedicated to growing and strengthening communities through initiatives focused on education, economic development and Healthy Futures, demonstrated an outstanding innovative approach. One such initiative evolved into the first 501(c)(3) started under the Tennessee AmeriCorps VISTA program: BetterFi. The organization provides affordable consumer loans and financial coaching as an alternative to predatory payday and car title loans. BetterFi is the brainchild of AmeriCorps VISTA alum Spike Hosch. As a student at The University of the South, Spike chose an interdisciplinary approach to his education, taking courses in philosophy, politics and economics. This gave him a holistic understanding of how to address pressing economic issues, like predatory lending. Spike’s interests took him to Bangladesh, where he interned at the world-famous Grameen Bank, a microfinance organization founded by Nobel Laureate Muhammad Yunus. He also worked in Mongolia’s green energy finance sector before returning to the U.S. to serve as an AmeriCorps VISTA in Tennessee and ultimately launch BetterFi. To date, BetterFi has lent more than $75,000 to low-income families in the region at an average interest rate of just under 13 percent. Compared to the typical car title loan borrower in Tennessee, BetterFi clients are saving over $124,000, money that goes directly back into the local economy. BetterFi has even brought its first VISTA member on board! What a great way to continue the legacy of service! Visit https://www.betterfi.co/ to learn more. iFoster Transition Age Youth – TAY AmeriCorps – 2019 Excellence in AmeriCorps Award for Best New Program TAY AmeriCorps was launched in 2019 to help young people in foster care find resources and gain the employment and life skills they need to succeed once they age out of the foster care system. TAY AmeriCorps members are current and former foster youth themselves who connect their peers with these resources. They meet at 35 host sites including high schools, colleges and workforce centers across Los Angeles County and the Bay Area, where more than 10,000 foster youth between the ages of 14 and 23 reside. Since launching, the iFoster TAY AmeriCorps program has served more than 900 clients with complex cases, and in July 2019, Los Angeles Mayor Eric Garcetti highlighted the program as an innovative model for serving at-risk youth. Stephanie Taylor-Silva – 2019 Excellence in AmeriCorps Award for Most Compelling Member Experience As a child, Stephanie endured severe abuse and neglect, sexual assault and human trafficking. In the wake of this trauma, she turned to methamphetamine and cocaine at the age of 14. She was arrested multiple times, landing behind bars in 2010. For Stephanie, however, incarceration was a positive turning point. She overcame her addiction and began to build relationships — and trust — with her mentors within the Idaho Department of Correction. Stephanie was released from prison in 2011 and later received full pardons from both Idaho and Montana. The following year, she enrolled in Idaho State University to study criminology and sociology. She wanted to make a difference in others’ lives so, while in college, she served as an AmeriCorps VISTA, helping formerly incarcerated women like herself enroll in college, secure jobs and lift themselves out of poverty. In 2018, she graduated from college — with honors! And in August 2019, Stephanie accepted a position as a Re-Entry Specialist with the Idaho Department of Correction. Stephanie’s AmeriCorps VISTA service continues to inspire her to give back to the community. In her free time, she volunteers with numerous organizations addressing human trafficking, domestic violence and suicide. Stephanie’s story has been covered widely in the press. Here’s one article in the Washington Times . Alexis Dean – 2019 Excellence in AmeriCorps Award for Most Impactful Member Service AmeriCorps alum Alexis Dean wanted to reach the children he teaches, so he created an “Attendance Rap” music video to encourage kids to be at and on time to school. It is just one of many examples of Alexis going above and beyond to motivate students. In fact, while serving as an AmeriCorps Literacy Tutor and Tutor Coordinator during the 2018-2019 school year, he wrote 11 different songs with his students on topics ranging from test preparation to community issues.  In June 2019, Alexis was awarded the Governor's Service Award for his admirable efforts as a teacher and mentor. As a result of his AmeriCorps service, Alexis is now more active in the community and works at various camps throughout the year. One of those camps is Camp Hope, which caters to people who have lost a loved one. Having lost his own father at age 7, Alexis has a profound appreciation for the role that mentors play in kids’ lives. Although his AmeriCorps term is now over, Alexis continues to serve students as a teacher with the Madison School District. The remarkable individuals and programs honored with this year’s Excellence in AmeriCorps Awards are a testament to just how much we can accomplish through service. We applaud their efforts and dedication to getting things done for America. Previous Summertime and the Great Outdoors Next Support Our Heroes this Veterans Day Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2019-09-24/recognizing-outstanding-americorps-service-and-innovation",
    "https://mandysfarm.org/vamos/",
    "https://www.betterfi.co/",
    "https://www.washingtontimes.com/news/2017/aug/5/a-second-chance-former-idaho-drug-offender-receive/",
    "https://www.nbc15.com/content/news/Madison-tutor-reaches-students-through-rap-497092041.html",
    "https://www.servewisconsin.wi.gov/governors-service-awards",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2019-09-24/recognizing-outstanding-americorps-service-and-innovation&amp;title=Recognizing Outstanding AmeriCorps Service and Innovation",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2019-09-24/recognizing-outstanding-americorps-service-and-innovation&amp;title=Recognizing Outstanding AmeriCorps Service and Innovation&amp;source=https://americorps.gov/blogs/2019-09-24/recognizing-outstanding-americorps-service-and-innovation",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2019-09-24/recognizing-outstanding-americorps-service-and-innovation&amp;url=https://americorps.gov/blogs/2019-09-24/recognizing-outstanding-americorps-service-and-innovation&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2019-06-24/summertime-and-great-outdoors",
    "https://americorps.gov/blogs/2019-10-17/support-our-heroes-veterans-day",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2019",
  "subdomain_2": "09",
  "subdomain_3": "24"
}