{
  "id": "americorpsgov_blogs_2024_05_06_supporting_building_next_generationhtml",
  "url": "https://americorps.gov/blogs/2024-05-06/supporting-building-next-generation",
  "title": "supporting-building-next-generation",
  "content": "Supporting and Building the Next Generation | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Supporting and Building the Next Generation Submitted by dsong on Fri, 05/03/2024 - 14:38 May 06, 2024 AmeriCorps Staff AmeriCorps has been a pathway to employment for many members and AmeriCorps Seniors volunteers. National service helps promote equity by creating economic opportunities and building job-ready skills through hands-on experiences and apprenticeships. In the past decade, active youth apprenticeships increased by more than 118 percent. Organizations, employers, educators, labor unions, workforce professionals, and their partners across the country are launching registered apprenticeship programs every day that allow youth to earn competitive wages while obtaining the relevant training and experience to start their careers. In recognition of this growing area of workforce development, the Department of Labor is proud to host the first-ever Youth Apprenticeship Week , a nationwide celebration to highlight the benefits and value of registered apprenticeship programs for young adults. Apprenticeship in AmeriCorps Programs AmeriCorps member serving in an apprenticeship program AmeriCorps programs across the country are finding innovative ways to combine service with pre-apprenticeship and registered apprenticeship programs to provide members with opportunities to build skills and gain experiences that will benefit them long beyond their service term. AmeriCorps and registered apprenticeship both have rules and regulations developed and maintained by federal and state agencies, but combining the two programs leverage the benefits to both the members serving and the communities they serve. The AmeriCorps Digital Service Fellows Pre-Apprenticeship Program engages recent Philadelphia, Pa., high school graduates interested in information technology careers in a full year of service supporting student and school technology needs and learning about the information technology field. AmeriCorps members serve directly with the school district’s technology professionals. Members’ experience is supplemented with training toward industry-standard certifications, including Dell Technician Certification, Apple Certified Macintosh Technician, CompTIA A+, Google Apps for Education Certification, and more. After they complete their service, AmeriCorps members also have the opportunity to apply to and engage in a registered apprenticeship program that directly connects to their service experience. Through the Colorado Public Health Works Program , Community Health Workers serve where the need is greatest, such as at local public health agencies, hospitals, community health clinics, and other community-based organizations. Community Health Workers apprentices are AmeriCorps members enrolled in the US Department of Labor registered apprenticeship program. During their apprenticeship and service, the Centers for Disease Control and Prevention and the Patient Navigator Training Collaborative provide members with certificates and competencies through in-person, instructor-led, and online courses to support the next generation of public health leaders. Get Involved During Youth Apprenticeship Week, share the message to support the next generation of our workforce. Host an event. The Youth Apprenticeship Week Event Planning Toolkit and the Promotion Toolkit have all the resources you need to plan, organize, and host a successful event. Attend an event and register to learn more. Educate and spread the news. Learn more about how national service can play an integral part in a community’s workforce development strategy and how organizations can leverage AmeriCorps to meet their missions. Previous AmeriCorps 30: A Salute to Older Americans Next Older Volunteers Powering Intergenerational Connection Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2024-05-06/supporting-building-next-generation",
    "https://www.apprenticeship.gov/youth-apprenticeship-week/events",
    "https://www.apprenticeship.gov/youth-apprenticeship-week",
    "https://utp-philly.org/digital-service-fellows/",
    "https://trailhead.institute/colorado-public-health-works-program",
    "https://gcc02.safelinks.protection.outlook.com/?url=https%3A%2F%2Flnks.gd%2Fl%2FeyJhbGciOiJIUzI1NiJ9.eyJidWxsZXRpbl9saW5rX2lkIjoxMDEsInVyaSI6ImJwMjpjbGljayIsInVybCI6Imh0dHBzOi8vd3d3LmFwcHJlbnRpY2VzaGlwLmdvdi9zaXRlcy9kZWZhdWx0L2ZpbGVzLzIwMjQlMjBZQVclMjBFdmVudCUyMFBsYW5uaW5nJTIwVG9vbGtpdCUyMENMRUFOLnBkZiIsImJ1bGxldGluX2lkIjoiMjAyNDAxMjYuODkxOTkzOTEifQ.-tokBRr63BOzKGQYvFprNhxMm-5DMFXtvkExiFP1ICM%2Fs%2F3037913906%2Fbr%2F236064609895-l&amp;data=05%7C02%7CEmSmith%40americorps.gov%7C0260ce286e934a63cfe308dc1e909360%7Cd2f850a78dce4fb3a79c6867f9514312%7C0%7C0%7C638418853554863701%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&amp;sdata=GKl%2FQVu3uBml4Swt1Oj5FfuYjHEier5XYIiP9en%2Br6s%3D&amp;reserved=0",
    "https://gcc02.safelinks.protection.outlook.com/?url=https%3A%2F%2Flnks.gd%2Fl%2FeyJhbGciOiJIUzI1NiJ9.eyJidWxsZXRpbl9saW5rX2lkIjoxMDIsInVyaSI6ImJwMjpjbGljayIsInVybCI6Imh0dHBzOi8vd3d3LmFwcHJlbnRpY2VzaGlwLmdvdi9zaXRlcy9kZWZhdWx0L2ZpbGVzLzIwMjQlMjBZQVclMjBQcm9tb3Rpb24lMjBUb29sa2l0JTIwQ0xFQU4ucGRmIiwiYnVsbGV0aW5faWQiOiIyMDI0MDEyNi44OTE5OTM5MSJ9.1zy70GsRZSi4AZJ5og-lcvtG3JquKnRNQ_rBbSwGeZs%2Fs%2F3037913906%2Fbr%2F236064609895-l&amp;data=05%7C02%7CEmSmith%40americorps.gov%7C0260ce286e934a63cfe308dc1e909360%7Cd2f850a78dce4fb3a79c6867f9514312%7C0%7C0%7C638418853554872070%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&amp;sdata=X%2FiY37kfE%2FTX7nDYD9NbDRapvHN43%2BHCdaeqbBLFF0A%3D&amp;reserved=0",
    "https://americorps.gov/sites/default/files/document/Leveraging-AmeriCorps-Programs-Workforce-Development.pdf",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2024-05-06/supporting-building-next-generation&amp;title=Supporting and Building the Next Generation",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2024-05-06/supporting-building-next-generation&amp;title=Supporting and Building the Next Generation&amp;source=https://americorps.gov/blogs/2024-05-06/supporting-building-next-generation",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2024-05-06/supporting-building-next-generation&amp;url=https://americorps.gov/blogs/2024-05-06/supporting-building-next-generation&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2024-05-02/americorps-30-salute-older-americans",
    "https://americorps.gov/blogs/2024-05-10/older-volunteers-powering-intergenerational-connection",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2024",
  "subdomain_2": "05",
  "subdomain_3": "06"
}