{
  "id": "americorpsgov_blogs_2024_03_20_americorps_week_2024html",
  "url": "https://americorps.gov/blogs/2024-03-20/americorps-week-2024",
  "title": "americorps-week-2024",
  "content": "AmeriCorps Week 2024 | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps Week 2024 Submitted by rfrazier on Wed, 03/20/2024 - 13:07 Mar 20, 2024 AmeriCorps Staff From tutoring the next generation, protecting our greenspaces to showing up for our veterans, AmeriCorps members and AmeriCorps Seniors volunteers choose to make a difference in our communities every day. In recognition of their service, from March 10-16, we celebrated the 1.3 million individuals who have stood with us for three decades as part of the annual AmeriCorps Week celebration. AmeriCorps Week 2024 AmeriCorps members, staff, alums, and elected officials sounded off from across the country. Together, we recognized the more than 200,000 AmeriCorps members and AmeriCorps Seniors volunteers from all walks of life who choose to turn their determination, compassion, and creativity into practical solutions for neighbors and strangers alike. Check out how we made this AmeriCorps Week one for the books: AmeriCorps members and alumni showed off their AmeriCorps pride during Day of the A, sharing their own stories on social media, and showcasing how they make a difference in their community. AmeriCorps members poked a little lighthearted fun at their AmeriCorps habits by jumping on the “of course” trend. View this post on Instagram A post shared by AmeriCorps (@americorps) AmeriCorps NCCC Director and Peace Corps Alum, Ken Goodson, shared how his commitment to service started as a young adult, and how it helps him lead our NCCC program for 18-26-year-olds, transforming communities and their lives. Read how Ken kicked off the week: Bit.ly/ACWKen24 We also heard how the service journey started for AmeriCorps member Jonah. At the age of five, he witnessed the power of service as an honorary AmeriCorps member and the son of AmeriCorps Monitoring Officer Beth, then deputy director for City Year Columbia , as he joined her at service sites. Eighteen years later, Jonah became an official AmeriCorps member with American Connection Corps . Check out how he continues to make a difference: Bit.ly/ACWJonah On Day of the A, our Ameri-Family showed off their AmeriCorps 🅰 with craft projects, their favorite gear, and more! From the old AmeriCorps logo to the new, we saw their creativity unfold and saw why they’re proud to get things done for America. Happy #DayOfTheA ! Show off your #AmeriCorps 🅰 with craft projects, you in your gear, or even doing a dance. Get creative and share why you’re proud to serve and we’ll feature you in this thread. ⬇️ #AmeriPride #AmeriCorpsWeek #AmeriCorps30 pic.twitter.com/6NNyieXwPC — AmeriCorps (@AmeriCorps) March 14, 2024 From coast to coast, governors, mayors, and elected officials of all backgrounds united in recognition of the AmeriCorps members and AmeriCorps Seniors volunteers, past and present, for their outstanding service to their communities. Check out how they gave thanks in the X thread below. It’s #AmeriCorpsWeek ! Join us in celebrating all of our @AmeriCorps members, @AmeriCorpsSr volunteers and alumni for their incredible service nationwide. Read more about our celebration: https://t.co/GxsCpjlJCh pic.twitter.com/wwTwfFC3xA — AmeriCorps (@AmeriCorps) March 11, 2024 AmeriCorps CEO Michael D. Smith joined the celebrations by serving alongside our members and volunteers in Maryland, New York, and Philadelphia. From removing invasive species at Sandy State Point Park with the Maryland Conservation Corps to hearing the service stories of members with the Center for Justice Innovation , he had an unforgettable week. Read more via LinkedIn . AmeriCorps Week has come to an end but our determination and passion to make a positive impact in our communities is ongoing. Celebrate #AmeriCorps30 with us all year long and think about joining AmeriCorps yourself. Head to AmeriCorps.gov/Serve and discover how you can make a difference for yourself and your future while helping your community. Previous AmeriCorps Week: Celebrate the Women of National Service Next AmeriCorps 30: Americans and Leaders Recognize the Power of National Service Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2024-03-20/americorps-week-2024",
    "https://americorps.gov/about/americorps30",
    "https://www.instagram.com/reel/C4llTLyO5A7/?utm_source=ig_embed&amp;utm_campaign=loading",
    "https://www.instagram.com/reel/C4llTLyO5A7/?utm_source=ig_embed&amp;utm_campaign=loading",
    "https://www.instagram.com/reel/C4llTLyO5A7/?utm_source=ig_embed&amp;utm_campaign=loading",
    "https://americorps.gov/serve/americorps/americorps-nccc",
    "https://www.cityyear.org/columbia/",
    "https://www.americanconnectioncorps.org/",
    "https://twitter.com/hashtag/DayOfTheA?src=hash&amp;ref_src=twsrc%5Etfw",
    "https://twitter.com/hashtag/AmeriCorps?src=hash&amp;ref_src=twsrc%5Etfw",
    "https://twitter.com/hashtag/AmeriPride?src=hash&amp;ref_src=twsrc%5Etfw",
    "https://twitter.com/hashtag/AmeriCorpsWeek?src=hash&amp;ref_src=twsrc%5Etfw",
    "https://twitter.com/hashtag/AmeriCorps30?src=hash&amp;ref_src=twsrc%5Etfw",
    "https://t.co/6NNyieXwPC",
    "https://twitter.com/AmeriCorps/status/1768278904349831355?ref_src=twsrc%5Etfw",
    "https://twitter.com/hashtag/AmeriCorpsWeek?src=hash&amp;ref_src=twsrc%5Etfw",
    "https://twitter.com/AmeriCorps?ref_src=twsrc%5Etfw",
    "https://twitter.com/AmeriCorpsSr?ref_src=twsrc%5Etfw",
    "https://t.co/GxsCpjlJCh",
    "https://t.co/wwTwfFC3xA",
    "https://twitter.com/AmeriCorps/status/1767251277635858737?ref_src=twsrc%5Etfw",
    "https://dnr.maryland.gov/publiclands/pages/mcc.aspx",
    "https://www.innovatingjustice.org/",
    "https://www.linkedin.com/feed/update/urn:li:activity:7174496035900125184",
    "http://americorps.gov/Serve",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2024-03-20/americorps-week-2024&amp;title=AmeriCorps Week 2024",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2024-03-20/americorps-week-2024&amp;title=AmeriCorps Week 2024&amp;source=https://americorps.gov/blogs/2024-03-20/americorps-week-2024",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2024-03-20/americorps-week-2024&amp;url=https://americorps.gov/blogs/2024-03-20/americorps-week-2024&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2024-03-15/americorps-week-celebrate-women-national-service",
    "https://americorps.gov/blogs/2024-03-29/americorps-30-americans-leaders-recognize-power-national-service",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC; AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2024",
  "subdomain_2": "03",
  "subdomain_3": "20"
}