{
  "id": "americorpsgov_about_our_impacthtml",
  "url": "https://americorps.gov/about/our-impact",
  "title": "our-impact",
  "content": "Our Impact | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb About Our Impact Through our nation’s most trying times, AmeriCorps has been there. Disaster response, the opioid crisis, academic achievement – these are just a few areas where AmeriCorps members and AmeriCorps Seniors volunteers have made a difference in communities. Submitted by Anonymous (not verified) on Fri, 11/06/2020 - 11:26 National Service Reports Every year, AmeriCorps produces a comprehensive report about national service investments across the United States. These state reports demonstrate the scope of AmeriCorps presence throughout the nation. View the Reports Volunteering in America In partnership with the U.S. Census Bureau, AmeriCorps takes the pulse of our nation’s civic health every two years through the Current Population Survey Civic Engagement and Volunteering Supplement. View the research Evidence Reports By learning from available evidence, we can continually improve how we deliver on our mission to improve lives, strengthen communities, and foster civic engagement. The AmeriCorps Evidence Exchange is a digital repository of research, and evaluation reports. Search Evidence Exchange Learn how we build evidence of impact AmeriCorps' Open Data AmeriCorps promotes transparency by making agency data available to the public. View Our Data Watch the Open Data Introduction Video Featured Data Upon exiting service, AmeriCorps invites members to complete an exit survey to provide information on their service experiences. By collecting data on member experiences, AmeriCorps and its partners can better understand how to support members and show potential members the benefits of serving. 2022 AmeriCorps Member Exit Data Highlights from the AmeriCorps MES Dataset State of the Evidence Report In coordination with state and local entities, national service responds to the most pressing issues facing our nation. AmeriCorps members and AmeriCorps Seniors volunteers prepare today’s students for tomorrow’s jobs, reduce crime, connect returning veterans to jobs, fight the opioid epidemic, support seniors to live independently, make college more accessible and affordable, and help Americans rebuild their lives following disasters. Read the 2023 report Watch more videos about AmeriCorps' research and evaluation How We Build Evidence of Impact The agency’s strategic evidence plan provides a roadmap for generating credible, relevant, and actionable information about the extent to which it is achieving its mission. At AmeriCorps, we view evidence building as an ongoing cycle, and incorporate the process into our work across the agency through four phases: innovation, implementation, improvement, and expanded impact. AmeriCorps Learning Agenda 2022-2026 Innovation AmeriCorps researches and develops unique service programs that explore how to engage and improve communities. Implementation AmeriCorps members, grantees, and partner organizations adopt programs locally to address social issues. Improvement AmeriCorps leverages rigorous evaluation methods to measure program performance and identify opportunities for improvement. Expanded Impact Using evaluation results, AmeriCorps provides the framework for other organizations to replicate and scale programs in their communities. Supporting Research and Evaluation The AmeriCorps Office of Research and Evaluation (ORE) produces accurate and timely research on national service, social innovation, volunteering, and civic engagement. We conduct original and sponsored research and evaluations, support evaluations of grantees’ research and programs, and promote evidence-based service models – all of which infuses data into AmeriCorps programs and contributes to the public understanding of national service. Learn More About Research and Evaluation at AmeriCorps Evaluation Resources Research and Evaluation Grants AmeriCorps’ Research Grantee Activities Sign Up to Receive Research and Evaluation Updates Research and Evaluation Digest The Research and Evaluation Digest highlights the agency’s recent research, evaluation and evidence tools, reports, and knowledge building activities on national service, social innovation, volunteering, and civic engagement. The Digest is your go-to resource for original and sponsored research and evaluations, evaluations of grantees’ research and programs, and promotion of evidence-based service models – all of which infuse data into AmeriCorps programs and contribute to the public’s understanding of national service. Research and Evaluation Digest Archive Toggle Seniors in Service and Serving Our Seniors - May 22, 2024 Service for the Good of Public Health - Feb. 14, 2024 The Power and Value of Service to our Communities and Nation - Nov. 27, 2023 30 Years of AmeriCorps: Celebrating Evidence - Sept. 20, 2023 Building Evidence with AmeriCorps State and National - July 13, 2023 Looking Back on #AmeriCorpsWeek2023 - May 3, 2023 Celebrating AmeriCorps Week - March 9, 2023 Introducing the 2022 National Service and Civic Engagement Research Grant Cohort - Dec. 15, 2022 National Service’s Positive Impact on Our Communities - Oct. 12, 2022 Research and Evaluation Digest: Grantee Spotlight, 2022 AmeriCorps Research Grantee Dialogue, and more - May 11, 2022 Research and Evaluation Digest: 2022 AmeriCorps Research Grantee Dialogue, Upcoming Webinar, 'Step Forward' Infographic, ROI Studies Factsheet, and more - March 17, 2022 Research and Evaluation Digest: Webinar Now Available, Research Grantee Highlight, Environmental Stewardship Brief and more - Feb. 1, 2022 AmeriCorps Research & Evaluation Digest: New SCALER Tool Resources, Grantee Spotlight, Upcoming Research Webinar, and more - Nov. 2, 2021 AmeriCorps Research & Evaluation Digest: New Video, Grantee Profiles, and more - July 30, 2021 AmeriCorps Research & Evaluation Digest: New Resources, Grantee Spotlight, and more - May 25, 2021 AmeriCorps Research & Evaluation Digest: Perspective from Mary, ASN Infographic, Grantee Spotlights, and more - March 4, 2021 AmeriCorps Research & Evaluation Digest: Data-Driven Mission Video, Grantee Spotlight, SIF’s Decade of Change, and more - Oct. 13, 2020 CNCS Research and Evaluation Digest: Award-winning Video, CNCS Response to Opioid Crisis, Webinar, and more - July 1, 2020 New from ORE: Grantee Updates, Research Summit 2019, The Latest Webinar and more - April 1, 2020 News from ORE: National Accelerator, Grantee Profiles, 2019 Research Summit - Sept. 11, 2019 News from ORE: Healthy Futures, Leadership in Action, and Bridging Divides - June 28, 2019 New from ORE: Senior Corps Research, Economic Opportunity Brief, Grantee Spotlight - April 16, 2019 ORE Newsletter: 2018 Community Conversations Research Grant Awardees, Education Evidence Brief, and Website Makeover - Dec. 4, 2018 New from ORE: Senior Corps Convening, 30 Years of Research, and more - July 12, 2018 Research & Evaluation Newsletter - Winter 2018 - March 6, 2018 Research & Evaluation Newsletter - Fall 2017 - Nov. 15, 2017 Research & Evaluation Newsletter - Summer 2017 - June 23, 2017 Research & Evaluation Newsletter - Spring 2017 - Feb. 28, 2017 Research & Evaluation Newsletter – Spring 2016: Celebrating Serving Seniors! - May 17, 2016 Research & Evaluation Newsletter – February 2016 - Feb. 23, 2016 Research & Evaluation Newsletter - Winter 2016 - Dec. 13, 2016 Our Impact Featured Office of Research and Evaluation Webinars Taking the Pulse of Our Nation’s Civic Health—and Taking Action for Civic Renewal November 19, 2024 Recovery Coaching for Substance Use Disorders:  Evidence from a Recent AmeriCorps Evaluation and Capacity Building Project September 26, 2024 Snapshots in Service: AmeriCorps and Workforce Development June 13, 2024 Putting Civic Engagement in Context: Exploring Data Trends, Uses, and Actionable Insights April 4, 2024 See all webinars Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/about/our-impact",
    "https://data.americorps.gov/",
    "https://www.youtube.com/watch?v=7PzrHfFWVLg",
    "https://data.americorps.gov/National-Service/2022-AmeriCorps-MES-AmeriCorps-Member-Exit-Survey/59ia-vsnv",
    "https://www.americorps.gov/evidence-exchange/highlights-americorps-member-exit-survey-dataset",
    "https://www.youtube.com/playlist?list=PLZ54wDoDlX7di_DLdnDjRVICcKJwTsXeo",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new?topic_id=USCNCS_946",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/39c883f?reqfrom=share",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/3898c77?reqfrom=share",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/37af16c?reqfrom=share",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/36db849?reqfrom=share",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/363b304?reqfrom=share",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/3574a81?reqfrom=share",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/34bb544?reqfrom=share",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/33c780e?reqfrom=share",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/330baa7?reqfrom=share",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/315a9b5",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/30dd296",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/30534e3",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/2f96b43?reqfrom=share",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/2ea415c?reqfrom=share",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/2d9d798?reqfrom=share",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/2c2eb96?reqfrom=share",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/2a59935?reqfrom=share",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/292ddc7",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/281e211",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/25d0cd8",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/24c3894",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/23b9fb8",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/213088b",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/1f7700e",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/1ddef21",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/1c38be1",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/19ff112",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/1859c4b",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/1489f63",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/137f1f1",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/175acde",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/AmeriCorps-Learning-Agenda-2022-2026.pdf",
    "https://americorps.gov/sites/default/files/document/2021_05_12_OfficeofResearchandEvaluationOne-Pager_ORE.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps State and National; AmeriCorps Seniors; Office of Research and Evaluation",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "about",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "about"
}