{
  "id": "americorpsgov_blogs_2022_03_02_celebrate_us_americorps_week_march_13_19html",
  "url": "https://americorps.gov/blogs/2022-03-02/celebrate-us-americorps-week-march-13-19",
  "title": "celebrate-us-americorps-week-march-13-19",
  "content": "Celebrate with Us: AmeriCorps Week is March 13-19 | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Celebrate with Us: AmeriCorps Week is March 13-19 Submitted by eschneider on Tue, 03/01/2022 - 19:23 Mar 02, 2022 AmeriCorps staff Mark your calendars! AmeriCorps Week is March 13-19. During AmeriCorps Week we recognize the commitment of the millions of Americans who have chosen to serve their country through AmeriCorps and AmeriCorps Seniors, and encourage others to follow in their footsteps of service. Service brings people together and bridges divides, and that's what our members, volunteers, and programs do each and every day. From local leaders and elected officials – to partners and grantees – to current members, volunteers, and alumni – we invite all to participate in the weeklong celebration. You're invited to celebrate with us throughout the week. Visit our website for more information and follow the digital conversation about AmeriCorps Week and the days leading up to it on AmeriCorps' Facebook , Twitter, Instagram, and LinkedIn . Engage with us During AmeriCorps Week Host an “honorary AmeriCorps member”. Invite media, an elected official, a community leader, school principal, AmeriCorps alumnus, or other local dignitary to see AmeriCorps in action by becoming an “honorary AmeriCorps member” or by doing a site visit. In previous years, we've seen leaders from across the country participate in their local communities. In the photo below, former superintendent of Tulsa Public Schools, Keith Ballard, Ph.D., took the pledge to be a member for a day. Other examples include Rep. Elissa Slotkin serving at the Howell Nature Center and even middle school students switching places with AmeriCorps educators during AmeriCorps Week. Celebrate AmeriCorps During Day of the A: Thursday, March 17. Show off your AmeriCorps gear – new logo, old logo – it doesn’t matter! Don your favorite tee, break out your old baseball cap, or show off your AmeriCorps-themed arts and crafts project. Take a photo and share it on your personal social media channels in honor of the #DayoftheA. Don't forget to tag @AmeriCorps and use the hashtag #DayoftheA in your posts. Additional Ways to Engage Share AmeriCorps' Impact. Through op-eds, letters to the editor, or other communications channels, you can highlight the impact of the work members do in your community. Spread the word about AmeriCorps. Share videos, photos, and stories on social media about AmeriCorps or your own experience throughout the week. Be sure to tag @AmeriCorps in your posts. Declare AmeriCorps Week in a state or local proclamation. Help declare March 13-19 AmeriCorps Week in your community by securing AmeriCorps Week proclamations from your city or county council, state legislature, or governor. Samples are in our Social Press Kit . Say thank you. Share why you are thankful for AmeriCorps. Create a 15-30 second video expressing your #AmeriThanks to those making a difference in your communities. If you are an AmeriCorps member or alumnus, share your story. Learn more . Share your story . We're always looking for more stories to share. Be sure to share your service story with us to be featured during AmeriCorps Week or throughout the year! This AmeriCorps Week join with us as we celebrate the impact of our programs and offer our thanks to members and volunteers for making an impact and serve others. Together, we can help the country recover and come back stronger. Together, we persevere. Together, we are AmeriCorps. Previous New CEO Discusses Celebrating Black History Month and Inclusive Volunteering Next Happy Birthday Peace Corps Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2022-03-02/celebrate-us-americorps-week-march-13-19",
    "https://americorps.gov/newsroom/events/americorps-week",
    "https://www.facebook.com/americorps",
    "http://twitter.com/AmeriCorps",
    "https://www.instagram.com/americorps/",
    "https://www.linkedin.com/company/americorps/",
    "https://www.youtube.com/watch?v=T08viqz5UP0",
    "https://readingpartners.org/blog/former-tulsa-superintendent-becomes-americorps-member-for-a-day/",
    "https://thesocialpresskit.com/americorpstoolkits#americorps-week-2022--communications-and-press-templates",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/30c3373?reqfrom=share",
    "https://americorps.gov/newsroom/stories/share-your-service-story",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2022-03-02/celebrate-us-americorps-week-march-13-19&amp;title=Celebrate with Us: AmeriCorps Week is March 13-19",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2022-03-02/celebrate-us-americorps-week-march-13-19&amp;title=Celebrate with Us: AmeriCorps Week is March 13-19&amp;source=https://americorps.gov/blogs/2022-03-02/celebrate-us-americorps-week-march-13-19",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2022-03-02/celebrate-us-americorps-week-march-13-19&amp;url=https://americorps.gov/blogs/2022-03-02/celebrate-us-americorps-week-march-13-19&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2022-02-28/new-ceo-discusses-celebrating-black-history-month-inclusive-volunteering",
    "https://americorps.gov/blogs/2022-03-07/happy-birthday-peace-corps",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [
    "Schools"
  ],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2022",
  "subdomain_2": "03",
  "subdomain_3": "02"
}