{
  "id": "americorpsgov_evidence_exchange_Greater_Twin_Cities_United_Way_Saint_Paul_Promise_Neighborhood__NdCAD_Sankofahtml",
  "url": "https://americorps.gov/evidence-exchange/Greater-Twin-Cities-United-Way-Saint-Paul-Promise-Neighborhood_-NdCAD-Sankofa",
  "title": "Greater-Twin-Cities-United-Way-Saint-Paul-Promise-Neighborhood_-NdCAD-Sankofa",
  "content": "Greater Twin Cities United Way, Saint Paul Promise Neighborhood: NdCAD-Sankofa | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Greater Twin Cities United Way, Saint Paul Promise Neighborhood: NdCAD-Sankofa Back The Sankofa reading program is a culturally-based literacy tutoring program for children of African-descent designed to close the achievement gap in reading skills. The program consists of comprehensive after-school tutoring with strong reading and cultural components. Saint Paul Promise Neighborhood (SPPN) partnered with Network for the Development of Children of African Descent (NdCAD) to deliver Sankofa to low-performing readers enrolled in kindergarten through third grade from 2013-2017 in Minneapolis-St. Paul, Minnesota. Study Goals The goal of the study is to evaluate the NdCAD’s Sankofa program that was implemented in the SPPN area from spring 2013 through fall 2017. Research Questions This evaluation included an implementation evaluation and an impact evaluation. The research questions were: Implementation Questions: Is the Sankofa program being implemented as intended? Is the Sankofa program delivery consistent with the intended program structure? Has the Sankofa program achieved its intended implementation output and goals? What program services are received by the comparison groups? What are reasons why participants do not complete Sankofa? What is the average number of follow-ups (by NdCAD tutors and/or SPPN School Partnership Coordinators) before participants discontinue the program? Impact Questions: Do children who participate in Sankofa exhibit: Increased reading performance as identified by pre-post program scores on the Developmental Reading Assessment (DRA)? Greater levels of social emotional development such as confidence in reading after the nine-week program? Greater rates of literacy growth after completing Sankofa, compared with their growth before program participation, according to FastBridge Learning reading measures? How do children who complete Sankofa perform on third-grade reading proficiency measures? Do children who complete Sankofa perform better on third-grade reading proficiency measures than similar children in Saint Paul Public Schools? Do African-centered and African-theme texts change participants’ attitudes about reading? How does having (African/African American) tutors change parent involvement in improving child’s literacy? Findings The evaluation found the following: The preliminary impact evaluation design found 90 percent of Sankofa participants increased their reading performance on the DRA II by at least one reading level over the course of the program: The percent of students below the soft-target grade-appropriate reading level likewise decreased for all grades (K-3). These findings from the preliminary evidence design lacked a comparison group and suffered from limited internal validity (as the increase could have been caused by external factors or normative growth). The moderate evidence impact evaluation design found a significant effect of Sankofa on growth in reading for the Decodable Words assessment using an ITS design (moderate level of evidence design), but not for the Letter Sounds or Sight Word assessments. However, this effect for Decodable Words was not significant after correcting for multiple comparisons (suggesting this finding could have been obtained by chance) and it was not corroborated by the multiple imputation pooled analysis. For the exploratory matched-comparison design: In Years 1 and 2, there were no effects of Sankofa on MCA-Reading scores. In Years 3 and 4, a significant difference was found. On average, Sankofa participants were expected to score 7.25 points lower on the MCA than the non-Sankofa SPPS comparison. For more information, download the full report and report brief . Full report Full Report GTCUW SPPN Sankofa_SankofaFinalReport_092418_508.pdf GTCUW SPPN Sankofa Brief_Rr1021_20180829_CNCS_Report_Brief_GTCUW_Sankofa....pdf Further information Program/Intervention Network for the Development of Children of African Descent's (NdCAD) Sankofa Program Implementing Organization Saint Paul Promise Neighborhood (SPPN) Intermediary(s) Greater Twin Cities United Way AmeriCorps Program(s) Social Innovation Fund Age(s) Studied 0-5 (Early childhood) 6-12 (Childhood) Level of Evidence Preliminary Researcher/Evaluator Center for Applied Research and Educational Improvement (CAREI) at the University of Minnesota Published Year 2018 Study Site Location (State) Minnesota Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/evidence-exchange/Greater-Twin-Cities-United-Way-Saint-Paul-Promise-Neighborhood%3A-NdCAD-Sankofa",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/evidenceexchange/GTCUW%20SPPN%20Sankofa_SankofaFinalReport_092418_508_1.pdf",
    "https://americorps.gov/sites/default/files/evidenceexchange/GTCUW%20SPPN%20Sankofa%20Brief_Rr1021_20180829_CNCS_Report_Brief_GTCUW_Sankofa..._1.pdf",
    "https://americorps.gov/sites/default/files/evidenceexchange/GTCUW%20SPPN%20Sankofa_SankofaFinalReport_092418_508_1.pdf",
    "https://americorps.gov/sites/default/files/evidenceexchange/GTCUW%20SPPN%20Sankofa%20Brief_Rr1021_20180829_CNCS_Report_Brief_GTCUW_Sankofa..._1.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "Social Innovation Fund",
  "focus_population": [
    "Schools"
  ],
  "ages_studied": [
    "6-12 (Childhood)",
    "0-5 (Early childhood)"
  ],
  "resource_type": "evidence-exchange",
  "topic": "",
  "year": "",
  "domain": "evidence-exchange"
}