{
  "id": "americorpsgov_blogs_2021_03_19_americorps_members_vista_program_are_building_better_future_young_girlshtml",
  "url": "https://americorps.gov/blogs/2021-03-19/americorps-members-vista-program-are-building-better-future-young-girls",
  "title": "americorps-members-vista-program-are-building-better-future-young-girls",
  "content": "AmeriCorps Members in the VISTA Program are Building a Better Future for Young Girls | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps Members in the VISTA Program are Building a Better Future for Young Girls Submitted by edelany on Fri, 03/19/2021 - 15:47 Mar 19, 2021 Nicole Jackson, VISTA For Christine, Mia, and Hannah the biggest benefit of participating in national service is the future they get to help build. Something they share with fellow AmeriCorps members and AmeriCorps Seniors volunteers serving for better tomorrow by building homes, rebuilding communities, restoring natural habitats (and the list goes on). But their service doesn’t require a hardhat, steel-toed boots, or a shovel. That’s because instead of houses or parks, they’re helping build brighter futures. All three women serve with AmeriCorps VISTA supporting the Youth Volunteer Corps in Missouri. Together, they help create programs and opportunities introducing the organization’s youth program participants, mostly girls and young women, to the benefits of serving others and making a difference through volunteering. In honor of Women’s History Month, they’ve shared their experience as AmeriCorps members with us and how it’s sharping their own views and future aspirations. How is your AmeriCorps service helping empower young people, girls, and women in particular? Christine: As a community outreach coordinator, my focus is on implementing sustainable solutions that can be used to reach more young people. Mia and I are focused on working to provide food and transportation options for our summer programming. Most of our program participants are girls 11-18 years of age (63% of the young people we serve are girls). By making sure we provide food and transportation, we can recruit more girls to participate in our programs. Through our programming, we equip young people to help their community and encourages leadership and healthy living. Mia: As a community outreach coordinator, I work on both programming and fund development. Through my service, I have been able to see the amazing impact that our programs has on girls and young women. Far too often, young women have limited opportunities for leadership roles. Accessing those roles can give them a leg up in their path in life and help them find their voice to advocate for the issues that matter to them. We work to engage these young women in service projects, which include significant service learning and reflection. These experiences help them understand the challenges facing their communities and give them the confidence to believe that they can help. Most of our programs have youth advisory boards that allow young participants to take on significant leadership roles in helping to guide the program. Having led the submission of five grants to benefit our affiliates in Kansas, Missouri, and South Carolina, I am proud of the impact my service support Youth Volunteer Corps has and will continue to have in these communities. Hannah: As the marketing coordinator, my service role is focused primarily on social media and website management projects. I ensure that the marketing materials portray young girls from all ethnicities and backgrounds. This helps young girls see people who look like them on our social media and websites. Through their volunteerism, young girls are empowered to not only grow into the leaders of tomorrow, but to become the leaders their communities need today. What inspired you to serve in AmeriCorps? And to serve with Youth Volunteer Corps? Hannah: I graduated from college last May. I knew I wanted to take a gap year and gain experience in between my undergraduate and graduate school studies. The pandemic and economic recession made finding opportunities for meaningful job or internship roles more difficult, and I asked for advice from my mentors. One suggested I look into a year of service through AmeriCorps. I quickly realized that I had been going about my search all wrong. I was asking, “How can this gap year help ME?” Instead, I should have been asking, “How can I help OTHERS during my gap year?” Things started to click. I decided to apply for the marketing coordinator position at YVC because I loved the idea of young people experiencing service-learning. The organization has great values, and I knew I could use my skills to help it persevere during the pandemic. Christine: My interest in service stems from growing up with parents working in the United States Foreign Service. Throughout my childhood, I lived in various countries and had the remarkable opportunity to be exposed to the importance of community service and outreach from a young age—with my parents often taking us to volunteer on weekends and holidays. After graduating from my master’s program in 2019, I returned to the U.S.  and knew that I wanted to pursue a career helping others. Then, when COVID-19 hit, it was increasingly difficult to find work, but the need for service was growing. I heard about AmeriCorps through a family member and found that the mission and goals resonated with me. When I first learned about the Youth Volunteer Corps through AmeriCorps, it felt like the right fit. Through my AmeriCorps service, I’m able to help the Corps create sustainable solutions to reach more underserved young people. That—and the fact that the systems I helped put in place will keep making an impact long after I finish my term—is what makes this experience so rewarding. Mia: About a year ago, I was a Peace Corps volunteer serving in North Macedonia and I was evacuated in response to COVID-19. I was only halfway into my 27-month term of service when my time was cut short. My top priority became finding a way to continue my commitment to service while I made the transition back to living in the states. AmeriCorps was an obvious choice! I was drawn to Youth Volunteer Corps because their mission is close to my heart: empowering young people for a lifetime commitment to service. I was, and still am, excited to contribute to my hometown community (and many others across the U.S. and Canada) by supporting this organizational mission. How has your service experience shaped you? Mia: My experience as an AmeriCorps member serving in the VISTA program has truly helped me grow as a professional, giving me valuable insight into the world of nonprofit work. I have participated in professional development events focused on grant-writing, program evaluation, and Diversity, Equity, Inclusion, and Accessibility training. The flexibility of AmeriCorps VISTA has allowed me to learn about many different aspects of nonprofit management. I feel that my time has prepared me to take the next step in my career when I conclude my service. Currently I am beginning to apply for international development positions where I can bring my passion for civic engagement to the international stage. Christine: My service as an AmeriCorps member serving in VISTA has given me the skills that I need to continue pursuing a career in the nonprofit field. Perhaps more importantly, it has shown me that while these organizations do great work, there is always more work to do and room for improvement. For me, it has highlighted the vital role of volunteering in our communities and the tremendous benefits to young people who serve. My service experience has shown me that no matter how small you believe your impact may be, it’s often felt on so many different levels. Hannah: This experience helped me find a way to focus my efforts outward. After being told to be “selfish” in college, it felt good to do work that was selfless. During such uncertain times, being a helper felt like the right thing to do. It is a privilege to participate in a year of service. Learn more about our AmeriCorps VISTA program and how you can support the vital work of organizations like Youth Volunteer Corps through national service. If you’re currently serving with (or an alumnus of) VISTA, another AmeriCorps or AmeriCorps Seniors program, we encourage you to share your story with us. Previous AmeriCorps Kicks-off Women’s History Month, Getting to Know Trailblazers Mary Tobin and Atalaya Sergi Next Family Reunion Makes Lasting Impression on AmeriCorps Members Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2021-03-19/americorps-members-vista-program-are-building-better-future-young-girls",
    "https://americorps.gov/serve/fit-finder/americorps-vista",
    "https://yvc.org/",
    "https://careers.state.gov/work/foreign-service/",
    "https://americorps.gov/serve/fit-finder/americorps-vista",
    "https://americorps.gov/newsroom/stories/share-your-service-story",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2021-03-19/americorps-members-vista-program-are-building-better-future-young-girls&amp;title=AmeriCorps Members in the VISTA Program are Building a Better Future for Young Girls",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2021-03-19/americorps-members-vista-program-are-building-better-future-young-girls&amp;title=AmeriCorps Members in the VISTA Program are Building a Better Future for Young Girls&amp;source=https://americorps.gov/blogs/2021-03-19/americorps-members-vista-program-are-building-better-future-young-girls",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2021-03-19/americorps-members-vista-program-are-building-better-future-young-girls&amp;url=https://americorps.gov/blogs/2021-03-19/americorps-members-vista-program-are-building-better-future-young-girls&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2021-03-05/americorps-kicks-womens-history-month-getting-know-trailblazers-mary-tobin-atalaya",
    "https://americorps.gov/blogs/2021-03-23/family-reunion-makes-lasting-impression-americorps-members",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA; AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2021",
  "subdomain_2": "03",
  "subdomain_3": "19"
}