{
  "id": "americorpsgov_blogs_2019_06_24_summertime_and_great_outdoorshtml",
  "url": "https://americorps.gov/blogs/2019-06-24/summertime-and-great-outdoors",
  "title": "summertime-and-great-outdoors",
  "content": "Summertime and the Great Outdoors | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Summertime and the Great Outdoors Submitted by admin on Mon, 06/24/2019 - 10:45 Jun 21, 2019 CNCS External Affairs Today marks the first day of summer, and we can almost hear Mom's voice telling us to go play outside. And, frankly, there's no better time to start than Great Outdoors Month . This annual celebration of outdoor activities and their benefits has grown from a week-long celebration in 1998 to cover the entire month of June. Whether you are into fishing, camping, hiking, biking, or other outside pursuits, there are plenty of places to enjoy them. You could spend all summer exploring some of the 419 locations in the National Park System , or visit some of the thousands of state and local park facilities near you. The Corporation for National and Community Service leads AmeriCorps and Senior Corps programs that serve as stewards for many of the outdoor spaces we have in this nation . The natural beauty we experience in our public spaces requires a lot of work to protect, and these national service members help maintain and preserve recreational areas for everyone to enjoy. Let's take Mom's advice and go have some fun outside. It would be a shame to let all of that beauty go to waste. Read the June 21 National Service News Previous The Many Ways AmeriCorps Members #ServeOutdoors Next Recognizing Outstanding AmeriCorps Service and Innovation Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2019-06-24/summertime-and-great-outdoors",
    "https://www.greatoutdoorsmonth.org/",
    "https://www.nps.gov/aboutus/national-park-system.htm",
    "https://www.nationalservice.gov/focus-areas/environmental-stewardship",
    "https://content.govdelivery.com/accounts/USCNCS/bulletins/24cbb99",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2019-06-24/summertime-and-great-outdoors&amp;title=Summertime and the Great Outdoors",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2019-06-24/summertime-and-great-outdoors&amp;title=Summertime and the Great Outdoors&amp;source=https://americorps.gov/blogs/2019-06-24/summertime-and-great-outdoors",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2019-06-24/summertime-and-great-outdoors&amp;url=https://americorps.gov/blogs/2019-06-24/summertime-and-great-outdoors&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2019-06-20/many-ways-americorps-members-serveoutdoors",
    "https://americorps.gov/blogs/2019-09-24/recognizing-outstanding-americorps-service-and-innovation",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2019",
  "subdomain_2": "06",
  "subdomain_3": "24"
}