{
  "id": "americorpsgov_blogs_2021_01_12_americorps_member_changes_career_aspiration_after_moving_gap_year_vistahtml",
  "url": "https://americorps.gov/blogs/2021-01-12/americorps-member-changes-career-aspiration-after-moving-gap-year-vista",
  "title": "americorps-member-changes-career-aspiration-after-moving-gap-year-vista",
  "content": "AmeriCorps Member Changes Career Aspiration after Moving Gap Year in VISTA | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps Member Changes Career Aspiration after Moving Gap Year in VISTA Submitted by kaparker on Thu, 01/07/2021 - 14:21 Jan 12, 2021 Nicole Jackson, AmeriCorps staff After graduating from Baylor University with a bachelor’s degree in biology, Christian Soto came across an AmeriCorps position while searching for a meaningful gap year experience. He was excited about the opportunity and felt a genuine call to the program’s mission. Joining AmeriCorps would offer him the opportunity to see other parts of the country and hone his skills, professionally and personally. Becoming an AmeriCorps member in the VISTA program, he learned, would give him the chance to approach poverty from a systemic perspective, helping to achieve meaningful change. After his successful application to VISTA , Christian spent his first two assignments developing and implementing program lessons for afterschool programming with the Let’s Get Movin’ program at the East Boston Neighborhood Health Center and creating resources and discount lists for veterans and military families during his service with the Veterans’ Holistic Healthcare Initiative. Three years later, Christian, a Mount Pleasant, Texas native, is serving in his third and final term with AmeriCorps, this time as a VISTA Leader in Buffalo, NY. Working with Project M.O.V.E., located within the City of Buffalo’s Division of Citizen Services, Christian supports and guides 15 AmeriCorps members, in their personal and professional development and assists the program manager in reporting and improving the overall quality of the program. “In general, our mission is to support Mayor Byron Brown’s initiatives for economic development, innovative government, strong neighborhoods, and diversity/inclusivity,” explains Christian. As a VISTA Leader, Christian works to improve the experiences of AmeriCorps members in the VISTA program while being able to contribute to timely and meaningful initiatives. In this role, he says he sharpens his managerial skills, gains conflict resolution experience, and is learning more about program and people leadership. The Division of Citizen Services gives Christian, and his members, the opportunity to see first-hand the intersection between government and community engagement. “My unique position as a VISTA Leader in City Hall really opened my eyes to the complex navigation of relationships with community stakeholders and decision makers during times of emergency,” Christian says of his service. He also witnessed how quickly local government and communities can and must pivot when a crisis unfolds. As the economic and social consequences of the COVID-19 pandemic became evident, Buffalo coordinated an all-out effort to connect citizens to local resources such as food pantries, employment opportunities, testing sites, legal services, and other government efforts through a new initiative known as the Good Neighbors Network. AmeriCorps members played a crucial role in recruiting more than 200 volunteers to organize and disseminate door hangers that offered neighbors easy access to information for these services. “I am proud to say that our members and the Division of Citizen Services have been on the forefront of community engagement as a means for assisting the most vulnerable and marginalized citizens,” shared Christian. Thanks to his AmeriCorps experience, Christian plans to shift his energy toward developing wide-ranging strategies and approaches for healthier populations, system-wide policies, and health issues prevention. He has been admitted to the University of Buffalo’s School of Law in Fall 2021 and will continue serving his community through the United States Public Health Service. He wants to take his education and experiences to focus on public health law and policies that influence improved national health outcomes. “I genuinely believe in the power of AmeriCorps members and community members to create meaningful change across our country,” he says. “I hope that my story can inspire people to become civically engaged whether it's through AmeriCorps or some other national service group.” Previous AmeriCorps and AmeriCorps Seniors COVID-19 Response Next Service Unites on MLK Day and Beyond Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2021-01-12/americorps-member-changes-career-aspiration-after-moving-gap-year-vista",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2021-01-12/americorps-member-changes-career-aspiration-after-moving-gap-year-vista&amp;title=AmeriCorps Member Changes Career Aspiration after Moving Gap Year in VISTA",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2021-01-12/americorps-member-changes-career-aspiration-after-moving-gap-year-vista&amp;title=AmeriCorps Member Changes Career Aspiration after Moving Gap Year in VISTA&amp;source=https://americorps.gov/blogs/2021-01-12/americorps-member-changes-career-aspiration-after-moving-gap-year-vista",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2021-01-12/americorps-member-changes-career-aspiration-after-moving-gap-year-vista&amp;url=https://americorps.gov/blogs/2021-01-12/americorps-member-changes-career-aspiration-after-moving-gap-year-vista&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2020-11-20/americorps-and-americorps-seniors-covid-19-response",
    "https://americorps.gov/blogs/2021-01-15/service-unites-mlk-day-beyond",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2021",
  "subdomain_2": "01",
  "subdomain_3": "12"
}