{
  "id": "americorpsgov_about_agency_overview_agency_wide_policies_noticeshtml",
  "url": "https://americorps.gov/about/agency-overview/agency-wide-policies-notices",
  "title": "agency-wide-policies-notices",
  "content": "Agency-Wide Policies and Notices | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb About Agency Overview Agency-Wide Policies and Notices AmeriCorps policies and notices regarding our website, our social media, our grant-making process, and more. Agency Overview Agency-Wide Policies and Notices AmeriCorps Fraud Alert AmeriCorps’ Equity Action Plan Budget and Performance Plans Civil Rights for Employees, Service Members, and Volunteers Digital Strategy Disability and Accessibility Federal Register Notices FOIA and the Privacy Act No FEAR Act Open Government Plain Writing Privacy Policy Results of Grant Competitions Statutes and Regulations Strategic Plan Vulnerability Disclosure Policy A Note about Plug-Ins Plug-ins allow visitors to AmeriCorps websites to open various types of files on the site. When users select a link to an external website, they are leaving the AmeriCorps site and are subject to the privacy and security policies of the owners/sponsors of the external website. AmeriCorps does not control or guarantee the accuracy, relevance, timeliness, or completeness of these outside links. The inclusion of these links is not intended to reflect their importance, nor is it intended to endorse any views expressed, products, or services offered on these outside sites, or the organizations sponsoring them. Link Policy Toggle AmeriCorps links to websites that provide useful, timely, citizen-centered government information and services, consistent with our linking policy. Links to Government Websites AmeriCorps links to publicly available websites that are government-owned or government sponsored, unless directed not to by the agency that owns the site. Acceptable federal government-owned or government-sponsored website domains include .gov, .mil, and .fed.us. AmeriCorps also links to: quasi-government agencies and websites created by public sector/private sector partnerships; state and local government sites (e.g., www.maryland.gov ); and some government-sponsored websites that end in .com, .org, or .net (e.g., www.usps.com for the U.S. Postal Service and www.ncfy.com/clear.html for the National Clearinghouses on Homeless Youth & Families). Links to Non-Government Websites AmeriCorps websites also link to websites that are not government-owned or government-sponsored if these websites provide government information and/or services in a way that is not available on an official government website. AmeriCorps provides these non-government websites as a public service only. The U.S. government, including AmeriCorps, neither endorses nor guarantees in any way the external organizations, services, advice, or products included in these website links. Furthermore, the U.S. government neither controls nor guarantees the accuracy, relevance, timeliness, or completeness of the information contained in non-government website links. Evaluation Criteria AmeriCorps staff evaluates all links using the following criteria: Is the website an official government-owned or supported website? If not, does the website provide government information and/or services in a way that is not available on an official government website? Does the website complement existing information, products, and services from AmeriCorps? Is the website accessible and applicable to a wide audience? Is the website’s content relevant, useful, and authoritative for citizens, businesses, and/or government officials? Does the website’s information appear to be accurate and current? Is the website’s approach to the privacy of personal information consistent with the government's privacy and security policies? Is the primary intent of the website to educate and inform, rather than persuade, convert, or sell? The site may include advertising but must be free from heavy marketing or promotion of products. Does the website provide information free of charge? Reciprocal Links Though any site is welcome to link to AmeriCorps websites, we do not engage in reciprocal linking. Our sites are in the public domain, and there is no cost or special permission required to link to them. Featured Links AmeriCorps websites feature links, information, and services based on one or more of the following highly desirable criteria: The website enables citizens, businesses, and/or government officials to conduct transactions online (e.g., buy materials for national service needs or projects). The website provides citizens, businesses, and/or government officials with the information they need to interact directly with government organizations (e.g., clearly available telephone numbers, street addresses, e-mail addresses, and instructions). The website provides citizens with information about service performance. The website provides community-level information and services (e.g., MapStats, post office locators, Social Security Office locators, National Park Service Guides, and veterans’ facilities). Prohibitions AmeriCorps will not link to any website that exhibits hate, bias, discrimination, specific religious views, or social agendas. Furthermore, AmeriCorps reserves the right to deny or remove any link that contains misleading information or unsubstantiated claims or is determined to be in conflict with AmeriCorps’ mission or policies. Disclaimer of Endorsement The information posted on AmeriCorps websites includes hypertext links or pointers to information created and maintained by other public and/or private organizations. AmeriCorps provides these links and pointers solely for our users’ information and convenience. AmeriCorps does not control or guarantee the accuracy, relevance, timeliness, or completeness of information contained on a linked website. AmeriCorps does not endorse the organizations sponsoring linked websites and does not endorse the views expressed or products offered therein. AmeriCorps cannot authorize the use of copyrighted, trademarked, and servicemarked materials contained in linked websites. Users must request such authorization from the sponsor of the linked website. AmeriCorps is not responsible for transmissions that users receive from linked websites. AmeriCorps does not guarantee that external websites comply with Section 508 (Accessibility Requirements) of the Rehabilitation Act. Priorities and Schedules for Posting Information Toggle Our priorities and schedules for making AmeriCorps information available on our public internet are as follows: Priority 1 , as required by law, regulation, Presidential directive, or other official directive or national security: Agency reports and plans, including Annual and Performance Reports, Performance and Accountability Reports, FAIR Act reports, and NO FEAR Act Reports Privacy and accessibility notices Freedom of Information Act (FOIA) reading room Links to USA.gov, Regulations.gov and other required destinations Priority 2 , mission-critical and essential for program operations but not required by law, regulation, or Presidential directive (i.e., information or services tied directly to AmeriCorps’ mission and/or strategic plan): Job vacancy announcements Grants announcements and project reports Information about major initiatives Priority 3 , frequently requested information or services that would improve organization business processes and/or customer service to the public: Customer-centric orientation to information and programs Publications Forms and other \"contact us\" methods facilitating public requests for information and services Press releases and press kits Resources for grantees and program managers Priority 4 , other information: Frequently Asked Questions (FAQs) and other information intended to supplement or further explain information presented in more detail elsewhere on the site Site maps and other web site navigational aids Schedules All content noted above currently exists on our public internet. Information is posted to our website as soon as it is ready unless a deadline applies, in which case the information is posted on or before the deadline. Our website is accessible to persons with disabilities, per requirements under Section 508 of the Rehabilitation Act (29 U.S.C. 794d), as amended by the Workforce Investment Act of 1998 (P.L. 105-220), August 7, 1998. Communication during Grant Application Review Process Policy Social Media Policy Evaluation Policy Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/about/agency-overview/agency-wide-policies-notices",
    "http://www.microsoft.com/download/en/details.aspx?id=4",
    "http://www.microsoft.com/download/en/details.aspx?id=10",
    "http://www.microsoft.com/download/en/details.aspx?id=13",
    "http://get.adobe.com/reader/",
    "http://www.maryland.gov/",
    "http://www.usps.com/",
    "https://rhyclearinghouse.acf.hhs.gov/",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/documents/GARPCommunication.pdf",
    "https://americorps.gov/sites/default/files/documents/Social%20Media_2019.pdf",
    "https://americorps.gov/sites/default/files/document/AmeriCorps-Evaluation-Policy.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "about",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "about",
  "subdomain_1": "agency-overview"
}