{
  "id": "americorpsgov_blogs_2023_05_15_feeding_hungry_reaping_harvesthtml",
  "url": "https://americorps.gov/blogs/2023-05-15/feeding-hungry-reaping-harvest",
  "title": "feeding-hungry-reaping-harvest",
  "content": "Feeding the Hungry, Reaping the Harvest | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Feeding the Hungry, Reaping the Harvest Submitted by dsong on Mon, 05/15/2023 - 10:56 May 15, 2023 Atalaya Sergi AmeriCorps Seniors Director Atalaya Sergi shares how older Americans serving with AmeriCorps Seniors combat food insecurity and hunger in their communities, greatly enriching and benefitting their own lives through service. Everyone knows the feeling of being hungry. The stomach growls and blood sugar drops, igniting an internal firestorm of biological and emotional responses. Being hungry affects our mood and our performance. The ability to concentrate or focus clouds the mind while motor skills deteriorate. For most of us, the results range from grumpiness to a full-on crash in energy and production. But none of these symptoms describe real hunger. No, that’s something else altogether. In the most extreme sense, hunger describes a condition far beyond a growling, empty belly. It’s a prolonged and severe lack of food or access to food. As we age, our bodies require less food, and our appetites may decrease. However, for many older Americans, hunger remains a persistent problem, and older Americans suffer from hunger at too high of a rate. In fact, one in 14 older adults face food insecurity and hunger in America, according to Feeding America . In 2021, 5.5 million Americans over the age of 60 faced food security issues. AmeriCorps Seniors volunteers serving alongside Second Gentleman Douglas Emhoff There are many factors that contribute to hunger among older Americans. Limited income, lack of transportation, and difficulty accessing healthy food options are just a few examples. Many also may face health issues that make it difficult for them to shop for groceries or prepare meals. Like a silent plague, hunger puts older Americans, especially those in underserved communities, seriously in harm’s way. Malnutrition can lead to a weakened immune system, increased risk of falls and injuries, and other health problems. Hunger also can exacerbate existing health conditions and lead to a decline in overall quality of life. AmeriCorps Seniors volunteers bring critical support to communities, addressing hunger in their own neighborhoods, cities and towns. AmeriCorps Seniors RSVP and Senior Companion programs make a positive impact on the health of other older adults through food security initiatives. These volunteers combat hunger. On the Jersey Shore, for example, volunteers with Clinton County AmeriCorps Seniors RSVP deliver home-grown vegetables to the New Love Center, an organization addressing hunger by preparing more than 1,000 home-cooked meals every month, serving nearly 900 people. This one program leverages multiple other organizations to address food security in the local community. Nationwide, AmeriCorps Seniors volunteers serving in RSVP helped more than 727,000 people increase food security through similar programs in 2021. More than 2 million Americans across the country received food security support due to the efforts of AmeriCorps Seniors volunteers. Overall, more than 30 million pounds of food were provided in 2021 through AmeriCorps partnerships overall with several community initiatives, increasing sustainability for historically underserved communities. AmeriCorps Seniors volunteers and AmeriCorps members serving at a local food bank But these programs even go a step further. Beyond preparing and delivering food, AmeriCorps Seniors also help address hunger, obesity, and malnutrition through education. These efforts illuminate issues with inadequate food storage, food access, and health education. Volunteers in these programs aid millions of people suffering from hunger each year. Volunteers serving with Senior Companion programs, for example, support older adults, helping neighbors get to grocery stores, ensuring adequate meals and acquiring a well-stocked food pantry. They identify problems and work to address them. Meanwhile, RSVP helps ensure older adults maintain access to benefits in which they qualify. Programs like The ACES Project deploy specially trained volunteers into low-income areas of New York. Their work ensures seniors gain access to Medicaid, Medicare, Supplemental Security Income and more. Other grantee programs provide immediate access to food for those suffering difficulties with driving, walking or impaired vision, which make travelling to acquire groceries an extreme challenge. RSVP of Butler County in Kansas supports older adults in rural communities. Volunteers take frozen meals to distribution points and assist seniors who can’t shop for groceries themselves. They even factor in individual dietary concerns, making this assistance personal at a true micro-level. AmeriCorps Seniors volunteer Jane C. began her service with RSVP in 2006, supporting community members with emergency food distribution at the Port Townsend Food Bank. Since then, the 85-year-old Covella has amassed more than 3,400 hours serving others. “I started volunteering for two reasons, to give back to the community that helped me with funds for car expenses when I needed it and to help [others] get the emergency food until they get back on their feet successfully,” Jane said. “This food bank is the most wonderful I have ever seen!” Reaping the Rewards of Service The data is clear; AmeriCorps Seniors volunteers bring so much to the lives of so many people in need. But incredibly, the lives our older American volunteers help the most might just be their own. Studies show volunteering and service greatly enrich the lives of volunteers themselves. Eighty-four percent of AmeriCorps Seniors volunteers reported improved or stable health. Another 88 percent felt a decrease in feelings of isolation, while 78-percent felt less depressed. Older volunteers reap extraordinary benefits from their service, including significant mental and physical health benefits. Mortality rates decline while individual strength and energy levels increase. Older volunteers experience a decrease in depression rates while physical limitations subside. “My memory has improved since volunteering,” Jane explained. “[People] are thrilled when I remember their favorite food preferences…I always enjoy positive feedback from the people I meet.” AmeriCorps Seniors provide an immeasurable service to our country. They support teachers in our schools through the Foster Grandparent Program. They assist low-income mothers in need. Their relationships with children provide a guiding light to stay on the correct path toward success through the Senior Companion Program. And where food insecurity pervades, RSVP volunteers work to eradicate this blight on our society. But for those that take on the challenge of embarking on this “Second Act” toward service, their love and kindness find its way home again. You truly “get what you give,” and more when it comes to kindness, empathy, and service. No group proves that statement more than AmeriCorps Seniors volunteers. Learn more about how you can become involved in your community through AmeriCorps Seniors Foster Grandparent Program, RSVP, or Senior Companion Program . Previous Empowering Women and Mothers Through Service Next AmeriCorps Addresses the Mental Health Crisis Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-05-15/feeding-hungry-reaping-harvest",
    "https://www.feedingamerica.org/hunger-in-america/senior-hunger-facts",
    "https://www.cssny.org/programs/entry/the-aces-project",
    "https://www.bucoks.com/155/RSVP",
    "https://americorps.gov/sites/default/files/evidenceexchange/Longitudinal_Study_of_Foster_Grandparent_and_Senior_Companion_Programs_FINAL_508_1.pdf",
    "http://americorps.gov/Seniors",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-05-15/feeding-hungry-reaping-harvest&amp;title=Feeding the Hungry, Reaping the Harvest ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-05-15/feeding-hungry-reaping-harvest&amp;title=Feeding the Hungry, Reaping the Harvest &amp;source=https://americorps.gov/blogs/2023-05-15/feeding-hungry-reaping-harvest",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-05-15/feeding-hungry-reaping-harvest&amp;url=https://americorps.gov/blogs/2023-05-15/feeding-hungry-reaping-harvest&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-05-12/empowering-women-mothers-through-service",
    "https://americorps.gov/blogs/2023-05-18/americorps-addresses-mental-health-crisis",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "05",
  "subdomain_3": "15"
}