{
  "id": "americorpsgov_blogs_2024_08_13_americorps_30_student_colleague_mentor_mentees_national_service_journeyhtml",
  "url": "https://americorps.gov/blogs/2024-08-13/americorps-30-student-colleague-mentor-mentees-national-service-journey",
  "title": "americorps-30-student-colleague-mentor-mentees-national-service-journey",
  "content": "AmeriCorps 30: From Student to Colleague, A Mentor and Mentee’s National Service Journey | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps 30: From Student to Colleague, A Mentor and Mentee’s National Service Journey Submitted by dsong on Mon, 08/12/2024 - 19:16 Aug 13, 2024 AmeriCorps Staff For the past 30 years, millions of Americans served as AmeriCorps members and AmeriCorps Seniors volunteers to address our nation's most urgent needs. During the agency's 30th anniversary, we highlight how national service transformed the lives of those served and those who serve, like Jason and Nathan. AmeriCorps members serve as tutors and mentors in our nation's schools, helping students discover their potential to succeed in and out of the classroom. Jason and Nathan are a duo who demonstrate the power of national service in our schools and in our lives. Inspiring and Advancing Student Success Rates Jason's studies in political science and international studies at Northwestern University fueled his desire to create meaningful change in the world. \"I realized there was no greater way to make an impact than by becoming a teacher. I chose to serve with Teach For America as an AmeriCorps member to confront challenges in our community. Schools and opportunities are not always equitable, and I wanted to be part of the solution. The biggest challenge for my students, and many across the country, has never been their drive but rather the lack of opportunity. \"I see every day that our students are capable, intelligent, and eager to learn, but they need opportunities to surpass the expectations set for them. When I started teaching, our middle school didn't have an Algebra program because we lacked the data to justify offering high school-level courses even though these classes are common in more affluent schools across the country. I believed in my students' potential, so I offered the class after school to any student interested because of how important math is to our students. A student's math background is one of the most important predictors of whether they will graduate college in four years, regardless of their race, socioeconomic status, zip code, or parent education. \"I distributed flyers, spoke with families, and prepared for the first day for 20 students. When I opened the door, I was overwhelmed to see 86 students waiting outside, eager to take a voluntary Algebra class for two hours after school. Since then, more than 1,200 students at our school have earned Algebra credit, and more than 600 have earned both Algebra and Geometry credits. We've even had a handful of students complete Algebra, Geometry, and Algebra 2, making our program one of the most successful advanced middle school math programs in Phoenix, Ariz. Our Algebra students now make up the majority of the Calculus students across the entire Phoenix Union High School District, a district serving 28,000 students. This is why I stayed beyond my initial two-year Teach For America commitment. We were building something to help many more students realize their potential. Since I began teaching, I've seen firsthand how my students can accomplish anything they set their minds to. For the past 13 years, I've had the privilege of teaching many inspirational, intelligent, loving, and determined young men and women, like one of my first students and now, my colleague, Nathan. We believe that when students are given the opportunity, they will rise to meet high expectations and thrive. All they need are the opportunities to achieve their dreams.\" Previous Next Returning Gratitude through Service Nathan first met Jason as a teacher in the seventh grade. His mentorship inspired Nathan to join AmeriCorps with Teach For America and serve alongside him. \"When I met Mr. Catanese, I had almost no idea what I wanted to do, but I knew I wanted to help people. I'd always been interested in science, and at this point in my life, I was set on the medical field in some capacity. Had I not met Mr. Catanese, I would have had a drastically different trajectory. He helped me attend the best high school in Ariz., apply and succeed at Arizona State University with a degree in Healthcare Compliance and Regulations and a minor in Psychology, and encouraged me to apply for a Teach For America internship. Through this internship, I was able to recruit hundreds of prospective Americorps members, and became one myself upon graduation. \"As an AmeriCorps member, I taught eighth-grade science for two years and social studies for a year alongside my mentor, Mr. Catanese, at the school where I first met him. I believe I served as an example to my students as someone who was once in their shoes. Having been a student at the middle school when I was an AmeriCorps member, I met many students whose very own siblings were once my friends when I attended. I hope they can see the possibility of higher education as something attainable. \"As a teacher, I hope to instill a love of science and prompt curiosity about the wonders around them. I was filled with pride whenever I saw improvement in my students' assessments, quality of work, and so on, but most importantly, I am most proud of seeing my students become greater versions of themselves throughout the years. National service provided me, by far, one of the best opportunities to serve in the same community that I grew up in.” Previous Next Creating Lasting Relations Beyond Service Jason and Nathan's journey is a testament to how national service leaves a positive impact on the lives of those served and those who serve. \"My life wouldn't be as fulfilling if I hadn't joined Teach For America,\" said Jason. \"I never would have met Nathan. I wouldn't have had the chance to learn strength and resilience from Eduardo, who showed me that a home is where love resides. I wouldn't have met Tania, who taught me the importance of simply showing up. Most importantly, I wouldn't have found my second family, who have inspired me not only to work hard every day as a teacher but also to start my nonprofit organization dedicated to helping students from inner-city backgrounds access college opportunities, Camp Catanese Foundation .” Hundreds of thousands of AmeriCorps members and AmeriCorps Seniors volunteers, like Jason and Nathan, serve our students in our schools every day to help them thrive in and out of the classroom. Through partnerships with the Department of Education and Johns Hopkins Everyone Graduates Center, national service continues to introduce initiatives like the National Partnership for Student Success to ensure we place caring adults in and out of schools to help educators and families address critical educational and mental health challenges in our schools. Previous AmeriCorps 30: Six Years Later, Recovery Continues Next Answering the Call to Serve: 9/11 Response and the USA Freedom Corps Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2024-08-13/americorps-30-student-colleague-mentor-mentees-national-service-journey",
    "https://socialpresskit.com/americorps30",
    "https://www.teachforamerica.org/",
    "https://www.campcatanese.com/",
    "https://www.ed.gov/",
    "https://www.partnershipstudentsuccess.org/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2024-08-13/americorps-30-student-colleague-mentor-mentees-national-service-journey&amp;title=AmeriCorps 30: From Student to Colleague, A Mentor and Mentee’s National Service Journey",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2024-08-13/americorps-30-student-colleague-mentor-mentees-national-service-journey&amp;title=AmeriCorps 30: From Student to Colleague, A Mentor and Mentee’s National Service Journey&amp;source=https://americorps.gov/blogs/2024-08-13/americorps-30-student-colleague-mentor-mentees-national-service-journey",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2024-08-13/americorps-30-student-colleague-mentor-mentees-national-service-journey&amp;url=https://americorps.gov/blogs/2024-08-13/americorps-30-student-colleague-mentor-mentees-national-service-journey&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2024-07-18/americorps-30-six-years-later-recovery-continues",
    "https://americorps.gov/blogs/2024-08-20/answering-call-serve-911-response-usa-freedom-corps",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [
    "Schools"
  ],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2024",
  "subdomain_2": "08",
  "subdomain_3": "13"
}