{
  "id": "americorpsgov_about_careershtml",
  "url": "https://americorps.gov/about/careers",
  "title": "careers",
  "content": "Careers | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb About Working at AmeriCorps Work in our headquarters office located in Washington, DC, one of our region offices, or one of the AmeriCorps NCCC campuses located across the country. Submitted by Anonymous (not verified) on Fri, 11/06/2020 - 11:36 Why Work at AmeriCorps? You'll Be a Part of Something Bigger Our mission is to improve lives, strengthen communities, and foster civic engagement through service and volunteering. We work to deliver grants and/or AmeriCorps members and volunteers to local organizations across the nation and invite individuals to serve alongside each other for the betterment of every community. Grow Personally and Professionally Learn and grow while giving back. Individuals who work at AmeriCorps build new skillsets, grow professionally, and have the opportunity to create a network across the agency through trainings, team building, and working groups. Turn Your Passion into Action AmeriCorps culture is unlike any other federal agency. You’ll learn how to reach your own potential by working in an inclusive environment of individuals who share a passion for service and commitment to AmeriCorps’ core values. You’ll have the opportunity to join one of our affinity groups, volunteer in your community, and help others as a part of our work force. Federal Employee Benefits AmeriCorps provides several benefits for its members and volunteers. Education awards are available to AmeriCorps members, as well as supplemental health insurance, loan deferment, and childcare. Benefits vary by program. Apply Today to Join Our Team To view current vacancies within AmeriCorps, visit USAJobs.gov, the official job site of the United States Federal Government. VIEW CURRENT OPPORTUNITIES AmeriCorps is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national or ethnic origin, citizenship, sex, sexual orientation, gender identity and expression, genetic information, veteran status, age, or disability status. Read our Civil Rights and Workforce Diversity Policy . The Benefits of Working at AmeriCorps AmeriCorps’ goal is to make the agency on of the best and most equitable places to work in the federal government. Explore the jobs available at AmeriCorps and the benefits of being an employee. Learn more What Do Team Members Say About Working with AmeriCorps? “I am constantly inspired by the unwavering commitment and passion of my colleagues who share a common mission. I am proud of the work we’ve done on the agency’s strategic plan. It has been a highly collaborative effort and I am grateful to have been a part of such a dedicated team.” - Martha Martha works in the CEO immediate office and is responsible for program expansion and project management. Where AmeriCorps Works AmeriCorps services communities all across America, but AmeriCorps currently has offices in the following areas. Send us an email to ask questions or to follow up AmeriCorps is an Employer of National Service Did you serve with AmeriCorps or Peace Corps? As an Employer of National Service, AmeriCorps is committed to providing job opportunities to national service participants. Accordingly, qualified AmeriCorps alumni, returned Peace Corps volunteers, and other national service participants are encouraged to apply to our positions. AmeriCorps Pathways Established to help recruit talented people to work in the federal government, the Pathways Programs target students and recent graduates of all ages and backgrounds. Learn more Meet Our Team Our agency is made of a team of individuals from different backgrounds and experiences, working as one to strengthen communities in our country. Our team About AmeriCorps AmeriCorps provides opportunities for Americans to address the nation’s most pressing challenges, improve lives and communities, and strengthen civic engagement. About us Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/about/careers",
    "https://americorps.gov/about/agency-overview/no-fear-act#diversity",
    "https://americorps.gov/about/our-team",
    "https://americorps.gov/about",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "about",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "about"
}