{
  "id": "americorpsgov_blogs_2019_05_24_life_lessons_mentoring_military_leaderhtml",
  "url": "https://americorps.gov/blogs/2019-05-24/life-lessons-mentoring-military-leader",
  "title": "life-lessons-mentoring-military-leader",
  "content": "Life Lessons in Mentoring from a Military Leader | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Life Lessons in Mentoring from a Military Leader Submitted by admin on Fri, 05/24/2019 - 10:57 Jan 17, 2019 Katherine Parker Admiral Earl Gay knows a lot about inspiring others from 33 years of Navy service January is National Mentoring Month and the Corporation for National and Community Service (CNCS) is supporting our friends at MENTOR by sharing some advice from a man who, among his many achievements, has made mentoring his mission: retired Navy Admiral Earl Gay. Admiral Gay (pictured above, right) is the Senior Advisor for Wounded Warrior and Veterans and Military Families Initiatives at CNCS and says a lot of what he does is rooted in establishing trust, building relationships, and leading change, all of which fall under his concept of mentorship. These traits come naturally to the Admiral as a leader of men and women in the armed forces. He willingly shares his life story, using wall-mounted photos of family and friends to illustrate his points, “I like people to have the whole story; it extends an arm of trust.” Admiral Gay grew up in Atlanta, Georgia, and is the youngest of three siblings who inspired him to strive for greatness. After high school he applied to the U.S. Naval Academy, which he turned into 33 years of military service, flying as a Navy pilot, commanding an amphibious aircraft carrier, earning two master’s degrees, and enjoying countless opportunities to mentor. He says it was an honor to serve in uniform and now in national service and credits his service to the idea that mentoring is a mutual investment. “It is almost familial; it’s a responsibility to the next generation, to colleagues, to neighbors,” he said. “I feel blessed to have had so many learning opportunities and that this country invested so much in me; I feel it is my duty to share my knowledge and skills with others. “I see it as everyone’s responsibility to continue learning and continue sharing so that we all become better,” said Admiral Gay. “Teach the fisher to fish so there are more fish to eat.” Always returning back to the Naval Academy, Admiral Gay has mentored members of the Navy football team and incoming midshipmen, and he continues this role in both structured mentorship programs and as an informal advisor to people adjusting to new environments. “We’ve all been there, in an unfamiliar situation, we have to look out for each other and share our knowledge to reach the next goal,” said Admiral Gay, noting that mentoring is an educational experience for the mentee and the mentor. “No one is ever too young to be a mentor or too wise to be a mentee.” This idea resonates with the spirit of service and volunteering; as Dr. Martin Luther King Jr. said, “Everyone can be great because everyone can serve.” CNCS urges Americans to take up this spirit of service by becoming a mentor or joining another volunteer effort in their community. Visit our website to learn more about mentoring and to search volunteer opportunities. With a cheerful expression on his face Admiral Gay drives home his belief that trust, compassion, service, and mentorship are synonymous. His military leadership and mentor expertise are clear as he closes with “If you ever wonder what I am all about, just check my email signature; it says ‘One Team, One Fight.’ That message has transcended my career.” Previous 12 Easy Ways to Volunteer Next MLK Day: The Girl in the Picture Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2019-05-24/life-lessons-mentoring-military-leader",
    "https://www.mentoring.org/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2019-05-24/life-lessons-mentoring-military-leader&amp;title=Life Lessons in Mentoring from a Military Leader",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2019-05-24/life-lessons-mentoring-military-leader&amp;title=Life Lessons in Mentoring from a Military Leader&amp;source=https://americorps.gov/blogs/2019-05-24/life-lessons-mentoring-military-leader",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2019-05-24/life-lessons-mentoring-military-leader&amp;url=https://americorps.gov/blogs/2019-05-24/life-lessons-mentoring-military-leader&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2019-04-29/12-easy-ways-volunteer",
    "https://americorps.gov/blogs/2019-05-24/mlk-day-girl-picture",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [
    "Veterans and Military Families"
  ],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2019",
  "subdomain_2": "05",
  "subdomain_3": "24"
}