{
  "id": "americorpsgov_blogs_2023_01_27_next_steps_americorps_alumnus_makes_career_out_serving_othershtml",
  "url": "https://americorps.gov/blogs/2023-01-27/next-steps-americorps-alumnus-makes-career-out-serving-others",
  "title": "next-steps-americorps-alumnus-makes-career-out-serving-others",
  "content": "Next Steps: AmeriCorps Alumnus Makes Career Out of Serving Others | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Next Steps: AmeriCorps Alumnus Makes Career Out of Serving Others Submitted by rfrazier on Thu, 12/08/2022 - 08:34 Jan 27, 2023 Caleb Torres AmeriCorps alumnus Caleb shares how he found a career path through service when going through a challenging time. When I arrived in Washington, DC, in 2014, I was excited to study international affairs at George Washington University, and eventually, I planned to serve in the Peace Corps.  As a first-generation college student, I struggled financially and emotionally during my first year. While I found the campus welcoming, something was missing. I was so used to being surrounded by family that I hadn’t realized how important that support network was until it was hundreds of miles away. After some time sulking, I realized it was my responsibility to build a new support network. It was the perfect time for me to discover AmeriCorps. Initially, I sought a gap year to overcome my feelings of isolation. I was accepted to be a team leader with AmeriCorps NCCC and was set on serving in Sacramento. Only days before I had to make my final decision, I learned about Jumpstart – an AmeriCorps State and National partner with a program at George Washington University. Something told me I should apply to serve in that program before I committed to NCCC. It turns out, that was a decision that would influence my life. It did not take long for me to feel like I had a home again. Jumpstart is a nonprofit organization focused on early childhood education, literacy, and social-emotional development with a vision to work toward the day every child in America enters kindergarten prepared to succeed. Though this vision aligned with my values and sense of purpose, my fellow AmeriCorps members and supervisor were among the main reasons I served four consecutive terms. In my first year, I served with Jumpstart at an elementary school in Washington, DC. I was incredibly nervous about entering this new community and working with preschoolers. I will never forget my first time tutoring. As our team leader went over our session plan, I found my mind already in the classroom. I wondered if the children would like me. And I wondered if I was even qualified. The closer we got to the school, the more nervous I became. When we finally arrived, the sound of children playing and laughing echoed throughout the halls. I don’t really know what I was expecting, but that sound immediately put my mind at ease. We walked to our assigned classroom, and about 15 pairs of little curious eyes looked up at us with great anticipation. A few of the children shouted, “Jumpstart!” It was not the first time they had seen Jumpstart members, and it seems we have always been well-received. I did not have faith in my abilities at first, but with my team leader's support and my supervisor's guidance, I succeeded as an AmeriCorps member. After that first year, I continued to grow and take on more responsibility. In my second year, I served as a team leader; in my third and fourth years, I served as a volunteer coordinator. My experience in Jumpstart was transformative and contributed to my personal and professional development in ways that a typical college experience could never. Because of my time at Jumpstart, I have a deeper understanding of civic engagement and a sense of civic responsibility that continues to guide my path in public service. My AmeriCorps service resulted in a paradigm shift for me and my life plan. After graduating from GWU, I did not apply to the Peace Corps. Instead, I accepted an offer to be the associate site manager of Jumpstart at my alma mater. I continued my journey with Jumpstart for three more years, helping other students get excited about community engagement and public service. After almost eight years with Jumpstart, I finally transitioned into my current role as a recruitment specialist in AmeriCorps headquarters where I get to help the agency set more people along the path of civic engagement. At the beginning of my journey, I felt lost, but my service helped me find my community. I can confidently say that AmeriCorps has, and continues to, transform and drive me. Perhaps one day I will serve abroad with the Peace Corps, but in the meantime, you can find me here getting things done with AmeriCorps. Previous Giving Time Adds Up Next Bridging National Service and Public Health: Apply for AmeriCorps Funding to Solve Urgent Public Health Needs Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-01-27/next-steps-americorps-alumnus-makes-career-out-serving-others",
    "https://americorps.gov/serve/fit-finder/americorps-nccc",
    "https://americorps.gov/partner/how-it-works/americorps-state-national",
    "https://www.jstart.org/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-01-27/next-steps-americorps-alumnus-makes-career-out-serving-others&amp;title=Next Steps: AmeriCorps Alumnus Makes Career Out of Serving Others ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-01-27/next-steps-americorps-alumnus-makes-career-out-serving-others&amp;title=Next Steps: AmeriCorps Alumnus Makes Career Out of Serving Others &amp;source=https://americorps.gov/blogs/2023-01-27/next-steps-americorps-alumnus-makes-career-out-serving-others",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-01-27/next-steps-americorps-alumnus-makes-career-out-serving-others&amp;url=https://americorps.gov/blogs/2023-01-27/next-steps-americorps-alumnus-makes-career-out-serving-others&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2022-11-22/giving-time-adds",
    "https://americorps.gov/blogs/2022-12-21/bridging-national-service-public-health-apply-americorps-funding-solve-urgent-0",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC; AmeriCorps State and National",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "01",
  "subdomain_3": "27"
}