{
  "id": "americorpsgov_blogs_2021_05_20_americorps_partners_mtv_entertainmenthtml",
  "url": "https://americorps.gov/blogs/2021-05-20/americorps-partners-mtv-entertainment",
  "title": "americorps-partners-mtv-entertainment",
  "content": "AmeriCorps Partners with MTV Entertainment | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps Partners with MTV Entertainment Submitted by pnolan on Wed, 05/19/2021 - 16:07 May 20, 2021 Mal Coles, Acting Chief Executive Officer Help Eliminate the Space Between Awareness & Action in Mental Healthcare As we have learned in the last year, an unprecedented challenge requires an out-of-the-box approach. That is why AmeriCorps has joined with MTV Entertainment and more than 1,000 partner organizations in the first-ever Mental Health Action Day on Thursday, May 20. Over the past two decades, suicide rates have risen, particularly among young adults. And the COVID-19 pandemic has accelerated the already dire crisis, giving way to what many mental health professionals have called the “second pandemic.” Though more people than ever are comfortable discussing mental health, finding effective resources and knowing how to get help remains a challenge. Mental Health Action Day is an open-source movement of brands, organizations, and cultural leaders to drive our society from mental health awareness to mental health action. Many people fall through the cracks in the space between awareness and action—particularly those who have been marginalized or underserved by existing institutions. I encourage the national service community—whether for themselves, for their loved ones or others—to share these resources far and wide in your networks and on your social channels. More information on mental health and resources are available from National Institute for Mental Health and Mental Health Action Day . Join with AmeriCorps, MTV, and hundreds of other organizations to spotlight the importance of prioritizing our mental health. I know our community knows how to #GetThingsDone. Sincerely, Mal Coles Acting Chief Executive Officer Previous Communities of Strength through Service Next From Disaster to National Model Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2021-05-20/americorps-partners-mtv-entertainment",
    "https://www.mentalhealthactionday.org/",
    "https://www.nimh.nih.gov/health/topics/caring-for-your-mental-health/?utm_source=NIMHwebsite&amp;utm_medium=Portal&amp;utm_campaign=shareNIMH",
    "https://www.mentalhealthactionday.org/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2021-05-20/americorps-partners-mtv-entertainment&amp;title=AmeriCorps Partners with MTV Entertainment",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2021-05-20/americorps-partners-mtv-entertainment&amp;title=AmeriCorps Partners with MTV Entertainment&amp;source=https://americorps.gov/blogs/2021-05-20/americorps-partners-mtv-entertainment",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2021-05-20/americorps-partners-mtv-entertainment&amp;url=https://americorps.gov/blogs/2021-05-20/americorps-partners-mtv-entertainment&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2021-05-19/communities-strength-through-service",
    "https://americorps.gov/blogs/2021-05-21/disaster-national-model",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2021",
  "subdomain_2": "05",
  "subdomain_3": "20"
}