{
  "id": "americorpsgov_blogs_2022_04_22_earth_day_future_filmmakers_start_americorpshtml",
  "url": "https://americorps.gov/blogs/2022-04-22/earth-day-future-filmmakers-start-americorps",
  "title": "earth-day-future-filmmakers-start-americorps",
  "content": "Earth Day: A future filmmaker’s start with AmeriCorps | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Earth Day: A future filmmaker’s start with AmeriCorps Submitted by rfrazier on Fri, 04/22/2022 - 11:21 Apr 22, 2022 Renée Holt Meadow Wheaton is an AmeriCorps member serving in the VISTA program with Nez Perce Tribe Wapaayatat Water Resources Climate Program in Idaho. During her service, Meadow created a short documentary about the love, protection, and continuation of the ancestral practice of gathering camas – one of the Nez Perce’s first foods which is still harvested annually. The documentary focuses on her family and Tribal ecological knowledge – traditional knowledge and, like Western science, based on the accumulation of generational observations. Meadow has been finalizing the documentary at Musselshell Meadows, part of the Clearwater National Forest in Idaho. As a part of her year-end service, Meadow presented her work on the importance of land stewardship as a Nez Perce tribal member to the program’s regional director Dylan Davids. She shared some details about how her experience has helped to shape her future. “It started snowing on us as my great-grandma and I dug roots on a hilltop. We laughed at the audacity as the skies changed to rain and hail, but still I was elated because the moment was special. That was the first time I had ever gathered [camas] roots. I was not a little girl then. It was 2021 and I was 24. Growing up, I wasn't taught the traditional ways, but through filmmaking I found an avenue of learning. As my final project for VISTA service, I decided to produce a short documentary about Musselshell Meadows. The camas there is being affected by climate change and human interference, and the climate change team agreed that what's happening in the meadow could be a learning opportunity about the loss of our traditional foods. Before I started the project, I was unsure if I’d be able to complete it due to the oversaturation of the field. But I was able to explore ideas and project opportunities with the climate change team. My supervisor and mentor, Stefanie Krantz, is the climate change coordinator for the Nez Perce Tribe. With her guidance and support, I was able to make this film and learn about climate change and how it's impacting my people's traditional homelands. It's been a long time coming, but my AmeriCorps experience and this project helped me realize how indigenous perspective is sorely needed in media and scientific communications. This lesson was the deciding factor for me to pursue a degree in broadcasting and digital media at the University of Idaho. I'll be starting Fall 2022. It’s my goal to be an advocate for our homelands through film.” From L to R from the Nez Perce Tribe Water Resources Climate Change team, AJ Whiteplume Two Moons, Meadow Wheaton, Thomas TallBull, and Stefani Krantz From an Indigenous perspective, Meadow’s film highlights how her community today continues to defend the land. The Nez Perce people are effectively working to bring change through increasing awareness of and protecting ancestral practices. Like many young adults who choose to serve with AmeriCorps programs, Meadow’s experience also helped her confirm her career path as a filmmaker—and will provide her financial support from the Eli Segal Education Award to help fund her degree. For more information on the Nez Perce Tribes Water Resources Climate Change program, email Meadow at MeadowW@nezperce.org. Renée Holt is the project director for Nez Perce Tribe Wapaayatat. She is a alumna of AmeriCorps, having served from 1997 to 1999 in Lapwai, Idaho. Previous Earth Day: Connecting People to Nature Next Month of the Military Child:  Service Takes Many Forms Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2022-04-22/earth-day-future-filmmakers-start-americorps",
    "https://americorps.gov/members-volunteers/segal-americorps-education-award",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2022-04-22/earth-day-future-filmmakers-start-americorps&amp;title=Earth Day: A future filmmaker’s start with AmeriCorps  ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2022-04-22/earth-day-future-filmmakers-start-americorps&amp;title=Earth Day: A future filmmaker’s start with AmeriCorps  &amp;source=https://americorps.gov/blogs/2022-04-22/earth-day-future-filmmakers-start-americorps",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2022-04-22/earth-day-future-filmmakers-start-americorps&amp;url=https://americorps.gov/blogs/2022-04-22/earth-day-future-filmmakers-start-americorps&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2022-04-21/earth-day-connecting-people-nature",
    "https://americorps.gov/blogs/2022-04-29/month-military-child-service-takes-many-forms",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2022",
  "subdomain_2": "04",
  "subdomain_3": "22"
}