{
  "id": "americorpsgov_blogs_2020_09_22_jessica_bulling_americorps_vista_using_her_passion_education_break_cycle_povertyhtml",
  "url": "https://americorps.gov/blogs/2020-09-22/jessica-bulling-americorps-vista-using-her-passion-education-break-cycle-poverty",
  "title": "jessica-bulling-americorps-vista-using-her-passion-education-break-cycle-poverty",
  "content": "Jessica Bulling: An AmeriCorps VISTA Using Her Passion for Education to Break the Cycle of Poverty | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Jessica Bulling: An AmeriCorps VISTA Using Her Passion for Education to Break the Cycle of Poverty Submitted by admin on Tue, 09/22/2020 - 16:53 Sep 22, 2020 Nicole Jackson Welcome to the Poverty + Racial Injustice Stories Project. Our nation is experiencing an awakening, and for some, an introduction to the injustices that Black people have been facing in this country for decades. We are dedicating this project to the stories of AmeriCorps VISTA members whose work goes beyond the VISTA mission to eradicate poverty. These stories will show how their work in tackling this mission intersects with combatting racial injustices in the communities they serve. Our hope is that 1. VISTA members will be seen and celebrated for their work, 2. The stories will provide a blueprint for others to follow, and 3. By sharing stories from areas including housing, literacy, and nutrition, readers will get a glimpse into just how far reaching the effects of racial injustice can be. Jessica Bulling Phenix City Housing Authority Position: Resource Development Coordinator Phenix City, Alabama September 2019 to June 2020 When Jessica Bulling went for an interview at the Phenix City Housing Authority (PCHA), she felt completely out of her comfort zone. She hadn’t worked in housing before, and it wasn’t her goal to become an AmeriCorps VISTA, but a relocation to Benning, Georgia had made it necessary for Jessica to look for a new job. She was drawn to the description of the role at Phenix City Housing Authority. Her belief that education is the key to unlocking the chains of poverty fit perfectly with the work of PCHA’s Resident Services team. Jessica is from Southern California. Serving in Phenix City, Alabama, a southern city with a population of 44% Black or African American , would be a new experience. But she knew that in order to be of service she needed to know the community and allow the community to know her. Months later, Jessica has gone from being anxious to being sad to leave the people she’s come to know so well. What are your responsibilities at Phenix City Housing Authority? My duties include community outreach, strengthening partnerships with local community organizations as well as capacity building. My general focus is supporting the Resident Services team. My work centers on anything that helps adults and seniors to be more independent. However, when COVID-19 hit, my work became more focused on food distribution. What is the goal of Phenix City Housing Authority and why were you drawn to it? The mission of Phenix City Housing and Neighborhood Development (PCHAND), which operates the majority of PCHA’s Resident Services programs, is to develop affordable housing for the betterment of the Phenix City Community. It also enables growth in self-sufficiency in families by providing educational and economic opportunities to break the cycle of poverty. I was drawn to this program because I believe that education plays an important role in breaking the cycle of poverty. I feel passionate about making education accessible to all, no matter their socioeconomic background. Please tell us about the demographics that you serve in this role: The community I serve is a low-income community of predominantly African American, single mothers. During my service, I learned that particularly in the south, poverty for this population is unfortunately a prevalent condition. I also served other ethnicities in my role including Caucasian and German American. I was even able to use my Spanish speaking skills with the Hispanic residents! How does your work combat poverty and racial inequality particularly in housing? I see the programs that Resident Services offers as the door to leave the housing program; a way to advance oneself. On one side you have safe shelter but on the other side there is a responsibility to empower residents. I believe that education and the learning opportunities that Resident Services provides will empower residents to leave public housing eventually. Resident Services is often the key to empowerment and combatting poverty. My role is to help with this mission. It’s something I believe in and am passionate about. I work to expand the senior, adult, and children’s programs. I accomplish this by building relationships with several educational institutions, including Troy University, Alabama Extension Program 4-H, and a local community college that offers a GED program. One of my goals is to facilitate access to the GED program and strengthen relationships with the community college. In addition to providing access to GED courses, Resident Services also strives to provide Family Self-Sufficiency workshops such as job training and budgeting. Why is this work important especially during this time? As a society we are currently under extreme social stress, but even the distribution of this stress is unequal respective to one’s socioeconomic status and even race or ethnicity. The physical barriers to providing everyone with education are even greater. I feel now, more than ever, the urgency to strengthen the bonds of community. This may be the most crucial way we can contribute to the progress of society. How has this project impacted you personally? When I look back at my year of service, I see how I underwent a transformation. In the beginning, I was anxious because, although I have traveled to different countries, I did not have experience working in a housing authority. Also, originally being from Southern California, I hadn’t spent any significant amount of time in Alabama. Yet, over the course of the year, I formed true friendships with the staff, residents, and members of community organizations. Some of my most fulfilling moments were when a child would light up upon receiving a brand new book, a coworker simply waving as they passed by, or that moment at the end of the day when you look at your supervisor and smile because you faced the challenges and gave it your all. There were many challenges, but my resolve to continue to promote education for all has strengthened, and I feel more sensitive to the needs of every person in my community. How has this impacted how you view this issue or your overall view regarding racial injustice? This experience has re-emphasized that every one’s story needs to be heard. Every one’s dream needs to be encouraged and fostered. Only through open conversation, teamwork, and actively making education relevant and accessible to all can we overcome one of America’s greatest challenges. Previous AmeriCorps VISTA Uses Power of Storytelling to Impact Lives Next A message from our CEO Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2020-09-22/jessica-bulling-americorps-vista-using-her-passion-education-break-cycle-poverty",
    "https://affordablehousingonline.com/housing-authority/Alabama/Phenix-City-Housing-Authority/AL005",
    "https://www.census.gov/quickfacts/fact/table/phenixcitycityalabama,AL/PST045219",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2020-09-22/jessica-bulling-americorps-vista-using-her-passion-education-break-cycle-poverty&amp;title=Jessica Bulling: An AmeriCorps VISTA Using Her Passion for Education to Break the Cycle of Poverty",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2020-09-22/jessica-bulling-americorps-vista-using-her-passion-education-break-cycle-poverty&amp;title=Jessica Bulling: An AmeriCorps VISTA Using Her Passion for Education to Break the Cycle of Poverty&amp;source=https://americorps.gov/blogs/2020-09-22/jessica-bulling-americorps-vista-using-her-passion-education-break-cycle-poverty",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2020-09-22/jessica-bulling-americorps-vista-using-her-passion-education-break-cycle-poverty&amp;url=https://americorps.gov/blogs/2020-09-22/jessica-bulling-americorps-vista-using-her-passion-education-break-cycle-poverty&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2020-09-14/americorps-vista-uses-power-storytelling-impact-lives",
    "https://americorps.gov/blogs/2020-09-29/message-our-ceo",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2020",
  "subdomain_2": "09",
  "subdomain_3": "22"
}