{
  "id": "americorpsgov_blogs_2023_03_24_americorps_members_volunteers_build_meaningful_relationships_help_students_succeedhtml",
  "url": "https://americorps.gov/blogs/2023-03-24/americorps-members-volunteers-build-meaningful-relationships-help-students-succeed",
  "title": "americorps-members-volunteers-build-meaningful-relationships-help-students-succeed",
  "content": "AmeriCorps Members and Volunteers Build Meaningful Relationships to Help Students Succeed | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps Members and Volunteers Build Meaningful Relationships to Help Students Succeed Submitted by dsong on Wed, 03/22/2023 - 10:09 Mar 24, 2023 Terra Wallin AmeriCorps expanded learning partnerships fellow Terra Wallin shares about the importance of AmeriCorps members and volunteers serving in schools. Evidence reinforces that positive connections between AmeriCorps members and AmeriCorps Seniors volunteers and P-12 students can provide academic, social, and emotional benefits. This National Reading Month, I had the opportunity to see how our members and AmeriCorps Seniors volunteers serving with schools in Texas help ensure students succeed in and out of the classroom. AmeriCorps Seniors volunteer in the Foster Grandparent Program Amid deeply concerning data capturing the negative impacts of the COVID-19 pandemic, social isolation, and social media on the mental health of young people – particularly girls and LGBTQI+ students – I’ve seen firsthand how AmeriCorps programs put caring, capable people in schools to support students’ social, emotional, and academic development. These programs recruit and support more than 36,000 AmeriCorps members and AmeriCorps Seniors volunteers across the country to build impactful relationships with students in more than 9,500 schools. While each program uses evidence to implement and expand support to meet their community’s unique needs, they share a common component – helping ensure each student has  a meaningful, caring relationship with one adult. Budding friendships In San Antonio, AmeriCorps members serving with City Year support 9th graders in math and English classrooms. Working in close partnership with teachers, these members monitor student behavior, reinforce classroom instructions and norms, model academic behavior, and provide one-on-one support students need. But AmeriCorps members’ service extends beyond direct classroom support. Many high school students are often willing to open up to AmeriCorps members, sharing their concerns and barriers that prevent them from reaching their highest potential. AmeriCorps members, in turn, work with school leaders to address schoolwide and individual challenges. This connection between those serving and those being served leads to increased student attendance and more time for learning. Graduate students pursuing degrees in social work serve with Communities in Schools to provide one-on-one and small group social emotional support to students that need it most. Through partnerships with their colleges and universities in and around San Antonio, Communities in Schools provides AmeriCorps members supervision from experts, a living stipend, and educational benefits, while providing high school students meaningful opportunities to build robust peer-to-peer and student-adult relationships in a safe and welcoming environment. AmeriCorps members serving with Communities in Schools AmeriCorps members like Dasjah Martinez support student success in higher education. Dasjah serves as a high school college advisor with the College Advising Corps based at the University of Texas in Austin. She helps more than 700 seniors at Del Valle High School identify post-secondary pathways, connect with local programs, submit college applications, and access scholarships and financial aid. She collaborates with school staff, nonprofit organizations, and a team of student leaders to ensure that all students have the resources they need and an opportunity to access a pathway that meets their aspirations. In her words, “All children deserve someone to believe in them.” And Desjah is modeling that belief in her work every day. AmeriCorps member Dasjah (left) with a college counselor at Del Valle High School in Austin Connecting generations In Manor's Manor Independent School District , AmeriCorps Seniors volunteers serving in the Foster Grandparent Program provide preschool students the opportunity to connect with older adults while they receive instruction in music, art, and STEM. These grandparents are beloved by educators for the consistent support they bring to the classroom. They’re even more loved by students who are eager to hug, interact, and receive help from their “grandmas” and “grandpas.” AmeriCorps Seniors volunteers serving with the Foster Grandparent Program in Manor Independent School District The President’s call to help get students back on track AmeriCorps has always been focused on providing the people power to support and meet communities’ needs.  We are proud to be a founding partner of the National Partnership for Student Success , a public-private partnership answering President Biden’s call for 250,000 additional caring, supported adults into schools by 2025 . This innovative partnership is helping more schools build similar models of support for their students. For more information on how you can leverage national service within your schools, check out this toolkit . You can also visit the National Partnership for Student Success for information about how to ensure additional caring adults are available in and out of schools to help educators and families address critical educational and mental health challenges exacerbated by the COVID-19 pandemic. Terra Wallin is an AmeriCorps alumna who served with Teach For America and is currently the expanded learning partnerships fellow at AmeriCorps. In this role, she manages AmeriCorps’ engagement in the National Partnership for Student Success and supports grantees and partners in implementing activities to support P-12 students. Previous Continue to Unite in Service: Choose AmeriCorps Next This National Public Health Week Explore Your Future with Public Health AmeriCorps Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-03-24/americorps-members-volunteers-build-meaningful-relationships-help-students-succeed",
    "https://gcc02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.chalkbeat.org%2F2023%2F2%2F13%2F23598156%2Fmental-health-cdc-girls-teenagers-high-school-pandemic-depression-anxiety&amp;data=05%7C01%7CTWallin%40cns.gov%7C93c97e65476c48e07c6c08db18da71ae%7Cd2f850a78dce4fb3a79c6867f9514312%7C0%7C0%7C638131098728082643%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&amp;sdata=o9mY0xYsnfmtThpNIvqC1T6vrZ%2BJByiHS3lqLdseiqE%3D&amp;reserved=0",
    "https://www.cityyear.org/san-antonio/",
    "https://www.cissa.org/",
    "https://advisingcorps.org/program/the-university-of-texas-at-austin/",
    "https://sites.google.com/dvisd.net/dvhsccc/home",
    "https://www.manorisd.net/Page/17",
    "https://americorps.gov/serve/americorps-seniors/americorps-seniors-foster-grandparent-program",
    "https://www.partnershipstudentsuccess.org/",
    "https://americorps.gov/newsroom/americorps-joins-white-house-department-education-launch-national-effort-support-student",
    "https://americorps.gov/sites/default/files/document/Leveraging-National-Service-in-Your-Schools.pdf",
    "https://www.getreadyset.org/npss",
    "https://www.partnershipstudentsuccess.org/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-03-24/americorps-members-volunteers-build-meaningful-relationships-help-students-succeed&amp;title=AmeriCorps Members and Volunteers Build Meaningful Relationships to Help Students Succeed ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-03-24/americorps-members-volunteers-build-meaningful-relationships-help-students-succeed&amp;title=AmeriCorps Members and Volunteers Build Meaningful Relationships to Help Students Succeed &amp;source=https://americorps.gov/blogs/2023-03-24/americorps-members-volunteers-build-meaningful-relationships-help-students-succeed",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-03-24/americorps-members-volunteers-build-meaningful-relationships-help-students-succeed&amp;url=https://americorps.gov/blogs/2023-03-24/americorps-members-volunteers-build-meaningful-relationships-help-students-succeed&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-03-22/continue-unite-service-choose-americorps",
    "https://americorps.gov/blogs/2023-04-05/national-public-health-week-explore-your-future-public-health-americorps",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors; Public Health AmeriCorps",
  "focus_population": [
    "Schools"
  ],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "03",
  "subdomain_3": "24"
}