{
  "id": "americorpsgov_blogs_2024_01_15_remembering_dr_king_through_servicehtml",
  "url": "https://americorps.gov/blogs/2024-01-15/remembering-dr-king-through-service",
  "title": "remembering-dr-king-through-service",
  "content": "Remembering Dr. King through Service | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Remembering Dr. King through Service Submitted by dsong on Sun, 01/14/2024 - 16:31 Jan 15, 2024 AmeriCorps Staff August 2023 marked the 60th anniversary of the March on Washington and Dr. King's historic \"I Have a Dream\" speech. His words still resonate today as a powerful symbol of his unwavering dedication to a fair and just society , urging all Americans to unite in pursuit of a shared vision of freedom and justice. Six decades later, we continue to honor and be inspired by Dr. King's legacy on MLK Day and every day , like our AmeriCorps Seniors volunteer Florence. AmeriCorps Seniors volunteer Florence Learning Peace from Dr. King AmeriCorps Seniors volunteer Florence marched alongside Dr. Martin Luther King, Jr., during the civil rights movement. Florence was living in Phoenix, Ariz., with her airman husband. Like her experience growing up in Illinois, Florence faced discrimination in Phoenix, which motivated her to join the movement. More than 50 years later, Florence continues to remember and honor Dr. King by serving her community as a F oster G randparent in Illinois. “Martin had a powerful voice. He was a short, dark-skinned Black man, but he had a voice that would project anywhere. When I first met Dr. Martin Luther King, Jr., I was ready to fight. But the first thing he said when we got there to march from Selma to Montgomery, Ala. , was, ‘If you want to fight, go home because we’re not fighting. This is going to be a peaceful demonstration.’ And he talked us into being peaceful, which I carry with me today. Grandma Flo (far left) during the march “You just don’t understand how it is when you’re in a situation like that. I was discriminated against, but never to that extent in Alabama. That was a horrible feeling to be discriminated against with dogs turned on you to bite you and police there with guns saying, ‘You can’t do this, you can’t do that.’ I never had that much power against me. We marched for as long as we could and spent nights out in the area, encountering planes flying overhead and bombs. There were a lot of times we were ready to give up, but Martin kept us going until that fateful day at the motel. “We weren’t supposed to stay at that motel in Memphis, Tennessee . We went down to help bring the sanitation workers union into effect. We were scheduled to stay at the hotel, but when we got there, they said we couldn’t stay. We had to stay at the motel. They told Martin not to go out on the balcony, but he had to speak to his constituents. He had been out there about five minutes when he was shot. I was in another room at the motel and came running to see if we could do anything, but there wasn’t . Everybody wanted to fight at that moment , but we couldn’t . We needed to go by Martin’s wishes – be peaceful.” Committing to a Life of Service Grandma Flo has since dedicated her time to service. She joined ABC AmeriCorps at Sauk Valley Community College, serving in local schools, and then she continued to work in her community. S he faced challenges again but found solace through service. They’re talkative in second grade, but they’re great to work with and willing to learn , and that’s the best part about it. Grandma Flo at her service site in Illinois “My husband left me; I was alone, just sitting at home, thinking of something I needed to do. I saw an opportunity to serve again as an older adult at ABC AmeriCorps, so I joined again to serve my community. Joining AmeriCorps Seniors is the best thing I have ever done because working with children gives me the incentive to keep going . The incentive to get up in the morning, come to school, and work with them. It’s very rewarding , and you can learn from children. Children can teach you some things that maybe you’ve forgotten. “I don’t tell my students or others that I marched with Martin Luther King, Jr., unless someone asks because people don’t remember. But MLK Day of Service means everything. They celebrate the day, and it’s a national holiday, but many people have forgotten Martin Luther King , Jr . The Day of Service is an opportunity to honor him. More people should know what it was all about and how it affected everybody’s lives. They should never forget that.” Commit to Building the Beloved Community Like Grandma Flo, many AmeriCorps members, AmeriCorps Seniors volunteers, and alums have found their purpose through remembering Dr. King. Whether it’s to relive the memory of marching alongside Dr. King or honor his legacy, AmeriCorps has been committed to joining together in service to unify Americans of different backgrounds and experiences to transform unjust systems . Commit to serve and create ripples that make a world of difference. Join the thousands of Americans from all walks of life who will participate in service projects to honor Dr. King’s legacy. Through service , together, we are one step closer to the Beloved Community of Dr. King’s dream. Previous Five Things to Know About Public Service Loan Forgiveness Next MLK Day 2024: Thank You for Building the Beloved Community Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2024-01-15/remembering-dr-king-through-service",
    "http://americorps.gov/mlkday",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2024-01-15/remembering-dr-king-through-service&amp;title=Remembering Dr. King through Service",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2024-01-15/remembering-dr-king-through-service&amp;title=Remembering Dr. King through Service&amp;source=https://americorps.gov/blogs/2024-01-15/remembering-dr-king-through-service",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2024-01-15/remembering-dr-king-through-service&amp;url=https://americorps.gov/blogs/2024-01-15/remembering-dr-king-through-service&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2024-01-12/five-things-know-about-public-service-loan-forgiveness",
    "https://americorps.gov/blogs/2024-01-18/mlk-day-2024-thank-you-building-beloved-community",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2024",
  "subdomain_2": "01",
  "subdomain_3": "15"
}