{
  "id": "americorpsgov_blogs_2023_02_15_fight_hunger_during_national_canned_food_monthhtml",
  "url": "https://americorps.gov/blogs/2023-02-15/fight-hunger-during-national-canned-food-month",
  "title": "fight-hunger-during-national-canned-food-month",
  "content": "Fight Hunger During National Canned Food Month | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Fight Hunger During National Canned Food Month Submitted by dsong on Tue, 02/14/2023 - 12:51 Feb 15, 2023 AmeriCorps Staff Canned foods have been an important part of American nutrition over the last century. Though the start of canned goods is dated back to Napoleon-era France, canned foods sustained Americans during the World Wars, Great Depression, and cold winters when fresh crops were scarce. In honor of National Canned Food Month this February, we learn why it continues to be a grocery staple for many. Food for everyone – families, college students, older adults, and military service members Canned foods are easy to prepare and store, can be consumed by nearly everyone, and provide affordable nutrition. Busy parents can feed their children easily by heating canned vegetables. College students who miss home cooking can prepare a meal, even in their dorms. Older adults who live independently can cook smaller portions. Military service members on duty can have a healthy meal wherever they’re stationed. Canned foods can be stocked for any emergency, such as cold winters when crops are scarce or during disaster seasons like hurricanes when access to a grocery store might be limited. Canned foods are also crucial to food security efforts in national service. They help us support healthy futures for Americans and take us one step closer to ending hunger. Filling meal kits for full stomachs Canned goods are a must for food banks, non-profits, faith-based, and community organizations.  They make a difference in communities, whether it’s for the homeless, struggling families, or children in need. Members and volunteers in AmeriCorps NCCC, VISTA, and AmeriCorps Seniors programs join these organizations in their efforts to address food security. They serve at locations to assemble meal kits or help recruit more volunteers or organize food drop-offs for people to donate. In Ohio, the Greater Cleveland Food Bank, an organization that fights to end hunger in the city, has seen a surge in communities since the COVID-19 pandemic. AmeriCorps NCCC teams stepped in to help the food bank, supporting where the need was greatest. Their service included more than prepping meals – they supported the projects that addressed the communities’ unique needs, like distribution and donated food repacking projects. AmeriCorps VISTA has more than 7,000 members who serve to alleviate poverty, supporting organizations to make sustainable change in areas like food security. Every day, our members in the VISTA program positively impact those they serve, like with Community Food Bank of Eastern Oklahoma, a program that addresses food security in the state. AmeriCorps members serve full-time or during the summer to help expand the organization’s program capacity, assist with assembling meals, congregate meal sites, and coordinate deliveries. AmeriCorps members helping assemble meal packages Canned foods are also an important ingredient during National Days of Service. On Martin Luther King, Jr. Day of Service 2023 , AmeriCorps Seniors volunteers served at Miriam’s Kitchen, a DC-based nonprofit organization, with US Secretary of Energy Jennifer M. Granholm. Together, they packed more than 150 community members in need. AmeriCorps Seniors volunteers and Secretary Granholm preparing meal kits Fight hunger with us Though National Canned Food month will end soon, it will still be important throughout the year. AmeriCorps members, volunteers, and grantees will continue to add this ingredient during their service to help fight to end hunger across the nation while providing people power in needed programs, offering food security resources to areas most in need, and building food security systems that are sustainable. Learn more about becoming a member of AmeriCorps programs to join our journey to healthy futures for all Americans. Previous MLK Day 2023: Coast to Coast, Americans Stepped up in honor of Dr. Martin Luther King, Jr. Next Black Voices of Service Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-02-15/fight-hunger-during-national-canned-food-month",
    "https://www.greaterclevelandfoodbank.org/",
    "https://www.okfoodbank.org/",
    "https://americorps.gov/newsroom/icymi-americorps-leads-biden-administration-americans-volunteer-efforts-martin-luther-king",
    "https://www.miriamskitchen.org/",
    "http://americorps.gov/serve",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-02-15/fight-hunger-during-national-canned-food-month&amp;title=Fight Hunger During National Canned Food Month",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-02-15/fight-hunger-during-national-canned-food-month&amp;title=Fight Hunger During National Canned Food Month&amp;source=https://americorps.gov/blogs/2023-02-15/fight-hunger-during-national-canned-food-month",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-02-15/fight-hunger-during-national-canned-food-month&amp;url=https://americorps.gov/blogs/2023-02-15/fight-hunger-during-national-canned-food-month&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-01-20/mlk-day-2023-coast-coast-americans-stepped-honor-dr-martin-luther-king-jr",
    "https://americorps.gov/blogs/2023-02-23/black-voices-service",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC; AmeriCorps VISTA; AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "02",
  "subdomain_3": "15"
}