{
  "id": "americorpsgov_blogs_2022_01_13_heres_whats_happening_mlk_day_around_countryhtml",
  "url": "https://americorps.gov/blogs/2022-01-13/heres-whats-happening-mlk-day-around-country",
  "title": "heres-whats-happening-mlk-day-around-country",
  "content": "Here’s what’s happening this MLK Day around the country | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Here’s what’s happening this MLK Day around the country Submitted by mbrodbeck on Thu, 01/13/2022 - 12:32 Jan 13, 2022 AmeriCorps staff Take action: Volunteer on Monday, Jan. 17 People across the country are stepping up to make our communities more equitable and take action to build the Beloved Community of Dr. King’s dream. The MLK Day of Service is a defining moment each year and this year is no different. The 2022 MLK Day of Service is just five days away. Check out how people are stepping up this Monday, Jan. 17. 1. In Philadelphia, Ya Fav Trashman hosts Martin Luther King day of service clean up. Terrill Haigler, also known as “Ya Fav Trashman,” will host an MLK Day Clean Up on Monday from 10 a.m. to 2 p.m. in the 19120 ZIP code. He will announce the exact address Friday. The event goes beyond cleaning up the area, he said. A team will provide 200 boxes of groceries to community residents and coats will be given out to anyone who needs them. Haigler said he plans to host two community cleanups on the first and third Saturday of every month throughout 2022. Read more in The Philadelphia Tribune . 2. In New Jersey literacy training is offered on MLK Day. Gateway Community Action Partnership’s Literacy Services Department will conduct two online Literacy Volunteers tutor training sessions. Trained tutors will work one-on-one with adult learners who need help reading, writing or speaking English. Tutors generally meet with learners one to two hours per week either in person or online and will be trained in English as a Second Language and basic literacy. Read more in the Daily Journal . 3. In Milwaukee, Wis., families with small children are making a difference. Kids Impact Community is a nonprofit that organizes volunteer opportunities for families with small children. This year, they will host virtual story times, interspersed with art projects, exercise breaks and kid-friendly discussions about race, racism and Martin Luther King Jr.'s legacy. “That educational piece is really important,” said Lynn Raines, co-founder and executive director of Kids Impact Community. “Racism, food insecurity, homelessness, poverty, these are really big topics for kids to understand, so we try to have activities and share tools to have age-appropriate conversations.” Read more in Milwaukee Journal Sentinel . 4. In South Dakota, another service opportunity for kids through Feeding South Dakota. For the first year, Feeding South Dakota is hosting a day-long event on MLK Day called “Bring Your Child to Serve Day.” It gives kids 11 years or older and their parents or guardians a chance to participate in sorting and packaging food for people in need across the state. While all of the volunteer spots are full in Sioux Falls, help is still needed in Pierre and Rapid City. More details with KELO . 5. In Ohio, Bowling Green State University will host a Brown Bag food drive. Bowling Green State University will host its 14th annual Martin Luther King Jr. Day of Service on Monday from 10 a.m.-4 p.m. on campus and in the city. Suggested donated items are nonperishable food items, hygiene and personal care items, diapers and pet food. Donations will benefit multiple food pantries in Bowling Green and Wood County. Read more in the Sentinel-Tribune . 6. In Connecticut, new community vegetable garden hopes to connect seniors, students in Monroe. A joint effort among community leaders and organizations will connect generations, as well as tackle food disparity in the area. The City of Monroe, University of Louisiana at Monroe, Louisiana Delta Community College and Ochsner LSU Health Monroe have partnered to establish the Ester Gallow Community Garden. Read more in the News Star . 7. In West Virginia, Coats4Kids Drive hopes to collect 1,000 winter clothing items for West Virginians in need. They are collecting new or gently used coats, hats, scarves, sweatshirts, and gloves. People can add “extra love in [their] donation” by including a note in the pocket of each coat. “Through the Coats4Kids drive, we answer Dr. King’s call to serve. We ask you to join us in making a difference in the lives of West Virginia residents by helping our children stay safe and warm this winter,” said Dr. Amelia Courts, the President/CEO of The Education Alliance. Read more in wowktv.com . 8. In Memphis, they are building and maintaining local gardens and cleaning up communities. This year people will have several options to care for their neighbors and the Earth. Volunteer Memphis has partnered with GrowMemphis and Memphis Tilth, which aims to build and maintain local gardens. There are also several community cleanup events and health and wellness days. Read more on Action News 5 . 9. In Kentucky, a food drive will help local families. The drive comes on the heels of an effort to collect items for victims of destructive tornados that hit western Kentucky on Dec. 10. Read more in the Bucyrus Telegraph-Forum . 10. In Utah, Davis County to host much needed blood drive on MLK Day. Davis County AmeriCorps Seniors RSVP is hosting the drive, and Jackie Smith, the RSVP project manager of Davis County has said, “Today we answer Dr. King’s call to serve and are making a difference in the lives of Davis County residents, a resourceful way to meet local needs, volunteer service is a powerful tool that builds strong communities. We are putting the core American principles of citizenship and service into action.” Read more on ABC4 . Note: Communities around the country are facing a national blood crisis. Doctors are having to make tough choices about who receives transfusions and who has to wait. You can help by making an appointment with the Red Cross or your local blood bank. You also can help with these three other ways: Host a blood drive. Recruit friends to donate. Volunteer at a blood drive. This is just a small sample of what is happening across the country. Making time to volunteer for MLK Day of Service is a great way to engage with your community while honoring the legacy of Dr. King. Whether you plan on cleaning up a public space, mentoring a young person, or assisting those who are food insecure, what you do makes a world of difference. Want to volunteer or organize others to do the same? Use our search tool to find a project near you. Check out our additional resources created in partnership with our friends at the King Center to spur ideas of what you can do to honor this day of action, in person or virtually. Find a volunteer opportunity Explore MLK Day resources Thousands of Americans will join together to honor Dr. King, and his legacy, on Monday, Jan. 17. You are invited to join us in tackling the “fierce urgency of now.” Previous Take action and commit to serve this MLK Day Next New AmeriCorps CEO Honors Dr. King with President Biden, Bernice King, Ph.D., and AmeriCorps Members Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2022-01-13/heres-whats-happening-mlk-day-around-country",
    "https://www.americorps.gov/newsroom/events/mlk-day",
    "https://www.phillytrib.com/news/ya-fav-trashman-hosts-martin-luther-king-day-of-service-clean-up/article_bb52a3d5-530b-5875-8d98-1ca7a9911c4f.html",
    "https://www.thedailyjournal.com/story/news/2022/01/12/celebrate-martin-luther-king-jr-s-birthday-literacy-training-offered/9162279002/",
    "https://www.jsonline.com/story/life/wisconsin-family/2022/01/12/kids-impact-community-service-projects-martin-luther-king-day/9103244002/",
    "https://www.keloland.com/news/local-news/feeding-south-dakota-creates-community-service-opportunity-for-kids/",
    "https://www.sent-trib.com/news/brown-bag-food-drive-bgsu-service-honor-mlk/article_11c38a96-722c-11ec-aa62-bf602dc4b58d.html",
    "https://www.thenewsstar.com/story/news/2022/01/05/local-universities-hospital-and-city-monroe-establishes-community-garden/9029913002/",
    "https://www.wowktv.com/news/west-virginia/coats4kids-drive-hopes-to-collect-1000-winter-clothing-items-for-west-virginians-in-need/",
    "https://www.actionnews5.com/2022/01/07/volunteers-needed-mlk-days-service/",
    "https://www.bucyrustelegraphforum.com/story/news/2022/01/05/second-mlk-day-food-drive-benefit-three-crawford-county-charities/9079868002/",
    "https://www.abc4.com/news/local-news/davis-county-to-host-much-needed-blood-drive-on-mlk-day/",
    "https://t.co/4JVikYXKuP",
    "https://www.americorps.gov/join/find-volunteer-opportunity#/",
    "https://www.americorps.gov/newsroom/events/mlk-day/mlk-day-resources",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2022-01-13/heres-whats-happening-mlk-day-around-country&amp;title=Here’s what’s happening this MLK Day around the country",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2022-01-13/heres-whats-happening-mlk-day-around-country&amp;title=Here’s what’s happening this MLK Day around the country&amp;source=https://americorps.gov/blogs/2022-01-13/heres-whats-happening-mlk-day-around-country",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2022-01-13/heres-whats-happening-mlk-day-around-country&amp;url=https://americorps.gov/blogs/2022-01-13/heres-whats-happening-mlk-day-around-country&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2022-01-10/take-action-commit-serve-mlk-day",
    "https://americorps.gov/blogs/2022-01-17/new-americorps-ceo-honors-dr-king-president-biden-bernice-king-phd-americorps",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2022",
  "subdomain_2": "01",
  "subdomain_3": "13"
}