{
  "id": "americorpsgov_blogs_2022_11_18_americorps_uniter_every_child_deserves_lovehtml",
  "url": "https://americorps.gov/blogs/2022-11-18/americorps-uniter-every-child-deserves-love",
  "title": "americorps-uniter-every-child-deserves-love",
  "content": "AmeriCorps Uniter: Every Child Deserves Love | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps Uniter: Every Child Deserves Love Submitted by dsong on Thu, 11/17/2022 - 11:33 Nov 18, 2022 JC Williams JC endured racism most of his early life. Today, he volunteers in the AmeriCorps Seniors Foster Grandparent program to help other children navigate life’s challenges. I was an orphan at the age of five when my mom passed. I was a Black child, living with my grandmother, learning to navigate the world that seemed against me because of my skin color. Everything was segregated – my schools, anywhere I went for work, and even places I wanted to visit. When I got a job at a gas station in my 20s, my boss told me to go to the back where people couldn’t see me. I got jobs done, but I was to stay hidden, away from people. My childhood and early life are just that. Pain and humiliation. But it gave me a life purpose – I refused to see anyone else live through life like mine. Grandpa JC as a child and young adult Today, I’m a proud 93-year-old AmeriCorps Seniors Foster Grandparent. I joined with the belief that every child deserves a chance for a better life. I understood what a difficult childhood was like. Some kids are from nothing, and we'll lose them if you don’t win them. For over 20 years, I did just that. I started my Foster Grandparent volunteer service at the Fresno County Juvenile Hall to help kids find their purpose. I volunteered at the Fresno Economic Opportunities Commission’s Sanctuary Youth Shelter to encourage runaway youths to leave the streets and finish their education, no matter what. I wanted to help these young adults find their safe place and make something of themselves. I’ll never forget the day when one of the boys came up to me at the Fresno Fair to say, “Grandpa, remember me? I’m doing good now.” Grandpa JC at Zimmerman Boys & Girls Club I’m told I helped more than 100 kids since my service. But the figure is not what’s important to me. There are still kids in our country who need support, who don’t know their value. Everybody deserves to be loved no matter where they come from. It’s what I tell my foster grandchildren at my Boys & Girls Club – you’ve got to love yourself because that’s the best thing you can do for yourself. About Zimmerman Boys & Girls Club For 72 years, the Boys & Girls Clubs of Fresno County has been serving youth and their families. Over 4,000 children and teens call their club a second home. The club’s mission is to enable young people, to reach their full potential as productive, caring, responsible citizens. AmeriCorps members and AmeriCorps Seniors volunteers serve at Boys & Girls Clubs across the nation to work with disadvantaged youth and implement high-impact, evidence-based programs during out-of-school time; provide mentoring, support networks, and specialized activities for targeted youth; and recruit additional volunteers to help support the program. JC Williams grew up and lived in Arkansas until the 70s when he moved to California. Throughout his life, he worked as a chef, at a bowling alley, at a gas station, the railroad, and has owned a janitorial service. JC has been an AmeriCorps Seniors volunteer since 1997. He is currently serving as Foster Grandparent at Zimmerman Boys & Girls Club with his daughter Geneva. Previous Giving Back to the Veteran Community Next Giving Time Adds Up Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2022-11-18/americorps-uniter-every-child-deserves-love",
    "https://fresnoeoc.org/sanctuary-youth-shelter/",
    "https://www.bgcfresno.org/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2022-11-18/americorps-uniter-every-child-deserves-love&amp;title=AmeriCorps Uniter: Every Child Deserves Love ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2022-11-18/americorps-uniter-every-child-deserves-love&amp;title=AmeriCorps Uniter: Every Child Deserves Love &amp;source=https://americorps.gov/blogs/2022-11-18/americorps-uniter-every-child-deserves-love",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2022-11-18/americorps-uniter-every-child-deserves-love&amp;url=https://americorps.gov/blogs/2022-11-18/americorps-uniter-every-child-deserves-love&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2022-11-10/giving-back-veteran-community",
    "https://americorps.gov/blogs/2022-11-22/giving-time-adds",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2022",
  "subdomain_2": "11",
  "subdomain_3": "18"
}