{
  "id": "americorpsgov_about_agency_overview_civil_rightshtml",
  "url": "https://americorps.gov/about/agency-overview/civil-rights",
  "title": "civil-rights",
  "content": "Civil Rights for Employees, Service Members, and Volunteers | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb About Agency Overview Civil Rights for Employees, Service Members, and Volunteers Agency Overview Agency-Wide Policies and Notices AmeriCorps Fraud Alert AmeriCorps’ Equity Action Plan Budget and Performance Plans Civil Rights for Employees, Service Members, and Volunteers Digital Strategy Disability and Accessibility Federal Register Notices FOIA and the Privacy Act No FEAR Act Open Government Plain Writing Privacy Policy Results of Grant Competitions Statutes and Regulations Strategic Plan Vulnerability Disclosure Policy AmeriCorps is committed to providing equal employment opportunities to its employees and upholding the anti-discrimination laws which are applicable to the workforce and volunteers. The Agency strives for work and service environments which are free from discrimination and harassment for employees, service members and volunteers. Grant Program Non-Harassment and Civil Rights Policy AmeriCorps has zero tolerance for unlawful harassment of any individual or group of individuals engaged in national service. AmeriCorps is committed to treating all persons with dignity and respect. Our agency prohibits all forms of discrimination and harassment based on race, color, national origin, gender, age (40 and over), religion, sexual orientation, disability (mental or physical) , gender identity or expression, political affiliation, marital or parental status, pregnancy, reprisal, genetic information (including family medical history), or military service. All programs administered by or receiving federal financial assistance from AmeriCorps must be free from all forms of discrimination and harassment. Read the full policy statement: Grant Program Non-Harassment and Civil Rights Policy Equal Employment Opportunity and Non-Harassment Policies for Employees Civil Rights and Workforce Diversity AmeriCorps is committed to achieving a diverse, energized, high-performing workforce. The key to achieving this objective is developing and maintaining effective leaders, managers, and employees who treat all persons with dignity and respect regardless of race, color, national origin, gender, age, religion, sexual orientation, disability, gender identity or expression, political affiliation, marital or parental status, pregnancy, reprisal, genetic information, or military service. This policy covers all personnel programs, management practices, and decisions. This includes, but is not limited to, recruitment, hiring, merit promotions, transfers, reassignments, training, career development, benefits, and separations. We strive to provide a work environment free of discrimination and harassment, providing all employees the freedom to compete on a fair and level playing field. Read the full policy statement: Civil Rights and Workforce Diversity Policy Statement Employee Civil Rights and Non-Harassment Policy AmeriCorps will not tolerate any harassment that may include slurs and other verbal or physical conduct that relates to an individual’s gender, race, ethnicity, religion, sexual orientation, or any other legally-protected status when such behavior has the purpose or effect of interfering with job performance or creating an intimidating, hostile, or offensive work environment. Examples of harassing conduct include, but are not limited to: explicit or implicit demands for sexual favors; pressure to engage in a romantic relationship or for dates; deliberate touching of another person without consent, leaning over or cornering a person; repeated offensive teasing, jokes, remarks, or questions; unwanted letters, emails, or phone calls; distribution or display of offensive materials; offensive looks or gestures based on a person’s gender, race, ethnicity, or religious baiting; physical assault or other threatening behavior; and demeaning, debasing, or abusive comments or other actions that intimidate and are based on a person’s protected status. Read the full policy statement: Employee Civil Rights and Non-Harassment Policy Statement Employees may also refer to AmeriCorps’ Anti-Harassment Policy and Procedure (2020) for more information. Service members, volunteers, employees, and applicants for Federal employment who wish to file a discrimination complaint may do so by sending an email message to eo@americorps.gov or by leaving a voice message on the Civil Rights Hotline at 1-202-606-3461 . Calls to the hotline will be returned within 24 hours. For more information regarding the discrimination complaint process, employees, service members, and volunteers may contact eo@americorps.gov . Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/about/agency-overview/civil-rights",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/AmeriCorps-Program-Civil-Rights-and-Non-Harassment-2023-11-14-508.pdf",
    "https://americorps.gov/sites/default/files/document/AmeriCorps-Civil-Rights-Workforce-Diversity-Policy-2023-11-14-508.pdf",
    "https://americorps.gov/sites/default/files/document/AmeriCorps-Employee-Civil-Rights-Non-Harassment-Policy-2023-11-14-508.pdf",
    "https://americorps.gov/sites/default/files/document/CNCS-Anti-Harassment-Policy-Procedure.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "about",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "about",
  "subdomain_1": "agency-overview"
}