{
  "id": "americorpsgov_blogs_2024_02_09_tale_two_generationshtml",
  "url": "https://americorps.gov/blogs/2024-02-09/tale-two-generations",
  "title": "tale-two-generations",
  "content": "A Tale of Two Generations | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb A Tale of Two Generations Submitted by rfrazier on Fri, 02/09/2024 - 12:39 Feb 09, 2024 Shirley Aldana AmeriCorps service creates economic opportunity for a mother and daughter. In the rich tapestry of life, stories often unfold in unexpected and awe-inspiring ways. One such story begins with a courageous journey from Guatemala to the United States in 1978 when I was just eleven years old. As I stepped onto American soil, I carried dreams and aspirations as vast as the Texas horizon. Years later, as college beckoned my classmates, I found myself quietly shying away from grand plans, hindered by the stark reality of my legal status and limited resources. My future was uncertain. Instead, life led me down a different path, one that saw me becoming a wife and a mother to three beautiful children. In the hearts of my little ones, I saw natural talents waiting to flourish — be it in art, music, singing, or acting. My hopes for them soared high, but life, with its capricious turns, had other ideas. Our family faced hardships, and the challenges began to grow insurmountable. It was during my eldest, Madison's senior year in high school when the storm peaked. Painful issues strained our family bonds, but Madison was on track to secure a sports scholarship. Instead, she left home, leaving her dreams of high school graduation behind. But life's narrative isn't confined to a single chapter. In the midst of life's storms, there is often a silver lining. We discovered AmeriCorps, and when we shared this opportunity with Madison, her eyes sparkled with newfound hope. She decided to apply and embarked on a journey with AmeriCorps NCCC in 2007. Through dedication and hard work, she not only graduated from the program but also achieved her GED, setting her on a path of transformation. Shirley (left) and her daughter, Madison (right). As her story was being rewritten, so was mine. In the same year Madison graduated from AmeriCorps NCCC, I finally became a permanent US resident, and the doors to the University of Southern California creaked open for me as a student in cultural anthropology. My dreams of higher education were within reach. But, as life would have it, financial challenges forced me to relinquish my academic pursuit. I found myself at a career crossroads, and that's when Madison, now a beacon of inspiration, encouraged me to explore opportunities with AmeriCorps. I embraced the chance for change and began my AmeriCorps journey in Austin, Texas, in July 2015. My year of service opened my eyes to new horizons, rekindling the flames of my educational aspirations. In 2016, I achieved my dream of completing my undergraduate degree with help from the Segal Education Award that I received after completing my year of service. Inspired by the profound impact of AmeriCorps, I embarked on a journey that led me to attain a Master of Social Work in 2019. I am now on track to obtain my Doctor of Philosophy in industrial and organization psychology at Adler University, where I received a 50 percent tuition scholarship through AmeriCorps’ Schools of National Service initiative . AmeriCorps has been a constant source of inspiration for both Madison and me, propelling us to pursue our dreams against all odds. Today, Madison, a true embodiment of resilience, volunteers yearly at burn survivors' summer camps and works as a surgical technician at Harbor UCLA Hospital. Like me, she used part of the Segal Education Award that she received after service, which helped her  earn a license in emergency services and launched her into a career that she is passionate about. She has become a role model for her own children, illustrating the boundless possibilities that arise from determination and perseverance. As for me, I am currently concluding my second AmeriCorps VISTA service as the City of Austin AmeriCorps VISTA leader, a testament to the remarkable journeys AmeriCorps can inspire. Shirley (Right) during her AmeriCorps VISTA service. In this tale of two generations, AmeriCorps has played a pivotal role, proving that dreams can flourish, resilience can overcome adversity, and aspirations can be achieved even when life's path takes an unexpected turn. Our story is a testament to the incredible transformations that can occur when hope, dedication, and AmeriCorps unite. Let our journey serve as a beacon of inspiration, lighting the way for others seeking their own paths of accomplishment, dreams, and endless possibilities. Previous Celebrate 30 Years of AmeriCorps Throughout 2024 Next Finding Lifelong Relationships Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2024-02-09/tale-two-generations",
    "https://americorps.gov/serve/americorps/americorps-nccc",
    "https://americorps.gov/members-volunteers/segal-americorps-education-award",
    "https://americorps.gov/partner/partnerships/schools-national-service",
    "https://americorps.gov/serve/americorps/americorps-vista",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2024-02-09/tale-two-generations&amp;title=A Tale of Two Generations",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2024-02-09/tale-two-generations&amp;title=A Tale of Two Generations&amp;source=https://americorps.gov/blogs/2024-02-09/tale-two-generations",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2024-02-09/tale-two-generations&amp;url=https://americorps.gov/blogs/2024-02-09/tale-two-generations&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2024-01-31/celebrate-30-years-americorps-throughout-2024",
    "https://americorps.gov/blogs/2024-02-14/finding-lifelong-relationships",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC; AmeriCorps VISTA",
  "focus_population": [
    "Schools"
  ],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2024",
  "subdomain_2": "02",
  "subdomain_3": "09"
}