{
  "id": "americorpsgov_blogs_2022_05_17_three_tips_improve_your_health_mental_health_action_dayhtml",
  "url": "https://americorps.gov/blogs/2022-05-17/three-tips-improve-your-health-mental-health-action-day",
  "title": "three-tips-improve-your-health-mental-health-action-day",
  "content": "Three Tips to Improve Your Health This Mental Health Action Day | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Three Tips to Improve Your Health This Mental Health Action Day Submitted by dsong on Tue, 05/17/2022 - 16:47 May 17, 2022 AmeriCorps staff Mental Health Awareness Month is an observance – since 1949 – for Americans to prioritize their emotional, social, and psychological well-being. During this time, AmeriCorps joins the National Alliance on Mental Illness and thousands of others to provide resources for Americans to take charge of their well-being. AmeriCorps is proud to again partner with MTV for its second annual Mental Health Action Day on Thursday, May 19. Mental Health Action Day is an open-source movement of brands, organizations, and cultural leaders to drive our society from mental health awareness to mental health action. The day is reserved to motivate people to prioritize mental health as much as their physical health, and to encourage the public to discuss mental health more openly. Mental health has been an important topic since the pandemic started. Isolation, social distancing, and lockdowns affected our way of life. These led to increased anxiety and stress levels. But, you can still keep your mental health in check in numerous ways. Here are three tips to help take care of your and others’ mental well-being. Tip 1 – Become one with the environment Spend time in nature. People who spend more time outdoors have shown lower stress levels, cognitive fatigue, and cardiovascular problems . Plus, being surrounded by greenery also improves productivity. There are multiple ways to spend more time in nature: Trail and beach walking. Hiking. Forest bathing. Gardening. Park strolls. Or you can combine these activities for both your physical and mental health while doing good for the environment at the same time. AmeriCorps members serving with Washington Conservation Corps Take for example the Washington Conservation Corps . AmeriCorps members who serve the organization help: remove beach debris and structures that damage shoreline habitat along the coast; restore marine habitats; plant and preserve native trees and shrubs; build and maintain trails; and construct bridges and boardwalks. These activities provide people with a chance to connect to nature and take a much-needed break for their brain. Some AmeriCorps members shared that joining a conservation corps helped them with depression and find a new purpose . AmeriCorps members also played a large role in protecting the state’s environment from climate change. Within a year, Washington Conservation Corps planted more than half a million trees, treated more than 600 miles of trail, and increased native tree restorations by 9.6 percent. So, the next time you’re in need of some inner peace, consider taking up the work of conservation corps. Bask in nature while helping it, too. Tip 2 – Befriend a new community member For many of us, social distancing over the past two years put a strain on our well-being. Being unable to meet in person heavily affected social lives that often led to feeling isolated and lonely—for people of all ages. Students had to adjust to virtual classroom settings, professionals had to relearn work-life balance with remote work, and older adults had to safeguard against higher infection risks in their communities. Though many are slowly returning to in-person activities, combatting the social effects of isolation will take some effort. We must be mindful and cautious of COVID-19, but there are safe ways to reconnect. Now that we have more experience using digital tools, we can leverage those to befriend fellow community members: Students who struggle with their schoolwork can connect with tutors virtually. Professionals can reach out to members and volunteers who serve in public health fields. Older adults can seek fellow companions. AmeriCorps Senior volunteer with this companion AmeriCorps Seniors continue to shine during the pandemic. Through the three core programs – RSVP, Foster Grandparent Program, and Senior Companion Program – senior volunteers helped Americans across the nation: RSVP volunteers supported vaccination sites and mobile clinics in underserved communities. Foster Grandparents Program volunteers assisted students in remote and in-person environments, sharing their wisdom to help them navigate their social, emotional, and academic development. Senior Companions Program volunteers conducted wellness checks for homebound individuals and were a listening ear for their peers. As one of AmeriCorps’ oldest programs, AmeriCorps Seniors has positively benefited many communities and the lives of volunteers. Even before the pandemic, 90 percent of older Americans receiving services from the Senior Companion Program shared that they were less lonely having a designated AmeriCorps peer. And, 73 percent stated that they were able to remain living at their home thanks to the care these companions provided. If you want to volunteer your time with a new peer, check out the various ways you can do so . Tip 3 – Feel happier by helping others Invest in yourself through service. Many studies suggest that a sense of happiness is achieved through effort, progression, and accomplishment: The effort to do something outside of our daily lives. The progression to moving this thought into action. The accomplishment of completing said action. Serving is one example of these steps. For example, Minnesota Reading Corps , an organization that helps children from age three through grade three learn to read. The program reaches more than 36,000 at-risk students annually. Tutors who join the organization work with children one-on-one and in small groups using literacy interventions tailored to each child's needs. Minnesota Reading Corps tutor with her students (Photo credit to Minnesota Reading Corps) AmeriCorps members who join as tutors are required to complete literacy trainings before they start their service. The organization works with literacy experts to ensure members are equipped with the knowledge and tools needed to be effective and confident. This effort and progression result in beneficial accomplishments for both the children being served and members serving: AmeriCorps tutors helped more than 200,000 students. Minnesota Reading Corps Kindergarten participants have shown higher high school graduation rates than previous years. AmeriCorps members showed increased employment, earnings, and educational attainment after serving. Do good to feel good National service and occasional volunteer roles help more than the communities being served. Not only can you help solve local challenges, but through service, you also can improve your own mental health. Plus, you can fit national service into your schedule however you like. Find your best fit with AmeriCorps this Mental Health Action Day. Previous Heroes Come from All Generations Next AmeriCorps' Tribute to the Generations of Asian and Pacific Islanders Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2022-05-17/three-tips-improve-your-health-mental-health-action-day",
    "https://www.mentalhealthaction.network/",
    "https://americorps.gov/blogs/2021-05-20/americorps-partners-mtv-entertainment",
    "https://time.com/6171174/nature-stress-benefits-doctors/",
    "https://ecology.wa.gov/Local-projects-issues/Investing-in-communities/Washington-Conservation-Corps",
    "https://americorps.gov/blogs/2022-04-21/earth-day-connecting-people-nature",
    "https://americorps.gov/sites/default/files/document/ROI_WCC%20a_RELEASE.pdf",
    "https://americorps.gov/sites/default/files/document/ROI_AmeriCorpsSeniors_FGP_SCP_508.pdf",
    "https://americorps.gov/serve/americorps-seniors/americorps-seniors-pathfinder",
    "https://www.serveminnesota.org/program/minnesota-reading-corps/",
    "https://americorps.gov/sites/default/files/document/ROI_MRC%20Kindergarten_508.pdf",
    "https://americorps.gov/serve/fit-finder",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2022-05-17/three-tips-improve-your-health-mental-health-action-day&amp;title=Three Tips to Improve Your Health This Mental Health Action Day ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2022-05-17/three-tips-improve-your-health-mental-health-action-day&amp;title=Three Tips to Improve Your Health This Mental Health Action Day &amp;source=https://americorps.gov/blogs/2022-05-17/three-tips-improve-your-health-mental-health-action-day",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2022-05-17/three-tips-improve-your-health-mental-health-action-day&amp;url=https://americorps.gov/blogs/2022-05-17/three-tips-improve-your-health-mental-health-action-day&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2022-05-13/heroes-come-all-generations",
    "https://americorps.gov/blogs/2022-05-20/americorps-tribute-generations-asian-pacific-islanders",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2022",
  "subdomain_2": "05",
  "subdomain_3": "17"
}