{
  "id": "americorpsgov_blogs_2024_09_30_americorps_30_americorps_movement_continueshtml",
  "url": "https://americorps.gov/blogs/2024-09-30/americorps-30-americorps-movement-continues",
  "title": "americorps-30-americorps-movement-continues",
  "content": "AmeriCorps 30: The AmeriCorps Movement Continues | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps 30: The AmeriCorps Movement Continues Submitted by dsong on Fri, 09/27/2024 - 12:23 Sep 30, 2024 AmeriCorps Staff From September 2023 to September 2024, AmeriCorps celebrated the agency's 30th anniversary with the nation. We had the opportunity to highlight Americans who committed to a lifetime of service to make a difference in communities, announced exciting new initiatives to continue addressing our nation's most urgent needs, and more. Through the yearlong celebration, we demonstrated how national service has been and continues to be a movement that brings out the best of America. Honoring Americans' Dedication to Transforming Lives At the annual Points of Light Conference in June, AmeriCorps and Peace Corps awarded the first Harris Wofford Joint Service Award to more than 200 individuals in honor of the late Senator Harris Wofford, who helped establish the Peace Corps and AmeriCorps. The award recognizes individuals who have already chosen to serve their country at home and abroad through AmeriCorps and Peace Corps, who embody Harris Wofford's legacy of dedicating themselves to bridge divides through volunteerism. AmeriCorps Launches New Initiatives to Address Today's Needs During the 30th anniversary, AmeriCorps continued to demonstrate how national service addresses our nation's challenges of today to prepare the next generation of leaders: Youth mental health has been a crisis that affects our students and young adults. In May, AmeriCorps joined Pinterest and the Schultz Family Foundation to announce the Youth Mental Health Corps launch, an innovative, public-private collaboration to help teenagers access critical mental health resources. Through the program, AmeriCorps members address the growing needs of young people while creating career pathways to address the national shortage of mental health professionals. AmeriCorps joined forces with the Department of Justice Programs' Office of Juvenile Justice and Delinquency Prevention to support the needs of youth in the juvenile system. Through the partnership, the two agencies awarded innovative programs that support youth transitioning back into their communities from juvenile residential or correctional facilities. AmeriCorps partnered with the Environmental Protection Agency to launch the Environmental Justice Climate Corps , a new American Climate Corps program that will place more than 250 AmeriCorps members serving with the VISTA program to support projects that reduce pollution, increase community climate resilience, improve public health and safety, and build community capacity to address environmental justice and climate challenges while they gain skills and experience for good-paying clean energy and climate careers. AmeriCorps Honors Older Adult Volunteers AmeriCorps gathered for three days to learn and share about the impact of AmeriCorps Seniors. Grantees and AmeriCorps Research and Evaluation partners convened to celebrate the positive impact of AmeriCorps Seniors volunteers in our nation. AmeriCorps also hosted the first-ever AmeriCorps Seniors Convening Awards to recognize program directors who have made significant contributions to their communities by leveraging volunteer service to address local challenges that align with national priorities. The nation also celebrated the 50th anniversary of the AmeriCorps Seniors Senior Companion program. Since 1974, hundreds of thousands of AmeriCorps Seniors volunteers have served in the program to provide assistance and companionship to older adults with difficulty with daily living tasks. Through the Senior Companion program, AmeriCorps Seniors volunteers keep seniors independent longer and provide respite to family caregivers. Recognizing Excellence in AmeriCorps Our nation's leaders and former agency leaders joined to celebrate 30 years of AmeriCorps making a difference at the annual AmeriCorps State and National Symposium. From sharing best practices to discussing new ideas and approaches to serving our communities, national service champions from coast to coast gathered to learn how we can continue to make a difference. AmeriCorps hosted our 10th annual Excellence in AmeriCorps Award to honor the outstanding and innovative State and National programs, members, and alumni tackling our nation's most pressing challenges. Four AmeriCorps members and two grantees in the State and National program received the awards for their commitment. The AmeriCorps Movement Continues AmeriCorps released a new animated video, What is AmeriCorps , to celebrate 30 years of national service and share how members, volunteers, and more address our nation's most pressing challenges while creating pathways to transform the lives of those served and those who serve. For the past three decades, more than 1.3 million alumni served across the country in nearly 40,000 locations to lift up communities' education, economic opportunity, disaster services, environmental stewardship, healthy futures, and veterans and military families needs. AmeriCorps will stay committed to strengthening our communities and always answering the call to serve in times of tragedy and triumph beyond our 30 years. Join the AmeriCorps movement to create positive change. Previous National Service Addresses the Nation's Substance Use Disorder Crisis Next The College Alternative to a Fulfilling Career Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2024-09-30/americorps-30-americorps-movement-continues",
    "https://www.youthmentalhealthcorps.org/",
    "https://americorps.gov/newsroom/press-release/americorps-department-justice-announce-millions-support-12-innovative",
    "https://americorps.gov/newsroom/press-release/biden-harris-administration-announces-nationwide-environmental-justice",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2024-09-30/americorps-30-americorps-movement-continues&amp;title=AmeriCorps 30: The AmeriCorps Movement Continues",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2024-09-30/americorps-30-americorps-movement-continues&amp;title=AmeriCorps 30: The AmeriCorps Movement Continues&amp;source=https://americorps.gov/blogs/2024-09-30/americorps-30-americorps-movement-continues",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2024-09-30/americorps-30-americorps-movement-continues&amp;url=https://americorps.gov/blogs/2024-09-30/americorps-30-americorps-movement-continues&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2024-09-26/national-service-addresses-nations-substance-use-disorder-crisis",
    "https://americorps.gov/blogs/2024-10-22/college-alternative-fulfilling-career",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps State and National; AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2024",
  "subdomain_2": "09",
  "subdomain_3": "30"
}