{
  "id": "americorpsgov_contact_state_service_commissionshtml",
  "url": "https://americorps.gov/contact/state-service-commissions",
  "title": "state-service-commissions",
  "content": "State Service Commissions | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Contact Us State Service Commissions AmeriCorps staff work closely with governor-appointed State Service Commissions in each state. Contact Us AmeriCorps NCCC Regions Region Offices State Service Commissions State Service Commissions provide AmeriCorps funding to AmeriCorps state programs through annual grant competitions. Grants are made either directly to an organization or through an intermediary group that handles the distribution of grant funding. State Service Commissions are also charged with encouraging volunteering in their states and often administer special volunteer initiatives. Alabama Alabama Governor's Office of Volunteer Services 401 Adams Avenue, Suite #312 Montgomery, AL 36104 Melinda Stallworth, Coordinator Phone: 334-242-1548 Website: servealabama.gov Alaska Serve Alaska 550 W. 7th Ave., Ste. 1640 Anchorage, AK 99501-3510 Katie Abbott, Executive Director Phone: 907-269-6720 Fax: 907-269-5666 Website: commerce.alaska.gov /servealaska American Samoa The American Samoa currently does not have a commission. For information on AmeriCorps grant opportunities, please contact AmeriCorpsGrants@cns.gov Arizona Arizona Governor's Commission on Service and Volunteerism 1700 West Washington, Suite 101 Phoenix, AZ 85007-2806 Emily Litchfield, AmeriCorps Director Phone: 602-980-5064 Website: volunteer.az.gov/ Arkansas EngageAR Arkansas Service Commission 101 East Capitol Avenue, Suite 300 Little Rock, AR 72201 Starr Crow, Interim Director Phone: 501-537-9722 Fax: 501-682-1623 Website: engagearkansas.org/ COVID-19 webpage California California Volunteers 1400 10th Street Sacramento, CA 95814-3905 Josh Fryday, Chief Service Officer Phone: 916-323-7646 Fax: 916-323-3227 Website: californiavolunteers.ca.gov COVID-19 webpage Colorado Serve Colorado 225 E. 16th Ave., Suite 575 Denver, CO 80203 John Kelly, Executive Director Danny Fisher, Training & Outreach Officer Phone: 720-610-6012 Website: colorado.gov/servecolorado COVID-19 webpage Commonwealth of the Northern Mariana Islands Currently there is not a commission. For information on AmeriCorps grant opportunities, please contact AmeriCorpsGrants@cns.gov Connecticut Serve Connecticut 450 Columbus Boulevard, Suite 707 Hartford, CT 06103-1841 Jacqueline Lucier, Executive Director Phone: 860-947-1828 Fax: 860-947-1310 Website: servect.org Delaware Governor's Commission on Community & Volunteer Service Division of State Service Center, Charles Debnam Bldg. 1901 N. Dupont Hwy, New Castle, DE 19720-1100 John Sullivan, Executive Director Phone: 302-255-9739 Fax: 302-255-4462 Website: volunteer.delaware.gov /Commission District of Columbia Serve DC - Mayor's Office on Volunteerism and Partnerships 2235 Shannon Pl SE Washington, DC 20020 Jermaine Dillon, Director and Chief Service Officer Phone: 202-727-7925 Website: serve.dc.gov COVID-19 webpage Florida Volunteer Florida 1545 Raymond Diehl Rd. Suite 250 Tallahassee, FL 32308 Josefina Tamayo, Chief Executive Officer Phone: 850-414-7400 Fax: 850-921-5146 Website: volunteerflorida.org Georgia Georgia Commission for Service and Volunteerism 60 Executive Park South, NE Atlanta, GA 30329-2296 Linda Thompson, Executive Director Phone: 404-679-1584 Website: https://www.dca.ga.gov/local-government-assistance/partnerships/ga-commission-service-volunteerism-georgia-serves Guam Serve Guam Commission/ Office of the Governor 414 West Soledad Avenue, Suite 202 GCIC Building Hagåtña, GU 96910 Doris Aguon, SGC Executive Director Phone: 671-300-4599 Website: serveguam.com COVID-19 webpage Hawaii Hawai'i Commission for National and Community Service University of Hawaii 1601 East-West Road, JAB 4082 Honolulu, HI 96848 Keala Monaco, Executive Director Phone: 808-956-8145 Fax: 808-944-7677 Website: americorpshawaii.org Idaho Serve Idaho, State of Idaho Department of Labor 317 W. Main Street Boise, ID 83702 Emily Straubhar, Executive Director Phone: 208-696-2287 Fax: 208-327-7470 Website: serve.idaho.gov Illinois Serve Illinois (Illinois Commission on Volunteerism and Community Service) 823 E. Monroe Street Springfield, IL 62701 Andres J. Fernandez, Executive Director dhs.serveillinois@illinois.gov Phone: 800-592-9896 Fax: 217-524-2260 Website: serve.illinois.gov/ COVID-19 webpage Indiana Serve Indiana 10 N. Senate Ave. Room SE 115 Indianapolis, IN 46204-4701 info@serveindiana.gov Phone: 317-233-0900 Fax: 317-233-5660 Website: in.gov/serveindiana/ Iowa Volunteer Iowa 1963 Bell Avenue, Suite 200 Des Moines, IA 50315 Adam Lounsbury, Executive Director Phone: 515-348-6230 Fax: 877-631-7575 Website: volunteeriowa.org Kansas Kansas Volunteer Commission Landon State Office Building 900 SW Jackson St., Suite 105 Topeka, KS 66612-1212 Jessica Dorsey, Executive Director Phone: 785-296-3163 Fax: 785-368-6284 Website: kanserve.org Kentucky Serve Kentucky 275 East Main Street - Mail Stop 3W-E Frankfort, KY 40621-2321 Joe Bringardner, Executive Director Phone: 502-401-9467 Fax: 502-564-6108 Website: serve.ky.gov Louisiana Volunteer Louisiana 701 N. 4th Street, 4th Floor Baton Rouge, LA 70802-5345 Judd Jeansonne, Executive Director Phone: 225-342-2038 Fax: 225-342-0106 Website: volunteerlouisiana.gov Maine Volunteer Maine 19 Elkins Lane, Room 105 105 State House Station Augusta, ME 04333-0105 Maryalice Crofton, Executive Director Phone: 207-624-7792 Website: volunteermaine.gov Maryland Governor’s Office on Service and Volunteerism Maryland Department of Service and Civic Innovation 45 Calvert Street Annapolis, MD 21401 Liz Looney Lorenz, Executive Director Phone: 410-980-4436 Website: serve.maryland.gov Massachusetts Massachusetts Service Alliance 98 North Washington Street, Suite 400 Boston, MA 02114 Beth McGuinness, Chief Executive Officer Phone: 351-218-9894 Website: mass-service.org COVID-19 webpage Michigan Michigan Community Service Commission 105 W. Allegan Street, 3rd Floor Lansing, MI 48933 Ginna Holmes, Executive Director Phone: 517-335-4295 Website: michigan.gov/mcsc COVID-19 webpage Minnesota Serve Minnesota 120 South 6th St #2260 Minneapolis, MN 55402 Julia Quanrud, Chief Executive Officer Phone: 612-333-7740 Fax: 612-333-7758 Website: serveminnesota.org Mississippi Volunteer Mississippi 3825 Ridgewood Road, 2nd Floor Jackson, MS 39211-6453 Suzanne Scales Rutherford, Executive Director Phone: 888-353-1793 Fax: 601-432-6790 Website: www.volunteermississippi.org Missouri Missouri Community Service Commission 301 West High Street, Harry S. Truman Office, Ste. 770 Jefferson City, MO 65102 Brittany Stiffler Crabtree, Executive Director Phone: 573-751-5012 Website: showmeservice.org Montana Governor's Office of Community Service, ServeMontana P.O. Box 200801 Helena, MT 59620-0801 Sarah Sadowski, Director Phone: 406-444-9077 Website: serve.mt.gov Nebraska Serve Nebraska, the Nebraska Volunteer Service Commission State Capitol - 6th Floor P.O. Box 98927 Lincoln, NE 68509-8927 Cathleen Plager, Executive Director Phone: 402-471-6225 Fax: 402-471-6286 Website: serve.nebraska.gov/ COVID-19 webpage Nevada Nevada Volunteers 1575 Delucchi Lane, Suite 118 Reno, NV 89502 Zanny Marsh, Executive Director Phone: 775-825-1900 Website: nevadavolunteers.org New Hampshire Volunteer NH! 117 Pleasant St, Dolloff Building Concord, NH 03301 Andrea Johnson, Senior Program Officer Phone: 603-410-7768 Fax: 603-271-7203 Website: VolunteerNH.org New Jersey New Jersey Commission on National and Community Service NJ Department of State 225 W. State St., 4th Floor - PO Box 456 Trenton, NJ 08625-0459 Rowena Madden, Executive Director Phone: 609-633-9627 Fax: 609-777-2939 Website: state.nj.us /state/programs/americorps COVID-19 webpage New Mexico Serve New Mexico Commission New Mexico Department of Workforce Solutions 401 Broadway NE Albuquerque, NM 87102 Kristin Hsueh, Executive Director Phone: 505-273-0898 Fax: 505-841-8491 Website: dws.state.nm.us/servenm New York New York State Commission for National & Community Service 52 Washington Street North Building, Suite 235 Rensselaer, NY 12144-2796 Linda Cohen, Executive Director Competitive Grant Inquires Phone: 518-473-8882 Fax: 518-402-3817 Website: newyorkersvolunteer.ny.gov COVID-19 webpage North Carolina North Carolina Commission on Volunteerism and Community Service Office of the Governor 20301 Mail Service Center Raleigh, NC 27699-0301 Briles Johnson, Executive Director Phone: 919-814-2065 Website: volunteernc.org North Dakota North Dakota State Commission on National and Community Service Department of Commerce 1600 East Century Avenue, Suite 2 - P.O. Box 2057 Bismarck, ND 58502-2057 Ryan Volk, Program Officer Phone: 701-328-6048 Fax: 701-328-5320 Website: commerce.nd.gov /workforce/americorps Ohio ServeOhio 30 East Broad Street, Suite 2487 Columbus, OH 43215 William Hall, Executive Director Phone: 614-728-2916 Fax: 614-728-2921 Website: serve.ohio.gov Oklahoma Oklahoma Community Service Commission 730 W. Wilshire Blvd., Suite 101 Oklahoma City, OK 73116-7738 Melinda Points, Executive Director Phone: 405-858-7278 Fax: 405-858-7282 Website: okamericorps.com Oregon OregonServes State Service Commission 3225 25th Street SE Salem, OR 97302 Carie Bauer, Director Phone: 971-273-9144 Outreach: oregon.serves@hecc.oregon.gov Website: oregon.gov/oregonserves Pennsylvania PennSERVE 1306 Labor and Industry Building 651 Boas Street Harrisburg, PA 17121 Kaitlyn Spehar, Executive Director Phone: 717-772-4428 Fax: 717-705-4215 Website: dli.pa.gov/pennserve Puerto Rico Comisión de Voluntariado y Servicio Comunitario de Puerto Rico P.O. Box 9020082 San Juan, PR 00902-0082 Amanda L. Préstamo Torres, Executive Director Phone: 787-721-7000 ext. 3504 Website: comisionvoluntariado.pr.gov/ Rhode Island ServeRI, the Rhode Island Commission for National and Community Service 255 Westminster Street Providence, RI 02903 Adam Donaldson, National and Community Service Program Specialist Phone: 401-222-8984 Website: www.serverhodeisland.com South Carolina South Carolina Service Commission c/o United Way Association of South Carolina 1818 Blanding Street Columbia, SC 29201-3518 Mark Weller, Executive Director Phone: 803-929-1000 Website: AmeriCorpsSC.org South Dakota South Dakota currently does not have a commission. For information on AmeriCorps grant opportunities, please contact AmeriCorpsGrants@americorps.gov Tennessee Volunteer Tennessee William R. Snodgrass Tennessee Tower 312 Rosa Parks Ave., 18th Floor Nashville, TN 37243-1102 Jim Snell, Executive Director Phone: 615-253-1426 Fax: 615-741-1789 Website: volunteertennessee.net COVID-19 webpage Texas OneStar Foundation 2200 E Martin Luther King Jr. Blvd, Ste 100 Austin, TX 78702 Chris Bugbee, President/CEO Phone: 512-287-2000 Fax: 512-287-2039 Website: onestarfoundation.org Utah Utah Commission on Service & Volunteerism 3760 S. Highland Drive Millcreek, UT 84106 Loggins Merrill, Executive Director Phone: 801-245-7222 Fax: 801-355-3081 Website: userve.utah.gov/ Vermont SerVermont Office of the Secretary Agency of the Human Services 280 State Drive Waterbury, VT 05671-1000 Philip Kolling, Executive Director Phone: 802-760-0042 Website: servermont.vermont.gov/ COVID-19 webpage Virgin Islands The Virgin Islands currently does not have a commission. For information on AmeriCorps grant opportunities, please contact AmeriCorpsGrants@americorps.gov Virginia Serve Virginia 5600 Cox Road Glen Allen, VA 23060 Samantha Lukasiewicz, AmeriCorps Manager Phone: 804-726-7065 Website: servevirginia.org Washington Serve Washington P.O.Box 43113 Olympia, WA 98504-3113 Trish Almond, Executive Director Phone: 360-810-0517 Fax: 360-902-7315 Website: servewashington.wa.gov/ COVID-19 webpage West Virginia Volunteer West Virginia 600 Capitol Street Charleston, WV 25301 Hawley Carlson, Executive Director Phone: 304-558-0111 Fax: 304-558-0101 Website: volunteer.wv.gov COVID-19 webpage Wisconsin Serve Wisconsin 101 E. Wilson St., 6th Floor Madison, WI 53703 Jeanne Duffy, Executive Director Phone: 608-261-6716 Website: servewisconsin.wi.gov Wyoming ServeWyoming - Wyoming Commission on National and Community Service PO Box 1271 330 South Center Suite 317 Casper, WY 82602 Shelly McAlpin, Executive Director Phone: 866-737-8304 Fax: 307-234-3438 Website: servewyoming.org COVID-19 webpage Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/contact/state-service-commissions",
    "http://www.servealabama.gov/",
    "https://www.commerce.alaska.gov/web/dcra/ServeAlaska.aspx",
    "https://www.commerce.alaska.gov/web/dcra/ServeAlaska.aspx",
    "http://volunteer.az.gov/",
    "https://www.engagearkansas.org/",
    "https://www.volunteerar.org/covid-resources",
    "https://californiavolunteers.ca.gov/",
    "https://californiavolunteers.ca.gov/get-involved/covid-19/",
    "https://www.colorado.gov/servecolorado",
    "https://servecolorado.colorado.gov/help-contain-the-spread-of-covid-19",
    "http://servect.org/",
    "https://volunteer.delaware.gov/Commission",
    "https://volunteer.delaware.gov/Commission",
    "http://www.serve.dc.gov/",
    "https://serve.dc.gov/service/local-covid-19-services-and-resources",
    "https://www.volunteerflorida.org/",
    "https://www.dca.ga.gov/local-government-assistance/partnerships/ga-commission-service-volunteerism-georgia-serves",
    "https://serveguam.com/",
    "https://serveguam.com/covid-19",
    "http://www.americorpshawaii.org/",
    "https://serve.idaho.gov/",
    "http://www.serve.illinois.gov/",
    "https://serveillinois.galaxydigital.com/",
    "https://www.in.gov/serveindiana/",
    "http://www.volunteeriowa.org/",
    "http://www.kanserve.org/",
    "http://www.serve.ky.gov/",
    "http://www.volunteerlouisiana.gov/",
    "http://www.volunteermaine.gov/",
    "https://dsci.maryland.gov/Pages/default.aspx",
    "http://www.mass-service.org/",
    "http://massservice.galaxydigital.com/need/?s=1&amp;need_init_id=3032",
    "http://www.michigan.gov/mcsc",
    "https://volunteermichigan.galaxydigital.com/need/?s=1&amp;need_init_id=3010",
    "http://www.serveminnesota.org/",
    "https://www.volunteermississippi.org",
    "http://www.ShowMeService.org",
    "http://serve.mt.gov/",
    "http://www.serve.nebraska.gov/",
    "https://www.serve.nebraska.gov/news-events/covid-19-response.html",
    "http://www.nevadavolunteers.org/",
    "http://www.volunteernh.org/",
    "http://www.state.nj.us/state/programs/dos_program_americorps.html",
    "http://www.state.nj.us/state/programs/dos_program_americorps.html",
    "https://www.nj.gov/state/assets/pdf/volunteer/2020-0325-nj-volunteer-guidance.pdf",
    "https://www.dws.state.nm.us/servenm",
    "http://www.newyorkersvolunteer.ny.gov/",
    "https://coronavirus.health.ny.gov/get-involved-how-you-can-help",
    "http://www.volunteernc.org/",
    "https://www.commerce.nd.gov/workforce/americorps",
    "https://www.commerce.nd.gov/workforce/americorps",
    "https://serve.ohio.gov/",
    "http://www.okamericorps.com/",
    "https://www.oregon.gov/oregonserves",
    "http://www.dli.pa.gov/pennserve",
    "http://www.comisionvoluntariado.pr.gov/",
    "http://serverhodeisland.com",
    "https://www.uwasc.org/about-americorps-sc-and-available-positions",
    "http://www.volunteertennessee.net/",
    "https://www.tn.gov/content/tn/volunteer-tennessee/disaster-services/covid-19.html",
    "http://www.onestarfoundation.org/",
    "https://userve.utah.gov/",
    "http://servermont.vermont.gov/",
    "https://www.vermont.gov/volunteer?fbclid=IwAR2i-hzvM-VnyM6PekeEOgZrR4UZV9HLK_HiJygQ_jej1760Y3RqpBeba5w",
    "https://servevirginia.org/",
    "http://servewashington.wa.gov/",
    "https://servewashington.wa.gov/volunteer/volunteer-during-covid-19",
    "http://volunteer.wv.gov/Pages/default.aspx",
    "https://volunteer.wv.gov/Volunteer/Pages/Covid-19.aspx",
    "http://www.servewisconsin.wi.gov/",
    "http://servewyoming.org/",
    "http://www.volunteerwyoming.org/need/?s=1&amp;need_init_id=3038",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "contact",
  "topic": "",
  "year": "",
  "domain": "contact"
}