{
  "id": "americorpsgov_blogs_2021_01_15_service_unites_mlk_day_beyondhtml",
  "url": "https://americorps.gov/blogs/2021-01-15/service-unites-mlk-day-beyond",
  "title": "service-unites-mlk-day-beyond",
  "content": "Service Unites on MLK Day and Beyond | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Service Unites on MLK Day and Beyond Submitted by kaparker on Fri, 01/15/2021 - 15:43 Jan 15, 2021 Barbara Stewart, CEO, AmeriCorps Service Unites on MLK Day and Beyond Service is more important than ever to heal our divisions and meet our nation’s challenges. Dr. Martin Luther King Jr. once said, “Everybody can be great, because everybody can serve.” He understood that each and every one of us has something to contribute to making America a better nation – and that all of us should try. That idea is the guiding force behind everything we do at AmeriCorps , the federal agency for service and volunteerism.  We lead the MLK Day of Service and engage millions of Americans in service throughout the year to meet community needs. In 1994, Congress passed legislation designating the Martin Luther King Holiday as a national day of volunteer service – “a day on, not a day off.”  For the past 26 years, our agency has had the honor and privilege of leading this national day of service. We’ve seen it grow from a handful of local events to projects taking place in all 50 states. This year, AmeriCorps is collaborating with the Presidential Inaugural Committee to call on all Americans to unite through service on MLK Day and commit to serve throughout the year. Service to others is at the heart of who we are as Americans. Today, as our nation grapples with the dual economic and health crises of COVID-19, calls for racial equity, and other challenges, service is more important than ever to meet this moment and heal our nation. Creating the Beloved Community During his lifetime, Dr. Martin Luther King Jr. worked tirelessly to build a “Beloved Community” – a society based on simple justice that values the worth and dignity of every human being. For Dr. King, creating this community meant challenging America to live up to the ideals enshrined in our constitution of liberty and justice for all. It also meant expanding economic opportunity and building pathways for people from all walks of life to achieve the American dream. There is still much work to do to achieve Dr. King’s dream.  He would find it unacceptable that so many of our young people drop out of school, that millions of Americans live in poverty, and that there is still much work needed to ensure racial justice and equity for all. The work Dr. King started has become even more urgent in the wake of the pandemic.  COVID-19 has caused unprecedented harm, dealt a severe blow to our economy, strained our education and social support systems, and brought existing disparities in our society to the spotlight. Meeting these challenges and addressing racial inequity requires action by government at all levels. But government can’t do it alone. We also need active citizens, working together. One of the great lessons of the civil rights movement was the power of ordinary citizens to improve lives and positively change the course of history. Today, we again urgently need Americans to come together in service to address our nation’s toughest challenges. Safely Serving on MLK Day In carrying out the MLK Day of Service, AmeriCorps works with community and faith-based organizations, government agencies, national service programs, businesses, schools, and others to organize and support local projects. This year, MLK Day will be different because of COVID-19, but there are many ways to get involved.  Organizations across the country are developing COVID-safe projects including virtual events, food and clothing collection drives, and in-person projects with health and safety protocols that follow public health guidelines. Our website, MLKDay.gov has a searchable list of volunteer opportunities and ideas of service projects that you can do on your own, as a family or individually. Serving Year Round MLK Day shows the power of service to solve problems and strengthen communities – a mission we at AmeriCorps carry out every day. Our programs tap the ingenuity and can-do spirit of the American people to meet local needs throughout the country. Each year, we engage 270,000 Americans in sustained, results-driven service through our AmeriCorps and AmeriCorps Seniors programs.  These dedicated citizens help communities impacted by COVID-19, ensure students stay on track to graduate, combat hunger and homelessness, respond to natural disasters, fight the opioid epidemic, help seniors live independently, support veterans and military families, and much more. By bringing people of different races, religious beliefs, and economic backgrounds together to pursue common goals, national service unites us – bridging divides and providing a shared experience that fuels an appreciation of diversity and a love of community and country. Join Us The challenges America faces today are real, made more daunting by a long pandemic. Meeting these challenges and building the kind of society that Dr. King dreamed of will take an ongoing, sustained effort. I ask that you consider how Dr. King’s vision of a Beloved Community could be moved forward if you get involved in the MLK Day of Service and commit to volunteering throughout the year. Your impact can multiply quickly through your loved ones and networks, touching more people and more communities. There is no shortage of work to be done, or lack of ways to get involved. Follow your passion and find something that’s right for you. As Dr. King said “Make a career of humanity...and you will make a greater person of yourself, a greater nation of your country, and a finer world to live in.” Previous AmeriCorps Member Changes Career Aspiration after Moving Gap Year in VISTA Next A Renewed Call to Service Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2021-01-15/service-unites-mlk-day-beyond",
    "http://www.mlkday.gov/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2021-01-15/service-unites-mlk-day-beyond&amp;title=Service Unites on MLK Day and Beyond",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2021-01-15/service-unites-mlk-day-beyond&amp;title=Service Unites on MLK Day and Beyond&amp;source=https://americorps.gov/blogs/2021-01-15/service-unites-mlk-day-beyond",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2021-01-15/service-unites-mlk-day-beyond&amp;url=https://americorps.gov/blogs/2021-01-15/service-unites-mlk-day-beyond&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2021-01-12/americorps-member-changes-career-aspiration-after-moving-gap-year-vista",
    "https://americorps.gov/blogs/2021-02-04/renewed-call-service",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2021",
  "subdomain_2": "01",
  "subdomain_3": "15"
}