{
  "id": "americorpsgov_blogs_2022_07_29_ten_years_responding_crisis_situationshtml",
  "url": "https://americorps.gov/blogs/2022-07-29/ten-years-responding-crisis-situations",
  "title": "ten-years-responding-crisis-situations",
  "content": "Ten Years of Responding to Crisis Situations | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Ten Years of Responding to Crisis Situations Submitted by dsong on Thu, 07/28/2022 - 16:45 Jul 29, 2022 AmeriCorps staff More than 80 disasters across 31 states, Washington, DC, Northern Marianas, Puerto Rico, and the US Virgin Islands. 5,000+ AmeriCorps members. Five million service hours. Over the past 10 years, FEMA Corps members have played a vital role in responding to disasters including Hurricanes Sandy, Harvey, Irma and Maria, floods in Texas and Tennessee, wildfires in California and Oregon, and the Oso mudslide in Washington state. FEMA Corps teams have cleaned up houses after tornadoes and provided food and water to disaster survivors. Often the first on the ground and last to leave, FEMA Corps is an innovative, team-based national service program that provides 18 to 26‐year‐olds the opportunity to gain experience and training in emergency response while supporting immediate needs after a disaster for survivors and their communities. “[FEMA Corps’] dedication to helping people is admirable and we are fortunate to have them as a part of our FEMA family,” said FEMA Administrator Deanne Criswell. “I am so grateful for their dedication to public service and for our decade-long partnership with AmeriCorps to help train the next generation of emergency managers.\" Developed to help the nation with disaster response, FEMA Corps has become a top recruitment tool for the emergency response workforce. FEMA Corps provides potential new leaders professional development experience through the AmeriCorps NCCC program with members committing to 1,700 service hours and training. FEMA Corps members play a key role in helping communities across the nation recover from hurricanes, historic floods, destructive wildfires, and unprecedented pandemics. FEMA Corps influence on disaster recovery In 2011, a devastating tornado struck Joplin, Missouri and killed 161 people, destroying more than 7,500 homes and businesses. The first team of AmeriCorps members from the NCCC program arrived within hours to immediately start community recovery efforts. They set-up a missing persons hotline, opened a volunteer center, and created a path to encourage more AmeriCorps members and volunteers across the country to help. AmeriCorps members assisted more than 3,000 households in removing debris, repairing and building homes, providing information to homeowner assistance and legal services, and operating donation and distribution warehouses. They played a critical role in helping bring safety and direction to more than 150,000 citizen volunteers who came to Joplin, delivering more than one million hours of service. AmeriCorps members’ actions helped the city save more than $17.7 million in disaster costs. “AmeriCorps has played a lead role in making sure that volunteers have come in and have tasks at hand that are safe and doable,” said former Missouri Governor Jay Nixon on June 6, 2011. Joplin’s recovery efforts showed the power of national service and the importance of immediate support following a disaster. These lessons helped other disaster-struck communities prepare for recovery. The national service response in Joplin became the model for AmeriCorps NCCC to design FEMA Corps as a new disaster relief-focused AmeriCorps program in 2012. AmeriCorps NCCC members helping restore homes Since then, FEMA Corps was deployed to assist after the nation’s most catastrophic disasters. Hurricane Sandy : AmeriCorps members were at the forefront of Hurricane Sandy recovery in New Jersey. Approximately 100 AmeriCorps members and eight AmeriCorps NCCC teams served in Sandy-affected communities rebuilding operations and homes. Hurricane Ida : FEMA Corps helped remove debris and mucked out homes of flood-damaged drywall, insulation, and appliances for communities affected. The teams ensured survivors and communities were well equipped. They were positioned at distribution centers preparing and organizing pallets, tarps, water, meals, and working through inventory to meet communities’ needs. AmeriCorps members also provided disaster survivor assistance. In affected communities, they reached out to assist families and people in need. They worked at disaster recovery centers to help register people for assistance, provide status updates, and connect them to the resources they needed. Caldor Fire : AmeriCorps members joined recovery efforts in California after the Caldor Fire in Eldorado National Forest, the Sierra Nevada in El Dorado, Amador, and Alpine County in 2021. FEMA Corps helped install erosion control materials to keep toxic run-off from further damage. New era of FEMA Corps On May 16, 2022, AmeriCorps and FEMA announced a five-year renewal of the inter-agency agreement prioritizing three focus areas: To support FEMA’s disaster response, recovery, readiness, preparedness, and mitigation efforts with trained National Service Members seeking to serve disaster survivors and gain experience in the field of emergency management. To develop and train future leaders in emergency management to serve with federal, state and local agencies, and non-governmental organization partners. To promote and support the development of leaders and strengthening of communities through the NCCC National Service model. Most recently, FEMA Corps has been on the front lines to help support the nation during COVID-19 pandemic. In response to the pandemic, teams expanded deployments to set up and help run vaccination clinics across the country. Many communities including West Virginia, Philadelphia, and Washington, DC, worked with FEMA Corps to launch first-of-its-kind vaccine initiatives. “[My] year of service has been especially rewarding within the context of the COVID-19 pandemic,” said FEMA Corps member Victoria Steele. “Despite our shared powerlessness over the pandemic, the program was a way to help local communities and feel fulfilled in a time of such uncertainty.” AmeriCorps NCCC members supporting at a vaccination site AmeriCorps members helped greet, check-in, and direct vehicles for registration at mobile clinics; determined eligibility for vaccines; provided wellness checks for individuals entering the facility; and monitored participants for side-effects following vaccination. In West Virginia, the mobile vaccination clinic administered 100 percent of the allocated vaccination doses. In Philadelphia, members conducted outreach missions where AmeriCorps members traveled to underserved communities to distribute information about the vaccination clinics and provide free public transit passes to help those who needed to travel for vaccines. FEMA Corps supported the city’s Senior Vaccine Buddies in Washington, DC, to help share information about the vaccine and vaccine distribution locations. Ready to get things done? AmeriCorps NCCC members in front of FEMA headquarters Since inception, AmeriCorps members serving in FEMA Corps continue to dedicate themselves to help those living through emergency situations and FEMA’s disaster preparation, mitigation, and response activities. More than 20 percent of FEMA Corps members have been hired as FEMA employees since 2013 and as of mid-2020, more than 600 FEMA Corps alumni are working for FEMA. Want to join the thousands of AmeriCorps members who make an impact in their community and have a chance to kickstart a career? FEMA Corps can help you get a foot in the door to work for the federal government and gain experience in the emergency management sector. You and your team are deployed wherever the need is the greatest, which means you have the opportunity to travel across the country or remain in one location for the duration of your service. What are you waiting for? Start your FEMA Corps journey ! Previous My Journey from AmeriCorps Member to Doctor of Social Science Next Unite through Service on September 11 Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2022-07-29/ten-years-responding-crisis-situations",
    "https://americorps.gov/newsroom/press-releases/2012/one-year-after-joplin-tornado-americorps-still-hard-work",
    "https://americorps.gov/newsroom/press-releases/2013/americorps-commits-long-term-recovery-efforts-help-new-jersey-recover",
    "https://www.fema.gov/blog/fema-corps-action-david-boatwright-shares-his-story",
    "https://americorps.gov/newsroom/press-release/americorps-fema-celebrate-10th-anniversary-fema-corps-renew-program-five",
    "https://www.fema.gov/press-release/20210317/wva-volunteer-organization-hosts-first-vaccine-event-its-kind-nation",
    "https://www.fema.gov/press-release/20210604/fema-corps-team-gulf-4-supports-philadelphia-vaccination-outreach-efforts",
    "https://www.fema.gov/press-release/20210505/fema-corps-team-wave-6-supports-dc-mayor-muriel-bowsers-day-action",
    "https://www.fema.gov/blog/why-you-should-join-fema-corps",
    "https://americorps.gov/funding-opportunity/americorps-nccc-fema-corps",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2022-07-29/ten-years-responding-crisis-situations&amp;title=Ten Years of Responding to Crisis Situations ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2022-07-29/ten-years-responding-crisis-situations&amp;title=Ten Years of Responding to Crisis Situations &amp;source=https://americorps.gov/blogs/2022-07-29/ten-years-responding-crisis-situations",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2022-07-29/ten-years-responding-crisis-situations&amp;url=https://americorps.gov/blogs/2022-07-29/ten-years-responding-crisis-situations&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2022-07-12/my-journey-americorps-member-doctor-social-science",
    "https://americorps.gov/blogs/2022-08-05/unite-through-service-september-11",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2022",
  "subdomain_2": "07",
  "subdomain_3": "29"
}