{
  "id": "americorpsgov_blogs_2021_07_08_yankees_hope_week_grand_slamhtml",
  "url": "https://americorps.gov/blogs/2021-07-08/yankees-hope-week-grand-slam",
  "title": "yankees-hope-week-grand-slam",
  "content": "Yankees’ HOPE Week is a Grand Slam | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Yankees’ HOPE Week is a Grand Slam Submitted by eschneider on Thu, 07/08/2021 - 09:35 Jul 08, 2021 AmeriCorps staff Service brings goodwill to individuals Every year, the New York Yankees’ HOPE Week is a home run—but this year, it was a grand slam. At its core, Yankees’ HOPE Week initiative (Helping Others Persevere & Excel) is rooted in the fundamental belief that acts of goodwill provide hope and encouragement to more than just the recipient of the gesture. Each day of HOPE Week, the Yankees MLB baseball team recognizes the good works of a different individual, family, or organization. Each day is designed so honorees can share their inspirational stories, while having a day of fun with the Yankees. Honorees are also awarded the President’s Volunteer Service Award, given “in recognition and appreciation of commitment to strengthening the nation and for making a difference through volunteer service.” Kicking off the 2021 HOPE Week was Gwen. When she was 10 years old, Gwen wrote a letter to the Yankees front office expressing her dream of being bat girl. And while her original request was declined, she never strayed from her favorite baseball team, nor her community. Gwen spent 31 years serving as a social worker in Connecticut’s Westport school system—and a committed Yankees fan. Photo credit: New York Yankees Six decades later, her favorite pro team made her lifelong dream come true. Gwen got to take the mound to throw the first pitch—and serve as bat girl for the night. “A day of a lifetime I can’t put into words,” said Gwen. “I don’t know where to start on which was the best, which or what did I enjoy the most. Just the whole piece from walking in the front door of the stadium to coming up to a locker with my name on it, and suiting up, and walking out onto the field.” Even though a couple of games were postponed due to rain, HOPE Week did not stop the celebration. The Yankees also honored 15-year-old Luke, who was diagnosed with T-lymphoblastic lymphoma, an aggressive form of non-Hodgkin’s lymphoma. To benefit other teens treated at the same hospital he is, Luke designed his own T-shirt, which reads, “No One Fights Alone,” to raise money for the hospital to spend on patient activities like popular books, toys, and video games. Photo credit: New York Yankees Unable to travel due to his treatments, Luke was able to test his mettle against several players, including shortstop and second baseman, Gleyber Torres; pitcher, Luis Severino; outfielder, Brett Gardner; and shortstop, Tyler Wade, who joined him virtually from the Yankee Stadium Press Conference Room for a round of video games, playing MLB The Show, of course. Gwen and Luke are just two examples of the inspiring community members HOPE Week spotlights. There are many more. These honorees are strengthening their communities through their exceptional volunteerism and service—you could even say they’ve knocked it out of the park. Are you feeling inspired by the Yankees? Get involved and find a service opportunity near you at americorps.gov/serve . #WhatsAtYourCore? Previous This Independence Day, Make America Stronger Through National Service Next Three Steps to Protect College Students This Fall Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2021-07-08/yankees-hope-week-grand-slam",
    "https://americorps.gov/serve",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2021-07-08/yankees-hope-week-grand-slam&amp;title= Yankees’ HOPE Week is a Grand Slam ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2021-07-08/yankees-hope-week-grand-slam&amp;title= Yankees’ HOPE Week is a Grand Slam &amp;source=https://americorps.gov/blogs/2021-07-08/yankees-hope-week-grand-slam",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2021-07-08/yankees-hope-week-grand-slam&amp;url=https://americorps.gov/blogs/2021-07-08/yankees-hope-week-grand-slam&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2021-07-02/independence-day-make-america-stronger-through-national-service",
    "https://americorps.gov/blogs/2021-07-13/three-steps-protect-college-students-fall",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2021",
  "subdomain_2": "07",
  "subdomain_3": "08"
}