{
  "id": "americorpsgov_blogs_2023_10_30_fostering_diversity_through_service_americorps_members_seniors_volunteers_leadinghtml",
  "url": "https://americorps.gov/blogs/2023-10-30/fostering-diversity-through-service-americorps-members-seniors-volunteers-leading",
  "title": "fostering-diversity-through-service-americorps-members-seniors-volunteers-leading",
  "content": "Fostering Diversity through Service: AmeriCorps Members and Seniors Volunteers Leading the Way | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Fostering Diversity through Service: AmeriCorps Members and Seniors Volunteers Leading the Way Submitted by dsong on Mon, 10/30/2023 - 13:35 Oct 30, 2023 AmeriCorps Staff As AmeriCorps turns 30, there's no denying the tremendous impact it has had on our communities nationwide. From promoting education and economic growth to championing diversity and inclusion, AmeriCorps members and AmeriCorps Seniors volunteers have been working tirelessly all year round, making a real difference in the lives of countless Americans. As we celebrate the milestones that define our nation's national service, we shine a spotlight on our ongoing efforts to break down barriers and open up new opportunities for service, from partnering with Native N ations to standing with LGBTQI+ and immigrant communities. With each passing month, AmeriCorps continues to embody the spirit of service and the values that make America great. Indigenous AmeriCorps Seniors Volunteers Enhance Quality of Life In Wisconsin, Great Lakes Inter-Tribal Council, Inc. , a nonprofit organization that aims to enhance the quality of life for all Native people, recruits the community’s tribal elders to serve as AmeriCorps Seniors Senior Companions . These volunteers serve as companions to fellow tribal elders, supporting and promoting the health, well-being, and cultural connections between tribal elders, which are highly valued in Native communities. AmeriCorps Seniors volunteer with GLITC AmeriCorps Seniors volunteers serving in the GLITC Senior Companion program join in activities such as powwows, beadwork, cultural outings, and everyday assistance. They help prepare meals and drive homebound elders to their doctor appointments. Iris, a Senior Companion from the Menominee Nation, shares her experience: “I joined AmeriCorps Seniors Senior Companion Program because I think it’s very important to help elders who are alone. They need companionship and friendship – someone they know they can count on. When I cook, I like sharing the extra food with my clients and know that they are eating healthy.” The GLITC Senior Companion program benefits the tribal elders who serve and are served in the individual sovereign tribal communities. Iris has been an AmeriCorps Seniors Senior Companion since 2019 Senior Companion Ed of the Oneida Nation says he serves because he wants to connect with other elders and be helpful to them. “I like taking them out to lunch and to the apple orchard to spend time together while getting apples and pumpkins,” said Ed. AmeriCorps Seniors volunteer Ed has been serving for more than four years Understanding the nature of the culture in each sovereign nation is crucial in helping these communities thrive. Each Tribal Nation has its own values, spiritual practices, and challenges. The GLITC AmeriCorps Seniors program has provided a vehicle where the elders can pass on their cultural heritage, stay connected, tell stories, and support cultural practices. Diverse Corps of Young People Become Tomorrow’s Leaders Based in Chicago, Illinois Safe Schools Alliance is a Public Health Institute of Metropolitan Chicago program that promotes safety, support, and healthy development for LGBTQI+ youth in Illinois schools and communities. For more than 16 years, young people, community organizations, schools and districts, and state agencies have worked in collaboration through Illinois Safe Schools Alliance to foster safer school spaces for LGBTQI+ youth. The organization prioritizes community involvement, specifically the involvement of LGBTQI+ young people, to both inform and drive their programmatic work. AmeriCorps members serving with Illinois Safe Schools Alliance AmeriCorps members serving in the Alliance program support its Youth Advisory Board, which serves as the steering committee for youth leadership work. AmeriCorps members help develop and facilitate large-scale leadership programming like Action Camp – the Alliance’s largest annual leadership event that brings together young leaders from across the state to learn from one another and shape the Safer Schools movement. Not only this, but young people sharpen their critical lens, expand their perspectives and frameworks, learn new skills, and practice what it means to create spaces in the world where all identities are safe, supported, affirmed, and celebrated. “ I joined AmeriCorps to build my own queer community in Chicago and learn more about LGBTQI+ health and education in public schools. I have always loved being involved in service, and participating in service within my held identity has been very meaningful to me. My most memorable moment during service was when I mentored a team of youth leaders in designing workshops for Action Camp. Working with those students increased my hope for the future,\" said AmeriCorps member EB. AmeriCorps member EB (far right) with fellow members serving in the VISTA program Transforming Lives for Every American In 1984, a small group of lawyers founded the National Immigrant Justice Center in Chicago, Ill., to provide immigration legal services to refugees seeking asylum who fled violence in Central America . Nearly 40 years later, the first AmeriCorps members joined the National Immigrant Justice Center through the AmeriCorps VISTA program to help meet the organization’s mission of establishing and defending the legal rights of immigrants, regardless of their backgrounds, and transforming the immigration system into one that affords equal opportunity for all. AmeriCorps members have been critical in helping the organization build capacity, streamline processes, and engage thousands of volunteers so that more people in our communities can receive needed immigration legal services. AmeriCorps members grow NIJC’s volunteer base by engaging with the community and other partners, and providing legal assistance to help immigrants meet their primary needs of obtaining immigration status and citizenship and gaining work authorization. Through AmeriCorps members’ support in NIJC, immigrants are more likely to win their cases and secure permanent protection from deportation. Current AmeriCorps member Demetrius shares, “I joined AmeriCorps because public service opportunities provide a unique experience to address poverty within underserved communities and build capacity-based solutions. My most memorable moment during service was witnessing testimonial victories by immigrant clients at celebrations. I’m grateful for my AmeriCorps service with the National Immigrant Justice Center and for being a part of a mission that ensures human rights protections and access to justice for all immigrants, refugees, and asylum seekers.\" AmeriCorps member Demetrius (right) with Ellen Miller, NIJC Pro Bono Manager Through service, AmeriCorps members like Demetrius help create more diverse, vibrant, and resilient communities, with more immigrants regularizing their status, accessing protection, and contributing to local economies. Building Inclusive and Accessible Programs For more than 30 years, AmeriCorps has made our teams, workspaces, and programs more inclusive and accessible. AmeriCorps is pushing to learn more, do better, and identify ways to make national service even more welcoming to people of all backgrounds. L ike Great Lakes Inter-Tribal Council, Inc., Illinois Safe Schools Alliance, and the National Immigrant Justice Center, AmeriCorps is committed to taking steps to design processes, products, and programs that make room for all people in our society b ecause we understand that AmeriCorps is not a moment in our history but a continuous movement to bring out the best of America . Join us in celebrating our 3 0th anniversary and l earn more about our dedication to diversity in service . Previous 30th Anniversary: The AmeriCorps Movement Next Give a Gift that Matters: Donate your Time this Giving Season Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-10-30/fostering-diversity-through-service-americorps-members-seniors-volunteers-leading",
    "https://www.glitc.org/",
    "https://www.americorps.gov/serve/americorps-seniors/americorps-seniors-senior-companion-program",
    "https://www.ilsafeschools.org/",
    "https://phimc.org/",
    "https://www.ilsafeschools.org/action-camp-info",
    "https://immigrantjustice.org/",
    "https://americorps.gov/serve/americorps/americorps-vista",
    "https://americorps.gov/americorps30",
    "https://socialpresskit.com/americorps30",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-10-30/fostering-diversity-through-service-americorps-members-seniors-volunteers-leading&amp;title=Fostering Diversity through Service: AmeriCorps Members and Seniors Volunteers Leading the Way",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-10-30/fostering-diversity-through-service-americorps-members-seniors-volunteers-leading&amp;title=Fostering Diversity through Service: AmeriCorps Members and Seniors Volunteers Leading the Way&amp;source=https://americorps.gov/blogs/2023-10-30/fostering-diversity-through-service-americorps-members-seniors-volunteers-leading",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-10-30/fostering-diversity-through-service-americorps-members-seniors-volunteers-leading&amp;url=https://americorps.gov/blogs/2023-10-30/fostering-diversity-through-service-americorps-members-seniors-volunteers-leading&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-10-19/30th-anniversary-americorps-movement",
    "https://americorps.gov/blogs/2023-11-20/give-gift-matters-donate-your-time-giving-season",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA; AmeriCorps Seniors",
  "focus_population": [
    "Schools"
  ],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "10",
  "subdomain_3": "30"
}