{
  "id": "americorpsgov_blogs_2020_08_25_luwi_shamambo_americorps_vista_fighting_poverty_and_racial_injustice_healthcarehtml",
  "url": "https://americorps.gov/blogs/2020-08-25/luwi-shamambo-americorps-vista-fighting-poverty-and-racial-injustice-healthcare",
  "title": "luwi-shamambo-americorps-vista-fighting-poverty-and-racial-injustice-healthcare",
  "content": "Luwi Shamambo: An AmeriCorps VISTA Fighting Poverty and Racial Injustice in Healthcare | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Luwi Shamambo: An AmeriCorps VISTA Fighting Poverty and Racial Injustice in Healthcare Submitted by admin on Tue, 08/25/2020 - 12:12 Aug 27, 2020 CNCS Welcome to the Poverty + Racial Injustice Stories Project. Our nation is experiencing an awakening, and for some, an introduction to the injustices that Black people have been facing in this country for decades. We are dedicating this project and this space to the stories of AmeriCorps VISTA members whose work goes beyond the VISTA mission to eradicate poverty. These stories will show how their work in tackling this mission intersects with combatting racial injustices in the communities they serve. Our hope is that 1. VISTA members will be seen and celebrated for their work, 2. The stories will provide a blueprint for others to follow, and 3. By sharing stories from areas including housing, literacy, and nutrition, readers will get a glimpse into just how far reaching the effects of racial injustice can be. Luwi Shamambo Boston Medical Center (Telehealth Epilepsy Care Collaborative) Boston, Massachusetts Position: Transition and Mentorship VISTA August 2019 – August 2020 Luwi is a Zambian immigrant who came to the U.S. with her family in 2006. Over the years, her experiences have helped her develop a personal understanding and perspective on what it means to be an immigrant in the U.S., which includes challenges such as seeing her older sister forgo epilepsy treatments her parents could not afford.  . These experiences are part of what drew her to the AmeriCorps VISTA position at Boston Medical Center (BMC). Serving with BMC’s Telehealth Epilepsy Care Collaborative (TECC), Luwi’s work focuses on building the capacity of Transition Together , a public health intervention program for youth with epilepsy. With the goal to help patients live well with epilepsy and improve health outcomes, Luwi has helped develop a framework for recruiting youth with epilepsy and connecting them to peer mentors who can support their health and future. As Luwi nears the completion of her service, she is incredibly grateful to have spent her gap year in service before starting medical school. While the experience of working at BMC and living in Boston were amazing, she is also thankful for the many challenges that contributed to her personal and professional growth. Tell me about your service at BMC? I am part of the Telehealth Epilepsy Care Collaborative (TECC), a team based in the Pediatric Neurology Department at BMC. While we work on several different projects, our overarching mission is to improve access to quality care for children and youth with epilepsy (CYE) in low-income populations. My work focuses on building the capacity of our mentorship program, Transition Together, which connects youth (14+) with peer mentors who can support them through healthcare transition -- where youth learn to be more self-managing and appropriately independent as they move from pediatric to adult-centered healthcare. Young people with epilepsy face the challenge of growing up while dealing with the demands of living with a chronic condition. It’s important to remember that it’s not just the medical aspects of the condition, such as managing medications, that they must learn how to navigate. There are also social, behavioral, and cognitive elements (including comorbidities) to living with epilepsy, such as dealing with the associated stigma. CYE are more likely than their healthy peers to experience challenges such as lower levels of social support and more symptoms of anxiety and depression in adulthood. We are working to change this narrative by supporting youth through transition and building them as self-advocates who are aware of their health and needs and feel confident in their ability to interact with their doctors and manage their own care. By matching our patients (mentees) with mentors (medical and graduate students), we hope that these supportive mentoring relationships will empower them with the confidence, skills, and resources they need to live well with epilepsy. Over the year, I have worked on building structure and sustainability within the program so that it can more efficiently and effectively carry out our mission. This has included designing training backed by evidence-based mentoring, recruiting volunteers, creating a leadership structure so the program can be sustainable, implementing evaluation measures, and finding ways to help the program grow and reach its full potential. From building community within the mentor body to creating spaces for healthy socialization for patients and mentors, I have also worked on maximizing opportunities for mentors and mentees to impact each other in a meaningful way. In addition to the mentorship program, my work has also included the creation of a youth council. I felt that it was important for us to give our young patients a safe space and opportunity to use their voices. As young leaders, they will also provide feedback that will help us improve the way we serve our patients. It has been such a privilege to recruit and work with young people who are passionate about spreading epilepsy awareness, supporting their peers, and helping people, particularly newly diagnosed patients, feel less alone. How does your service combat poverty and racial inequality at BMC and/or in the Boston community? Boston Medical Center is a safety net hospital that is committed to serving all patients regardless of their insurance status or ability to pay. Most of our patients come from underserved populations and identify as racial or ethnic minorities. This includes a large population of immigrants and a third of patients who don’t speak English as a first language. For many of our patients, it is incredibly difficult to receive the healthcare they need. A large majority of our patients and families face social, economic, and geographic barriers in accessing everyday care. Getting early access to specialty care, such as epilepsy services, is even harder. Working in a medical setting, one important element of the fight against poverty is the issue of health and healthcare disparities. Racial and ethnic minorities are consistently more likely to suffer worse health outcomes and experience a lower quality of life, in part because they face a greater burden of poverty, fueled by systemic forms of oppression. This puts them at a socioeconomic and geographic disadvantage. In the case of epilepsy, individuals with low socioeconomic and minority status are more likely to experience challenges such as unemployment, housing insecurity, access to quality education, and insufficient medical services. Today, black and brown CYE are more likely than their white peers to receive care in an emergency room rather than in a scheduled appointment with a neurologist. Within TECC, we are working to combat these issues via telehealth strategies, as well as supporting transitioning youth starting at an early age, so that they are prepared to face these challenges and care for their health as adults. Our mentorship program aims to secure better health outcomes for underserved youth by connecting them with people, experiences, and resources that will help them gain necessary knowledge and skills, build confidence in their ability to manage their health independently and advocate for their social and medical needs. Throughout the year, I’ve had the privilege of seeing even small impacts that the program has had on our patients. In one case, a 20-year-old mentee expressed that his frequent meetings with his mentor helped him feel more socially connected, and that he was grateful to have his mentor to talk to. When his provider shared this with me, she expressed that the work mentors were doing was truly making a difference for patients. On many different occasions, I’ve had the opportunity to hear our providers talk about the success of a meeting with a patient and their assigned mentor, sharing that the mentor and mentee connected so well with each other and were “a perfect match.” It’s wonderful to see that we have a strong community of advocates who are supporting our CYE so that they can lead the healthy, connected, and secure lives they deserve. Why share your story? When my family and I immigrated to the U.S., we didn’t have access to medical care. We didn’t qualify for healthcare benefits and couldn’t afford medications for my sister, who constantly had seizures that disrupted her daily living and well-being. Unfortunately, this is not a unique story-- there are so many people who are trapped in similar circumstances. My family and I have been very fortunate, and even as I sit here and tell my story, I am reminded that not everyone gets that privilege. I want to share my story because it speaks to why we should never stop fighting to make “healthcare is a right, not a privilege” our reality. I think it is important, now more than ever, to address the racial injustice and poverty that we see in this country. Right now, we're in a pandemic and seeing Black communities get hit so much harder by COVID-19. For many people, these kinds of disparities are new and shocking. Why are Black and Latinx individuals dying from a disease at a higher rate than white people? We are not spending enough time talking about the fundamental issues behind these trends. We all know that this country has a long history of racism and oppression. However, many of us don’t acknowledge the fact that racism is still incredibly prominent in this country today, and that it continues to make black communities more vulnerable to whatever hurricanes, recessions, and viruses we face. Right now, Black people are dying and getting hospitalized at higher rates, not because of their individual actions, but because of the circumstances they have been subjected to. Many don’t have adequate healthcare access or have lived in harmful environments that have subjected them to pre-existing conditions, which in turn, make them more susceptible to COVID. That’s not a coincidence. There are objective, systemic issues that are causing these trends. Systemic racism is everyone’s business. Now more than ever, we need to educate ourselves and each other about how to be a part of the solution. I wanted to share my story because I’ve had the privilege of working in a community that is doing exactly that. BMC is a leader in advocating for and with Black and Brown communities, and it’s important that others see that and follow suit. On a different note, I also wanted to share my story because I believe in the power of diversity and representation. As much as the stories we share allow us to reflect on our own experiences, I’ve learned that they can also serve as a source of inspiration for others who are searching for their passion, or just need a push or extra dose of encouragement. I think it’s important that we continue to share AmeriCorps VISTA stories that attract a generation of volunteers even more diverse than the last. What do you wish people understood about the connection between poverty and racial injustice, particularly in healthcare? I wish more people understood that poverty and racial injustice in healthcare are all interconnected. It’s such an important concept and truth that we all need to understand. People make the mistake of thinking that everyone who is poor and not healthy brought it on themselves, that it's their fault they’re in those circumstances. The reality is that these circumstances are a compounded result of racist systems that are impacting various areas of people’s lives. If you live in a food desert or neighborhood that lacks sufficient supermarkets, you have fewer or no options for healthy food. If you live in an area that doesn’t have adequate medical facilities, you’re not going to receive the quality healthcare you need. Over time, your health may start to deteriorate, and you may develop conditions that require expensive medical visits. If you’re from a low-income sector and not able to pay for the expensive medical visits, or are un/under-insured, you acquire debt and become more impoverished. It's a cycle. It’s not that you don’t care about your health, but rather that you’re put in a position where you don’t have the funds or resources to seek help or take care of yourself. The connection between poverty and health - it's such a deep connection that we need to spend more time talking about. How has this impacted how you view this issue or your overall world view regarding racial injustice? It has reminded me that there is still a lot of work to be done. In college, I studied a major called Medicine, Health, and Society (MHS), and it truly opened my eyes to the social, cultural, and historical context of the injustice that we see today. But even after studying MHS for 4 years, I feel like I barely scratched the surface on the depth of these issues. Sometimes it feels scary to raise the red flag and push for what many see as uncomfortable conversations about racial injustice. I’m now more confident and aware that not only do we need more conversations, but we also need a lot more action. As I begin medical school, I hope to keep these conversations at the forefront of my thinking and continue learning and growing so that I can be a part of the solution too. Previous Infusing Data into the Corporation for National and Community Service Next Pandemic in Navajo Nation has AmeriCorps members adapting to serve community members in need Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2020-08-25/luwi-shamambo-americorps-vista-fighting-poverty-and-racial-injustice-healthcare",
    "https://www.bmc.org/",
    "https://www.bmc.org/pediatrics-neurology/epilepsy/resources",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2020-08-25/luwi-shamambo-americorps-vista-fighting-poverty-and-racial-injustice-healthcare&amp;title=Luwi Shamambo: An AmeriCorps VISTA Fighting Poverty and Racial Injustice in Healthcare ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2020-08-25/luwi-shamambo-americorps-vista-fighting-poverty-and-racial-injustice-healthcare&amp;title=Luwi Shamambo: An AmeriCorps VISTA Fighting Poverty and Racial Injustice in Healthcare &amp;source=https://americorps.gov/blogs/2020-08-25/luwi-shamambo-americorps-vista-fighting-poverty-and-racial-injustice-healthcare",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2020-08-25/luwi-shamambo-americorps-vista-fighting-poverty-and-racial-injustice-healthcare&amp;url=https://americorps.gov/blogs/2020-08-25/luwi-shamambo-americorps-vista-fighting-poverty-and-racial-injustice-healthcare&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2020-08-05/infusing-data-corporation-national-and-community-service",
    "https://americorps.gov/blogs/2020-09-03/pandemic-navajo-nation-has-americorps-members-adapting-serve-community-members-need",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2020",
  "subdomain_2": "08",
  "subdomain_3": "25"
}