{
  "id": "americorpsgov_blogs_2024_05_31_aging_well_america_powered_connectionhtml",
  "url": "https://americorps.gov/blogs/2024-05-31/aging-well-america-powered-connection",
  "title": "aging-well-america-powered-connection",
  "content": "Aging Well in America is Powered by Connection | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Aging Well in America is Powered by Connection Submitted by eschneider on Fri, 05/31/2024 - 09:25 May 31, 2024 Ramsey Alwin, President and CEO, National Council on Aging We all aspire to have fulfilling lives well into old age, staying socially connected and contributing to our communities. Yet aging in America comes with its own set of realities, bringing opportunities for growth, connection, community, and, at times, challenges. At the National Council on Aging, we believe that aging well with security, dignity, and purpose is powered by connection. Connection is at the heart of aging well. Social connections provide emotional support, reduce feelings of isolation, and contribute to overall health and well-being. Research shows that strong social ties can improve physical health, enhance mental health, and even extend the length of our lives. Maintaining connections as we age is crucial. Recognizing Older Americans Month Every May, we celebrate Older Americans Month, a time to honor and recognize older Americans' contributions, highlight aging trends, and reaffirm commitments to serving the older adults in our communities. The theme this year is “Powered by Connection,” which recognizes the profound impact that meaningful relationships and social connections have on our health and well-being—and the vital role connectedness plays in supporting independence and aging in place. At NCOA, we also want to celebrate the incredible role of the aging network service providers, including AmeriCorps Seniors grantees and volunteers, in creating and powering connections. Making Connections Possible We have a comprehensive network of organizations at the national, state, tribal, and community levels that are critical to the planning and implementation of successful programs that promote healthy aging and economic security. Many of these are formally supported by federal agencies such as AmeriCorps and the Administration for Community Living. We advocate to strengthen and expand the programs we rely upon to age well—Social Security, Medicare, Medicaid, the Older Americans Act, and AmeriCorps Seniors. We also applaud the work of the aging network professionals administering the programs designed to foster connection and support aging well regardless of socioeconomic status, race or ethnicity, gender, sexual orientation, or ZIP code. Our key priorities are: Supporting service and connection: NCOA fully supports investing in redeploying the vast human capital of older adults to help address many of our societal challenges while providing a stipend. NCOA recommends full funding and leveraging of programs such as the AmeriCorps Seniors programs – Senior Companion Program, Foster Grandparent Program, and RSVP – as well as expanding successful demonstrations. These programs provide important opportunities for individuals 55+ to contribute wisdom, experience, and expertise to their communities, and they build bridges between the generations. We need to expand access to these time-tested and proven strategies. Investing in community living and connection: As we approach the 60th anniversary of the Older Americans Act, NCOA continues to prioritize the needs of our nation’s aging population and strengthen the mechanisms that support their well-being so that aging remains a period of dignity, vitality, and opportunity for all of us. This year, when the law is up for reauthorization, NCOA aims to provide a roadmap for advancing the mission of improving the lives of older adults by embracing the lessons from the COVID-19 pandemic, with a particular focus on historically marginalized demographic groups such as women, people of color, low-income individuals, LGBTQIA+ older adults, and those who live in rural areas. We also must: Strengthen and expand parity among the equally important senior nutrition programs, that provide connection, such as the congregate meal and home delivery programs. Invest in elevating senior centers as the hubs of well-being and social connection that they are. Strengthen and expand access to evidence-based health promotion programs that have a real impact on physical health and social connection. Expand access to the Senior Community Service Employment Program, which offers training and job opportunities to help older adults stay active in the workforce and achieve financial stability. The job training and placement at community service assignments provide an opportunity to refresh skills and deepen community connection. The Role of Technology In today's digital age, technology plays a significant role in maintaining connections. From video calls with family to online communities and support groups, technology offers new ways for older adults to stay connected. One silver lining of the pandemic has been the wider adoption of technology by older adults to stay connected with their loved ones. Many quickly learned how to get on video call applications, ensuring they were not isolated. But we saw inequities at play. Many older adults don’t have access to this technology. There is a high need for digital support and literacy among older adults, especially low-income and rural individuals, who often lack the hardware, software, broadband, and digital skills to benefit from this shift. This is where AmeriCorps Seniors can play an important role—teaching older adults to successfully and safely navigate the virtual world. We can provide resources and training to help older adults embrace these technologies, ensuring all remain connected in a rapidly changing world. Reframing Aging: A New Perspective One reality that can prevent us from deepening our connections is the damaging impact of all the “isms.” As we focus on older Americans this month, ageism comes to mind in particular. It is one of the last “isms” we have yet to address as a society. The World Health Organization asked Becca Levy, a professor at the School of Public Health and the psychology department at Yale University, to lead an analysis of the effects of ageism. She found it led to worse health because older adults are denied care, fewer work opportunities because they are not considered or hired, a negative self-perception, and overall devalued lives. She even estimated that internalized ageism, or negative beliefs about growing older, shaves 7.5 years off a person’s life expectancy. This is unacceptable and counter to what we know about what is possible thanks to so many powerful community programs. AmeriCorps Seniors demonstrates how straightforward it is to break down negative stereotypes and myths about older adults. Our older adult volunteers help a struggling child learn to read. They deliver groceries to a homebound neighbor. They support a family impacted by natural disasters. These volunteers show the world that growing older does not mean we no longer have value. As a national partner and supporter of the Reframing Aging movement, we know it is about changing the way we think and talk about aging. Instead of seeing aging as a period of decline, we focus on the strengths, contributions, and resilience of older adults. This new perspective helps society value older adults for their wisdom, experience, and diverse viewpoints, clearing the path for us to connect with each other without the limitation of preconceived notions. Looking Ahead This year, more than 11,000 Americans are turning 65 every single day – a population higher than ever before. It is paramount that we work collectively across sectors to build our capacity and keep us all connected as we age. We know aging well in America is about more than physical health—it's about emotional well-being, financial security, and social engagement. By embracing the principles of Reframing Aging and focusing on investing in connection, we can create a society where we are all valued, supported, and empowered to live our best lives as we age. At NCOA, we are committed to making this vision a reality, one connection at a time. Through programs like those supported by AmeriCorps Seniors and the Older Americans Act, we are building a stronger, more connected community for all older adults. This Older Americans Month and beyond, let’s celebrate the incredible contributions of older adults and, as a network of committed aging network professionals, continue to work toward a future where aging well is accessible to everyone. Ramsey Alwin is the President and CEO of NCOA. She is a thought leader and policy advocate who is leading a nationwide movement to ensure equitable aging for every American. Previous AmeriCorps Seniors: Connecting AmeriCorps Senior Volunteers to Transportation Resources Next AmeriCorps 30: My Pathway from Service to Higher Education Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2024-05-31/aging-well-america-powered-connection",
    "https://https//www.ncoa.org/page/ramsey-alwin%C2%A0[SD1]",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2024-05-31/aging-well-america-powered-connection&amp;title=Aging Well in America is Powered by Connection ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2024-05-31/aging-well-america-powered-connection&amp;title=Aging Well in America is Powered by Connection &amp;source=https://americorps.gov/blogs/2024-05-31/aging-well-america-powered-connection",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2024-05-31/aging-well-america-powered-connection&amp;url=https://americorps.gov/blogs/2024-05-31/aging-well-america-powered-connection&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2024-05-28/americorps-seniors-connecting-americorps-senior-volunteers-transportation",
    "https://americorps.gov/blogs/2024-06-17/americorps-30-my-pathway-service-higher-education",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2024",
  "subdomain_2": "05",
  "subdomain_3": "31"
}