{
  "id": "americorpsgov_blogs_2021_10_26_americorps_research_grantee_americorps_member_helps_west_philadelphia_graduatinghtml",
  "url": "https://americorps.gov/blogs/2021-10-26/americorps-research-grantee-americorps-member-helps-west-philadelphia-graduating",
  "title": "americorps-research-grantee-americorps-member-helps-west-philadelphia-graduating",
  "content": "AmeriCorps Research Grantee and AmeriCorps Member Helps West Philadelphia Graduating Class Keep Going | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps Research Grantee and AmeriCorps Member Helps West Philadelphia Graduating Class Keep Going Submitted by eschneider on Tue, 10/26/2021 - 13:15 Oct 26, 2021 Devin Welsh and Rachel Wenrick It was the middle of June 2021, and the sun just set, giving way to a deep, dark blue sky. Portraits of Paul Robeson High School’s Class of 2021 were visible, shining brilliantly, projected onto Drexel University’s Nesbitt Hall. The seniors’ portraits were paired with their written reflections about who helped them through the year and what they hope their futures hold. I was standing beside Principal Gordon and just in front of us is Muawiyah, a Robeson graduate, as we watched the portraits and writings of members of his class fade in and out on the building in front of us. Spread across the lawn were folks I hadn’t seen in person for over a year: ArtistYear AmeriCorps colleagues, friends, neighbors, and co-creators from the Writers Room , Drexel University’s community literary arts program. We came together to celebrate the students I worked with as an ArtistYear AmeriCorps fellow at the West Philadelphia high school. Dejah, a 2019 Robeson alumnus and practiced portrait artist, came back to the school in February to help with the shoot. As a senior at Robeson, Dejah had previously worked with another ArtistYear Fellow and Drexel alumna Jasmine, as part of Writers Room’s TRIPOD program, a writing and photography project sponsored by Canon. Since 2017, TRIPOD brought Drexel undergraduates like Jasmine and me, local high school students like Dejah, and elders in the community together with other socially engaged artists and scholars to work toward social change. When Writers Room member Carol and her family were displaced after her building was converted to student housing, students like me and Drexel faculty saw how precisely implicated we are in one another’s story. Our documentation and analysis work we engaged in as artists in that first year of TRIPOD lent itself to the work of a community-led participatory action research study of gentrification with Drexel’s School of Education and support from AmeriCorps. Our diverse collective of writers ages 18-80 worked together as researchers and artists to examine the pervasive problems of housing insecurity that threaten communities across the country. This work has led to the development of Second Story Collective , a creative concept for co-living where shared space and shared interest in storytelling sets the foundation for meaningful intergenerational cohabitation. Having been a part of this work throughout my undergraduate education at Drexel, I had the good fortune to work alongside Writers Room alumni who had graduated into a year of service with ArtistYear, like Jasmine, and with their students, like Dejah. When I graduated in 2020, amidst a global pandemic that highlighted the extant inequities in our society and social uprisings that demanded justice for the murders of many, including Ahmaud Arbery, Breonna Taylor, and George Floyd, the only logical step in my mind was to follow the path set by my peers—a year of national service. Continuing the work of the last three years—learning alongside my neighbors and Robeson students and co-creating art that addresses the issues confronting our community—was the only thing I could imagine doing. Though the pandemic persisted, so did our work. Over the course of my year as an AmeriCorps member at Robeson, I integrated the arts into existing curricula and crafted new lessons with partner teachers to make space for creative expression. I worked closely with four students, Amina, Lyric, Tariq, and Ciani in TRIPOD as we dove deeper into study along with other writers from Drexel, YouthBuild students, faculty, and community members. Zooming from our homes, we explored the history of co-living and affordable housing, and how to can make our vision for a shared living community a reality. Last summer, I worked with Carol in her role as community researcher. She taught Writers Room members the skills we needed to interview people about living through the pandemic. With Carol’s insights and expertise, I helped my Robeson students develop questions to reflect the stories they wanted to tell about their senior year. During one of our sessions, Carol reminded me that we don’t want to make light of what people have gone through, but we do need to be able to celebrate. Previous Next “But We Keep Going” brought some celebration back to the Robeson Class of 2021 who had missed out on much of what makes the end of high school so special. Over the quiet hum of the projector, Principal Gordon tells me about each of the students as their faces illuminate and transform the brick façade of the building. He tells me stories of when they first arrived at Robeson and his hopes for them as they go out into the world. Just then, Muawiyah’s text fills the wall before giving way to his image. A few moments pass before he turns toward me and his silhouette is brightened by the light of the projector. As we shake hands I ask, “What do you think?” He turns to see his portrait one more time before it fades to the next student, and says through a smile, “it’s pretty amazing.” Devin Welsh will be returning to Paul Robeson High School for 2021-22, serving as an ArtistYear AmeriCorps Senior Fellow. He plans to attend graduate school to study the sociology of education. Rachel Wenrick is the associate director of Drexel University’s Writer’s Room. The AmeriCorps Research Grantee project brings together university faculty, community residents, students, and alumni to investigate the landscape of residential displacement and affordable housing options in the rapidly gentrifying and federally designated West Philadelphia Promise Zone. Previous Wearing the AmeriCorps 'A', Hispanic and Latino Americans Show America at its Best Next The SCALER Tool: Boost your Community Organization’s Impact Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2021-10-26/americorps-research-grantee-americorps-member-helps-west-philadelphia-graduating",
    "https://artistyear.org/",
    "https://drexel.edu/coas/coop-experience/writers-room/",
    "https://secondstorycollective.org/",
    "https://www.writersroomdrexel.org/but-we-keep-going-robeson-21-voices-portraits",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2021-10-26/americorps-research-grantee-americorps-member-helps-west-philadelphia-graduating&amp;title=AmeriCorps Research Grantee and AmeriCorps Member Helps West Philadelphia Graduating Class Keep Going ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2021-10-26/americorps-research-grantee-americorps-member-helps-west-philadelphia-graduating&amp;title=AmeriCorps Research Grantee and AmeriCorps Member Helps West Philadelphia Graduating Class Keep Going &amp;source=https://americorps.gov/blogs/2021-10-26/americorps-research-grantee-americorps-member-helps-west-philadelphia-graduating",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2021-10-26/americorps-research-grantee-americorps-member-helps-west-philadelphia-graduating&amp;url=https://americorps.gov/blogs/2021-10-26/americorps-research-grantee-americorps-member-helps-west-philadelphia-graduating&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2021-10-14/wearing-americorps-hispanic-latino-americans-show-america-its-best",
    "https://americorps.gov/blogs/2021-11-09/scaler-tool-boost-your-community-organizations-impact",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2021",
  "subdomain_2": "10",
  "subdomain_3": "26"
}