{
  "id": "americorpsgov_about_agency_overview_digital_strategyhtml",
  "url": "https://americorps.gov/about/agency-overview/digital-strategy",
  "title": "digital-strategy",
  "content": "Digital Strategy | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb About Agency Overview Digital Strategy Agency Overview Agency-Wide Policies and Notices AmeriCorps Fraud Alert AmeriCorps’ Equity Action Plan Budget and Performance Plans Civil Rights for Employees, Service Members, and Volunteers Digital Strategy Disability and Accessibility Federal Register Notices FOIA and the Privacy Act No FEAR Act Open Government Plain Writing Privacy Policy Results of Grant Competitions Statutes and Regulations Strategic Plan Vulnerability Disclosure Policy Digital Governance Plan The goal of AmeriCorps’ IT governance division is to align IT activities and system implementation efforts with the agency’s strategic direction. Through AmeriCorps’ Digital Governance Plan, the agency makes effective and efficient use of IT resources – including public web sites and digital services – to support our mission. Our IT governance process is rooted in IT management best practices that allow us to align IT investments with agency strategic goals, support stakeholder involvement, identify and manage investment risk, and comply with legal and policy requirements. The key elements of AmeriCorps’ Digital Governance Plan are summarized in the sections below. IT Governing Boards AmeriCorps’ Chief Information Officer (CIO) has chartered three primary IT governing boards that to support the agency’s overall governing structure and Enterprise Risk Management program. The boards include: Investment Review Board (IRB): Composed of the Chief of Staff (chair), Chief Operations Officer, Chief Financial Officer, Chief Human Capital Officer, Chief Risk Officer,  and Chief of Program Operations, this senior governance body is the primary means through which the agency business and IT leadership deliberate to: Define business and IT strategic priorities and direction required to achieve AmeriCorps mission and objectives Make all IT-related budgetary decisions Prioritize business needs and IT investments and allocate funding across the IT portfolio Assess IT portfolio performance and address issues escalated by the Technology Review Board (TRB) Technical Review Board (TRB): The TRB is chaired by the Deputy CIO and includes the Office of Information Technology (OIT) subject matter experts from various IT disciplines. The TRB provides technical assistance and consultation to IT project managers. Voting members conduct IT investment/project/system development milestone reviews. Production Change Control Board (PCCB): The PCCB is chaired by the OIT Governance and Oversight Manager and is composed of key agency IT stakeholders. It is the technical body responsible for reviewing and approving changes to AmeriCorps’ production IT environment. PCCB approval is required for a system or project to become operational.. IT Governance Policy and Plans Toggle AmeriCorps’s IT governance and execution requirements are established in official Agency policy, processes, and procedures: Information Technology Management Policy: Establishes AmeriCorps’ policies, programs, and procedures for IT management. The policy covers ten integrated functional areas of IT management that support the agency’s key business activities and outlines IT roles and responsibilities. Information Technology Governance Policy: Establishes AmeriCorps’ IT governance policy and processes for efficient, effective, ongoing IT investments and programs. It guides the agency in aligning IT activities with its strategic direction and program needs and sets forth oversight of IT systems’ implementation. IT Capital Planning and Investment Control Policy: Establishes the framework and processes to select, control, and evaluate IT investments to ensure they are aligned with business strategy, are coordinated across the agency, and are executed to maximize value and minimize risk. Systems Development Lifecycle Policy: Sets forth policies and procedures that AmeriCorps employees and contractors must follow when they procure, develop, implement, operate, and dispose of IT systems, including websites and applications. This includes requirements for IT project milestone reviews. Data Management Policy: Sets forth roles and responsibilities of the AmeriCorps offices and personnel involved in data and information management. The policy guides the offices as they plan, collect, process, disseminate, share, safeguard, and evaluate data and information, and establishes requirements for regularly assessing the quality of AmeriCorps data and information. IT Governance Execution Toggle AmeriCorps’s Office of Information Technology is responsible for executing agency IT functions, delivering IT services, and administering the IT Governance Program. OIT maintains IT policies, procedures, and plans; staffs IT governance bodies and enforces compliance; and facilitates IT processes. Three IT governance elements interlink: The IT Strategic Plan and Enterprise Architecture Plan document strategic and tactical direction for the IT Program. IT policies, processes, and procedures define how the IT organization and its program partners execute the IT plans and establish IT management control points throughout the IT service lifecycle. The boards oversee strategic and tactical IT direction, and are positioned at multiple levels in the agency to ensure effective IT change and risk management. IT Governance Memorandums Toggle AmeriCorps Office of Information Technology Completes Transition to Internet Protocol version 6 (IPv6) September 30, 2021 Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/about/agency-overview/digital-strategy",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/AmeriCorps-IPv6-Memo-09302021.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "about",
  "domain": "about",
  "subdomain_1": "agency-overview"
}