{
  "id": "americorpsgov_blogs_2019_05_29_building_service_look_back_2017_cncs_evidence_based_intervention_planning_grantshtml",
  "url": "https://americorps.gov/blogs/2019-05-29/building-service-look-back-2017-cncs-evidence-based-intervention-planning-grants",
  "title": "building-service-look-back-2017-cncs-evidence-based-intervention-planning-grants",
  "content": "Building Service: A Look Back at the 2017 CNCS Evidence-based Intervention Planning Grants (Part 3) | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Building Service: A Look Back at the 2017 CNCS Evidence-based Intervention Planning Grants (Part 3) Submitted by admin on Wed, 05/29/2019 - 14:26 Mar 13, 2019 Greg Tucker Earlier this year, the CNCS Office of Research & Evaluation (ORE) introduced recipients of the 2017 AmeriCorps State and National Evidence-based Intervention Planning Grants from the Corporation for National and Community Service (CNCS). At the start of the summer, we checked in with the grantees to get the latest scoop on their program planning and see what lessons they learned along the way. By now, most of the grantees’ planning periods have come to a close. For some, program development will carry on through continued efforts, while others have compiled their findings, which provide valuable guidance for other organizations seeking similar types of grants. With that, we conducted a final follow up with the grantees to hear about their latest program development updates, overall experience with their grants, and what’s next. Appalachian Regional Coalition on Homelessness Appalachian Regional Coalition on Homelessness (ARCH) continued working with the Substance Abuse and Mental Health Services Administration (SAMHSA) to plan a coordinated entry system – a streamlined platform for housing the most vulnerable homeless people first. Through the system, AmeriCorps members provide services to homeless and economically disadvantaged populations in Northeast Tennessee. That planning was made possible thanks to the CNCS grant, and ARCH has since connected with the United Way to proceed with implementation. Appalachian Regional Coalition on Homelessness Toward the end of the planning grant, ARCH focused on seeking a new grant opportunity to get its program off the ground for fiscal year 2018-2019. The planning grant enabled ARCH to connect with all of the service providers, eventually leading them to the United Way organizations, where the team was able to educate them about the Housing First program model and how AmeriCorps members can be involved. With five members ready to begin the program back in August, ARCH was working through some back-end challenges with the AmeriCorps portal. An employee departure at the time left the ARCH team to navigate the portal themselves until its new AmeriCorps Development Coordinator was hired, so it was a slower process to onboard the AmeriCorps members. Still, ARCH was pleased with what the CNCS grant allowed them to accomplish. It provided an opportunity to incorporate AmeriCorps members into the Department of Housing and Urban Development-mandated Housing First model while giving them time to learn as much as possible about the planned program. ARCH recommends that all grantees explore the CNCS website and attend all training sessions, as they provide invaluable information. Most recently, Volunteer Tennessee, which began its program on Sept. 15, funded ARCH for FY18-19. Artesian Schools Using the Talent Search youth development program as a foundation, Artesian Schools, Inc., (Artesian) finished its initial planning grant to build a program that leverages AmeriCorps programs as mentors to tutor disadvantaged high school students in academics, career planning, and financial counseling. Artesian Schools logo Toward the end of the grant, Artesian hired a new principal, who reviewed data from separate Talent Search implementations to identify potential adjustments to how the tutoring is delivered and its curriculum. Artesian also partnered with an instructional consulting group that helped them determine the best use of tutoring time. The goal of the tutoring is not just to build missing skills, but also to “scaffold up” the knowledge students need to fully comprehend and apply what they’re learning. At the same time, Artesian worked on the mentoring aspect of its program, which is separate from tutoring and ensures a cohesive experience. Although the team is using Talent Search as a foundation, Artesian is adapting the intervention and customizing its own program to address the unique needs of its students. This is simultaneously an opportunity and challenge. Artesian has the chance to make something new and different – a program that could then be the model for the county, Tennessee, and the nation as a whole. At the same time, it requires significant buy-in and contribution from Artesian staff, which means maintaining enthusiasm and gathering feedback are significant priorities. Artesian was very appreciative of the opportunity to participate in this planning grant, especially the focus on the evaluation aspect, as it wasn’t something the team might have thought about as early in the program development. Looking to the future, the team received another AmeriCorps grant back in August, which has allowed them to continue tweaking the member experience this semester and plan for the following one. Association of Clinicians for the Underserved Since the last update, Association of Clinicians for the Underserved (ACU) focused on further refining and strengthening its proposed program, which trains AmeriCorps members as patient “connectors” that provide patient-centered interventions such as case management assistance with coverage enrollment. ACU held a web-based meeting with its field partners to gather their feedback. It was an affirming moment, as the partners reported that the intent of the program, its interventions, and the proposed community support hit all the right notes with their expectations. That said, ACU continued to collect feedback from partners for further planning and potential improvements. Association of Clinicians for the Underserved ACU then turned its attention to confirming the details of the model with its program officer and ORE, who they met with throughout the entire grant process. One of ACU’s priorities during the grant was to make sure the team was confident in the program design, so they could translate it to a strong program on paper and submit it for official review. Focusing heavily on program design and model would also enable ACU to dive back into work with little disruption once the notice of funding opportunity was release for the next application cycle. Overall, ACU described its experience with the evidence-based planning grants as eye-opening in terms of the steps to build a program. One of the challenges it faced throughout the process was understanding the AmeriCorps program structure and terminology, which were essential for designing a program that fit within AmeriCorps. The team recommends that any future grantees be prepared to hit the ground running and reach out to everyone in the AmeriCorps community for recommendations on planning a program with members. While it can feel a bit overwhelming at first, ACU was grateful for the Knowledge Network, current grantees, and its program officer for the support to make its program design successful. In September, ACU successfully completed its planning grant period and submitted its grantee progress report. The team did not seek additional funding opportunities. Campus Compact of the Mountain West Throughout the evidence-based planning grant, Campus Compact of the Mountain West (CCMW) spent considerable time building potential partnerships that were essential to its Civic Futures program that supports students, kindergarten through higher education (K2H). K2H Civic Futures seeks to work with these partners to organize education teams that enhance civic learning and engagement in students. Through these partnerships, CCMW built a strong pipeline of contributors and facilitators for its Civic Futures program. Campus Compact of the Mountain West CCMW was in a unique position. While in the midst of its planning grant, CCMW also applied for – and eventually received – full funding for program implementation. However, the approval for funding came two months later than expected, which presented additional challenges during that period of uncertainty. The Civic Futures partners include K-12 principals, faculty, engagement staff, school counselors, and teachers; all of whom committed time and energy to the program development, so CCMW wanted to make sure their time and energy were honored, regardless of funding outcome. It also meant keeping these partners and the internal team focused and motivated to continue work, so they were ready to proceed at a moment’s notice. Still, CCMW found the time of the planning grant to be invaluable. As one employee at CCMW put it: “I seriously believe that planning grants should be part and parcel of any new national service program to allow for in-depth program planning, evaluation planning, and partnership development.” The team encouraged other grantees to ask as many questions as possible to CNCS research and evaluation staff to get a firm understanding about expectations and possibilities around research and evaluation for CNCS programs. Toward the end of the grant, CCMW worked with faculty in Research Methods and Information Science at the Morgridge College of Education at the University of Denver to design and implement a comprehensive evaluation of the Civic Futures program. Since then, CCMW has finalized all of the partnerships for its Civic Futures program. More recently, it is working to recruit AmeriCorps members for all of the partnership sites, provide orientation and training to members and site supervisors, and ultimately get the program off the ground. CCMW is looking forward to the grant cycle and making some headway with civic learning and engagement initiatives across the region. Children’s Forum (The Forum) The Children’s Forum (The Forum) had a busy couple of months as it wrapped up work on its program to train AmeriCorps volunteers to serve as coaches for early learning programs. In that time, it developed and refined a projected budget for the program, prepared a plan for member orientation and training, and outlined a detailed logic model that incorporates intervention, assessment, and data collection components into the program. The Forum also continued to engage its advisory team members as well as other community and state partners to inform the program development efforts. Children’s Forum As the grant came to an end, The Forum focused its attention on the feasibility of recruiting diverse individuals to serve in the early learning program, as building the diversity in this area was an overarching goal of theirs. The team also worked to determine how to pilot its intervention model in steps in order to estimate the likelihood of success. One of the biggest opportunities from the grant was the ability to work with community and state partners. The Forum appreciated the support and insight provided by those partners, which also helped reinforce the need and importance of such an early learning model. At the same time though, the inclusion of so many partners presented challenges, as it became difficult to bring all of them together to work on the program. Despite that challenge, The Forum still recommends other grantees engage a broad group of community partners to secure buy in and support. At the end of the grant, The Forum was looking to make more progress in selecting communities to participate in its program before it moved to piloting its program. The Forum felt that ensuring those communities have an engaged and diverse workforce will allow it to be most successful in meeting the goals and objectives of the program. Although the Forum is no longer participating in a grant, it is continuing to evaluate and seek funding opportunities for the future. Previous How America's Future is Being Made in AmeriCorps Next More True Tales of Lives and Futures that were #MadeInAmeriCorps Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2019-05-29/building-service-look-back-2017-cncs-evidence-based-intervention-planning-grants",
    "https://nationalservice.tumblr.com/post/171134513797/building-service-a-look-into-cncs-research",
    "https://nationalservice.tumblr.com/post/174475301697/building-service-a-look-into-cncs-research",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2019-05-29/building-service-look-back-2017-cncs-evidence-based-intervention-planning-grants&amp;title=Building Service: A Look Back at the 2017 CNCS Evidence-based Intervention Planning Grants (Part 3)",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2019-05-29/building-service-look-back-2017-cncs-evidence-based-intervention-planning-grants&amp;title=Building Service: A Look Back at the 2017 CNCS Evidence-based Intervention Planning Grants (Part 3)&amp;source=https://americorps.gov/blogs/2019-05-29/building-service-look-back-2017-cncs-evidence-based-intervention-planning-grants",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2019-05-29/building-service-look-back-2017-cncs-evidence-based-intervention-planning-grants&amp;url=https://americorps.gov/blogs/2019-05-29/building-service-look-back-2017-cncs-evidence-based-intervention-planning-grants&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2019-05-29/how-americas-future-being-made-americorps",
    "https://americorps.gov/blogs/2019-06-03/more-true-tales-lives-and-futures-were-madeinamericorps",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps State and National",
  "focus_population": [
    "Schools",
    "Urban"
  ],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2019",
  "subdomain_2": "05",
  "subdomain_3": "29"
}