{
  "id": "americorpsgov_blogs_2024_11_07_supporting_giving_back_our_nations_veteranshtml",
  "url": "https://americorps.gov/blogs/2024-11-07/supporting-giving-back-our-nations-veterans",
  "title": "supporting-giving-back-our-nations-veterans",
  "content": "Supporting and Giving Back to Our Nation’s Veterans | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Supporting and Giving Back to Our Nation’s Veterans Submitted by psleezer on Tue, 11/05/2024 - 10:30 Nov 07, 2024 Matt Benowitz On Veterans Day, AmeriCorps joins the nation to recognize the more than 13,000 veterans who have joined AmeriCorps and AmeriCorps Seniors programs. AmeriCorps member with the VISTA program, Matt, shares why he serves to give back to our hometown heroes who have sacrificed for our country. One frigid night near Billings, Montana, a 70-year-old Vietnam veteran in a small motor home was pushed over the edge. For years, he had struggled with symptoms of Agent Orange exposure, depression, and pessimism about his eligibility for aid. Rising parking costs forced him and his wife to move further from the city where they dealt with plummeting living standards, and now, frozen pipes. Their struggles were never ending. It pushed the veteran to despair. He felt he couldn’t provide what his wife deserved. He felt ashamed. He decided to end his own life. But that’s not the end of this veteran’s story. His life was saved, and as he recovered in a hospital, he found himself in the constant company of Karen Pearson and Mitch Crouse, founders of the Adaptive Performance Center , a health and fitness facility dedicated to eliminating veteran suicide. Like so many others, this veteran had initially joined APC but struggled with the motivation to make it a priority amid all his other life challenges. At the hospital, Karen reminded him of what he had told her when he first joined: that he loved his wife, and that she would not be better off without him. Reminded that APC offered robust support and a safe environment, the veteran was back in the gym four days later. APC moved the couple’s motor home to working utilities. But finding the motivation to forge forward was a work in progress. He stopped his treatment for post-traumatic stress and continued wrestling with suicidal thoughts, but he still went to APC every day. APC helped the veteran file paperwork to claim disability status with the U.S. Department of Veterans Affairs, having finally persuaded him to try. The VA accepted his disability claim, and he was awarded a monthly stipend that was enough for him and his wife to move into an apartment in a beautiful retirement community and begin rebuilding their lives. APC provides a holistic, community-based defense against the contributory factors of suicide. Whether stressors are financial, logistical, medical, or emotional, APC taps into an extensive network to rally resources and care for members in crisis. Considering how difficult it is for veterans to ask for help, it is crucial to understand how APC earns their trust and time. With its gym, classes, mentors, events, and services, including massage and acupuncture, the center fills an understudied gap in services: endowing life with purpose and possibility. The tangible results of exercise fortify resilience against physical or psychological distress, build desire to self-improve, and reignite confidence to fully participate in society. Reflecting on her career in therapy, Karen compares five training sessions to “ten years of talking on my couch.” Veterans cannot see their therapist or doctor every day, so APC is open daily to offer them a safe space to socialize with peers and vent their frustrations. More than 75 percent of members describe suicidal thoughts as “highly reduced,” while 88 percent credit APC with “extremely positive” impact on their mental health a month after joining the program. Since 2020, more than 1,700 veterans have joined one of APC’s two locations in Billings and Helena, Mont. When combining natural activity with camaraderie, tools for reintegration materialize quickly. Shared culture and a sense of belonging are integral. Away from dense crowds or loud noises, veterans feel secure enough to lift weights, address health concerns, and connect with others who understand them. When Mitch and Karen show new members the lounge, with its service flags, patch board, library, pool table, coffee, and puzzles, they hear: “I feel like I’m home.” By training recruits for bootcamp, APC preempts the cycle of despondency and isolation, ensuring veterans know where to seek assistance and solace when they return. When I arrived at APC as a member of AmeriCorps VISTA , I had a lifelong passion for veteran welfare and understanding of socioeconomic conditions of the Mountain West. My grandfather served in the casualties assistance office during the Vietnam War, but was never provided coping mechanisms for the trauma of informing people about their loved one’s death. APC’s potent philosophy - giving veterans space to rediscover their worth - stood out as a vital support program that would help reduce the multigenerational spread of suicide, addiction, and recidivism. Through the Billings Metro VISTA Project at APC, more veterans have access to holistic therapies by providing scholarships. Nearly 15 percent of APC members do not pay the optional monthly fee, but are embarrassed to accept it. With a $5,000 grant I secured from the Billings Community Foundation, 20 low-income veterans were given one year of free access to APC. I assembled a library of academic journal articles on veterans’ issues, to help them find solutions to life challenges of family, employment, suicide prevention, and more. I was even able to organize donor data, to help identify potential opportunities for future fundraisers. In a city with a high veteran population, spreading knowledge of APC programs is critical. Recently, I successfully generated media coverage for APC’s monthly event, Walk the Bridge, that pays tribute to an estimated 22 veterans who die by suicide each day. The APC’s next goal is to open a location in Tulsa, Okla. and to eventually have a location in every state. Because APC streamlines care, provides a reliable venue for veteran outreach, and bolsters quality-of-life, it is a remarkable asset to partner agencies or charities. Opportunities for cooperation and capacity building should be allocated accordingly. Through organizations like APC, Americans are able to support veterans who have laid their lives for our country. It is a privilege to be able to help and empower our nation’s veterans. Previous Next Previous In the Face of Disaster, AmeriCorps Rises to the Challenge Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2024-11-07/supporting-giving-back-our-nations-veterans",
    "https://www.adaptiveperformancecenter.org/",
    "https://americorps.gov/serve/americorps/americorps-vista",
    "https://www.billingsmt.gov/1442/Billings-Metro-VISTA-Project",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2024-11-07/supporting-giving-back-our-nations-veterans&amp;title=Supporting and Giving Back to Our Nation’s Veterans ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2024-11-07/supporting-giving-back-our-nations-veterans&amp;title=Supporting and Giving Back to Our Nation’s Veterans &amp;source=https://americorps.gov/blogs/2024-11-07/supporting-giving-back-our-nations-veterans",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2024-11-07/supporting-giving-back-our-nations-veterans&amp;url=https://americorps.gov/blogs/2024-11-07/supporting-giving-back-our-nations-veterans&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2024-10-31/face-disaster-americorps-rises-challenge",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA; AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2024",
  "subdomain_2": "11",
  "subdomain_3": "07"
}