{
  "id": "americorpsgov_blogs_2023_03_16_americorps_unites_celebration_veterans_serve_because_we_carehtml",
  "url": "https://americorps.gov/blogs/2023-03-16/americorps-unites-celebration-veterans-serve-because-we-care",
  "title": "americorps-unites-celebration-veterans-serve-because-we-care",
  "content": "AmeriCorps Unites in Celebration: Veterans Serve Because We Care | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps Unites in Celebration: Veterans Serve Because We Care Submitted by dsong on Tue, 03/14/2023 - 15:29 Mar 16, 2023 Sean Flachs Nearly 15,000 veterans continue to serve our nation as AmeriCorps members, supporting more than 250,000 fellow service members and military families. During AmeriCorps Week, we say thanks to our veteran AmeriCorps members and alumni like Sean who make a difference in our communities. The transition process out of uniformed military service is often as fast and confusing as the process of joining. Sometimes, joining the military is much easier – there is the honeymoon period of recruitment, and after some physical hardship and a few significant emotional events, we eventually become members of a military community with values like duty, honor, integrity, and selfless service. As a mentor once said early on in my military service, “You must care; you must surround yourself with others that care; and you must strive to inspire that care in others.” AmeriCorps alumnus Sean (second from right) with VFC crew 106 in Arizona People leave the armed service for a variety of reasons, but we carry with us the virtues and the life-changing experiences of working closely to attain a common goal with people from all walks of life. Such experiences often become unknowingly engrained in us. The desire to be magnanimous while serving the nation, accepting all the ups and downs that happen therein, is marrow deep. For many veterans, there remains a strong commitment to the nation and a desire to continue to serve in some capacity – to be selfless, to stand shoulder to shoulder doing hard things, but most of all to care. A new path forward When leaving military service many start to search for their new purpose – their next mission. Many veterans find a new purpose through AmeriCorps programs. AmeriCorps offers a place where our dynamic approach is welcomed. Through national service and volunteerism, veterans can apply skills like leading from the front, facilitating in-step planning, and demonstrating intersectional inspiration. Serving with AmeriCorps often leads to the discovery of new career paths and sustained employment with organizations. It provides the opportunity for a lifetime of selfless service and to work alongside and care for people who may be physically or culturally different but share the common desire of getting things done together. Sean (far right) serving in Arizona with VFC crew 106 This is how I restarted my service to the nation. Eight months after leaving active duty and countless hours of searching, I found the Veteran Fire Corps where I was given the opportunity to care again by lacing up my boots once and directly serve. As an AmeriCorps member, I have seen other veterans find commonality, joy, and comradery in hardship while: working alongside crews on a combined invasive tree removal project in the spring heat of Arizona; learning new skills from seasoned professionals who are dedicated to helping others find employment in the wildland fire community; supporting amazing veteran and non-veteran crew leaders with the difficult task of leading former service members from different military branches and backgrounds; performing fire mitigation in the peaks of Colorado and participating in wildland fire operations throughout the Western United States; sharing “call to service” stories and hearing both veteran and non-veteran members’ unique paths to dirty boot service over a campfire in Texas; and witnessing the dedication of Conservation Legacy program managers who seek the best for all their members – from the first day to years after their service ends. Sean with members of VFC 262 in Colorado We can continue to serve our nation This AmeriCorps Week, I salute and celebrate those currently serving. And for those that have served, I challenge you to never stop caring. Join AmeriCorps Week celebrations Follow AmeriCorps blog series , Facebook , Instagram , LinkedIn , and Twitter to join AmeriCorps Week and Day of the A . About Conservation Legacy , Veterans Fire Corps Conservation Legacy is a national organization dedicated to supporting locally based conservation service programs. The organization offers a wide variety of opportunities, from internships with land management agencies to conservation crews, to the Veterans Fire Corps AmeriCorps crews, and more. Working in partnership with state and federal agencies including the National Park Service, US Forest Service, Bureau of Land Management, Americorps, and others, the Veterans Fire Corps AmeriCorps was established in 2009, recruiting recent-era veterans for wildland firefighting opportunities. Sean was a grateful two term Veteran Fire Corps alumnus, former US Army Engineer, and dedicated advocate for national service, the veteran community, prudent bottom-up refinement, the feel wheel, and the stoic middle way. Sean Flachs passed away in April 2023. AmeriCorps is grateful for veterans like Sean who continued to serve our country. Previous AmeriCorps Unites in Celebration: From Music to Dentistry - AmeriCorps VISTA's Innovative Service Pathways Next AmeriCorps Unites in Celebration: Five Careers You Can Train for in Public Health AmeriCorps Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-03-16/americorps-unites-celebration-veterans-serve-because-we-care",
    "https://www.veteransfirecorps.org/",
    "https://conservationlegacy.org/",
    "https://americorps.gov/newsroom/blog",
    "https://www.facebook.com/americorps",
    "https://www.instagram.com/americorps/",
    "https://www.linkedin.com/company/americorps/",
    "http://twitter.com/AmeriCorps",
    "https://socialpresskit.com/americorpstoolkits%22%20/l%20%22americorps-week-2023",
    "https://conservationlegacy.org/",
    "http://conservationlegacy.org/veterans",
    "https://conservationlegacy.org/veterans",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-03-16/americorps-unites-celebration-veterans-serve-because-we-care&amp;title=AmeriCorps Unites in Celebration: Veterans Serve Because We Care",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-03-16/americorps-unites-celebration-veterans-serve-because-we-care&amp;title=AmeriCorps Unites in Celebration: Veterans Serve Because We Care&amp;source=https://americorps.gov/blogs/2023-03-16/americorps-unites-celebration-veterans-serve-because-we-care",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-03-16/americorps-unites-celebration-veterans-serve-because-we-care&amp;url=https://americorps.gov/blogs/2023-03-16/americorps-unites-celebration-veterans-serve-because-we-care&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-03-15/americorps-unites-celebration-music-dentistry-americorps-vistas-innovative-service",
    "https://americorps.gov/blogs/2023-03-17/americorps-unites-celebration-five-careers-you-can-train-public-health-americorps",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA; Public Health AmeriCorps",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "03",
  "subdomain_3": "16"
}