{
  "id": "americorpsgov_blogs_2021_08_26_when_covid_19_derailed_her_post_graduate_plans_americorps_member_committed_yearhtml",
  "url": "https://americorps.gov/blogs/2021-08-26/when-covid-19-derailed-her-post-graduate-plans-americorps-member-committed-year",
  "title": "when-covid-19-derailed-her-post-graduate-plans-americorps-member-committed-year",
  "content": "When COVID-19 derailed her post-graduate plans, this AmeriCorps Member Committed to a Year of Service and Empowering Women | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb When COVID-19 derailed her post-graduate plans, this AmeriCorps Member Committed to a Year of Service and Empowering Women Submitted by eschneider on Thu, 08/26/2021 - 12:27 Aug 26, 2021 AmeriCorps staff When COVID-19 derailed her post-graduate plans, Alison decided committing to a year of service seemed like a great way to gain valuable work experience, while also satisfying her desire to make an impact. Now an AmeriCorps member with the VISTA program at Vermont Works for Women, she helps women and girls recognize their potential and explore, pursue, and excel in work that leads to economic independence. “My service experience has had a profound impact on my understanding of poverty and social inequity,” said Alison. “I am continuing to learn about the ways gender inequality and structural racism contribute to the economic hardships faced by women in Vermont, particularly women of color. Empowering women and girls to make confident and deliberate choices about life and work can have a meaningful impact on their personal lives and future earnings.” This work resonates every day but even more so as the country prepares to observe Women's Equality Day on August 26, which was created to honor the passage of the 19th amendment to the United States Constitution in 1920, that in spirit removed the gender barrier to voting access as a next step in creating equitable voting rights. Women's Equality Day honors the accomplishments of women's rights advocates, but it also reminds us of the particular challenges that women confront on a daily basis, and that there is more work to be done. Alison’s service is a start reminder that empowering women—of all races—is an ongoing need. Today she is primarily focused on helping women in Vermont find and keep jobs that meet their needs and lead to economic independence. To expand services and assist more women, she helped create a women’s career mentoring network, which connects volunteer mentors with women around Vermont seeking employment and career advice. This new mentoring network has been especially important during the economic recession caused by COVID-19. According to the Vermont Commission on Women, in December of 2020, 69.2% of Vermont’s unemployment claims were attributed to women, while only 30.8% were attributed to men. Many are calling this a “she-cession.” Fast Facts Before the Pregnancy Discrimination Act of 1978, women could be fired if they were pregnant. The first college to admit women was Salem College, founded in 1772 as a primary school. However, it wasn’t until the Morrill Land-Grant Colleges Act of 1862 was founded, that universities had to educate men and women in practical fields of study. The Equal Pay Act of 1963 and Title VII of the first Civil Rights Act mandated equitable wages for the same work. Today, women still make just 78 cents for every dollar earned by men. Black women earn only 64 cents and Latinas only 54 cents for each dollar earned by white men. (ACLU) Learn more about Women’s Equality Day. Vermont Works makes sure women have the support networks and resources necessary to find meaningful employment and earn a livable wage. So far, the mentoring network has been successful at connecting women who want help with women who want to help. Allison and her team hope the network will continue to grow and reach more women in areas of Vermont we haven’t previously served. “My service experience has deepened my desire to make a difference and to work for organizations that move our communities toward a more just and equitable future,” said Allison. Allison and Vermont Works are just one example of all of the work AmeriCorps members are doing across the country to empower women. This Women’s Equality Day, AmeriCorps celebrates the achievements of women’s rights activists, and continues its dedication to alleviating the unique daily struggles that women face, working toward a more equitable country. Previous AmeriCorps Seniors are Heading Back to School Next AmeriCorps Called on to Help Keep Families in their Homes Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2021-08-26/when-covid-19-derailed-her-post-graduate-plans-americorps-member-committed-year",
    "https://www.dodea.edu/dodeaCelebrates/Women-s-Equality-Day.cfm",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2021-08-26/when-covid-19-derailed-her-post-graduate-plans-americorps-member-committed-year&amp;title=When COVID-19 derailed her post-graduate plans, this AmeriCorps Member Committed to a Year of Service and Empowering Women ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2021-08-26/when-covid-19-derailed-her-post-graduate-plans-americorps-member-committed-year&amp;title=When COVID-19 derailed her post-graduate plans, this AmeriCorps Member Committed to a Year of Service and Empowering Women &amp;source=https://americorps.gov/blogs/2021-08-26/when-covid-19-derailed-her-post-graduate-plans-americorps-member-committed-year",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2021-08-26/when-covid-19-derailed-her-post-graduate-plans-americorps-member-committed-year&amp;url=https://americorps.gov/blogs/2021-08-26/when-covid-19-derailed-her-post-graduate-plans-americorps-member-committed-year&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2021-08-12/americorps-seniors-are-heading-back-school",
    "https://americorps.gov/blogs/2021-08-31/americorps-called-help-keep-families-their-homes",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2021",
  "subdomain_2": "08",
  "subdomain_3": "26"
}