{
  "id": "americorpsgov_about_americorps30_eventshtml",
  "url": "https://americorps.gov/about/americorps30/events",
  "title": "events",
  "content": "AmeriCorps 30th Anniversary Events | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb About AmeriCorps 30th Anniversary AmeriCorps 30th Anniversary Events Honor the anniversary of AmeriCorps and the impact of national service. AmeriCorps 30th Anniversary AmeriCorps 30th Anniversary Events Find Your Path. Choose AmeriCorps. To highlight the incredible impact AmeriCorps programs create, the 30th anniversary celebrations will spotlight key areas of service each month. Celebrate the millions of Americans who have worn the AmeriCorps A to make a difference in communities and demonstrate that service is not a moment - it’s a movement. See our key messaging Monthly Themes Toggle To help highlight the incredible impact AmeriCorps programs create, the 30th anniversary celebrations will spotlight key areas of service each month. Use this opportunity to lift up the important work your organization is doing in these areas. The agency will provide messaging for each month . September : Anniversary Launch October : Diversity in Service November : Veterans and Hometown Heroes December : Community Investment and Philanthropy January : Economic Opportunity February : Healthy Futures March : Recruitment April : Environment May : Seniors June : Pathways to Employment July : Disaster Services August : Education September : Lifetime of Service Past Events AmeriCorps Week During AmeriCorps Week we recognized the commitment of the millions of Americans who have chosen to serve their country through AmeriCorps and AmeriCorps Seniors, and encouraged others to follow in their footsteps of service. Learn more Federal Career Opportunities Workshop On Jan. 30, AmeriCorps hosted host a Federal Careers Networking event for AmeriCorps member and alums. Participants joined roundtables with five federal agencies to hear about careers in those agencies and ask questions about life working there. Martin Luther King, Jr., National Day of Service On Jan. 15, AmeriCorps acted on Dr. King’s legacy of social justice and equity and recommitted by volunteering to serve others. Together, we strengthened ties to our communities and one other while addressing critical issues that divide us. Learn more Proof that the Cost of ‘Doing Good’ Benefits All On Dec. 14, AmeriCorps' Office of Research and Evaluation hosted a Philanthropy and Community Investment event. The webinar explored the most recent AmeriCorps return on investment studies that demonstrate the value of AmeriCorps programming through analyses that measures the performance and results of AmeriCorps and builds the base of evidence for future resource allocation decisions. Learn more Delivering on Diversity and Equity with Data On Oct. 31, AmeriCorps hosted a webinar on how we deliver diversity and equity through data. Participants learned about equitable data, its importance for various communities, AmeriCorps' past work, and current initiatives to create a more equitable work environment. AmeriCorps: 30 Years Forward On Oct. 26, President Bill Clinton, AmeriCorps and champions of service hosted a virtual summit to commemorate the 30th anniversary of AmeriCorps. The event discussed the future of national service and ways to expand its impact at different levels. Attendees heard testimonials and learned about the success factors of national service models, like AmeriCorps, and how we can expand access for a new generation of changemakers. Watch the summit The Power of Service: Through the Lens of Being Hispanic/Latino On Oct. 12, AmeriCorps hosted a special diversity in service event to celebrate Hispanic Heritage Month, highlighting our Hispanic and Latino AmeriCorps members and alumni, and discussing the opportunities and challenges for Hispanic members. Watch the event A Movement, Not a Moment On Sept. 21, AmeriCorps kicked off our year-long 30th anniversary celebration. Members, volunteers, alumni, grantees, sponsors, agency staff, and the national service community joined us for a milestone showcase. Participants heard inspiring stories from national service champions and shared strategies to grow AmeriCorps’ impact for years to come. Watch the kick-off Follow AmeriCorps Stay up to date on the latest on social media. Be sure to tag @AmeriCorps when you post and use the hashtag #AmeriCorps30. 30th Anniversary Toolkit Spread the word! Find video, photos, social media, communications templates, and more. Access the Toolkit Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/about/americorps30/events",
    "https://socialpresskit.com/americorps30#americorps-30th-anniversary",
    "https://socialpresskit.com/americorps30",
    "https://americorps.gov/newsroom/events/americorps-week",
    "https://americorps.gov/newsroom/press-release/president-biden-joins-americorps-members-mlk-day-service",
    "https://americorps.gov/webinar/americorps-roi-studies-proof-cost-doing-good-benefits-personal-community-federal-bottomline",
    "https://www.youtube.com/watch?v=npWgvP8QlAw",
    "https://www.youtube.com/watch?v=HOpItjzILgA",
    "https://www.youtube.com/watch?v=bBhz9Toj7hc&amp;t=1s",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://socialpresskit.com/americorps30",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors; Office of Research and Evaluation",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "about",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "about",
  "subdomain_1": "americorps30"
}