{
  "id": "americorpsgov_blogs_2024_10_29_all_treats_no_tricks_national_partnership_student_success_celebrates_progress_workhtml",
  "url": "https://americorps.gov/blogs/2024-10-29/all-treats-no-tricks-national-partnership-student-success-celebrates-progress-work",
  "title": "all-treats-no-tricks-national-partnership-student-success-celebrates-progress-work",
  "content": "All Treats, No Tricks: National Partnership for Student Success Celebrates Progress and the Work Ahead | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb All Treats, No Tricks: National Partnership for Student Success Celebrates Progress and the Work Ahead Submitted by dsong on Fri, 10/25/2024 - 17:02 Oct 29, 2024 Terra Wallin AmeriCorps’ P-12 Education Advisor Terra Wallin highlights the progress of the National Partnership for Student Success and the need for continued student support. When AmeriCorps joined the White House on July 5, 2022, to launch the National Partnership for Student Success alongside the U.S. Department of Education and the Johns Hopkins Everyone Graduates Center, the goal was simple but ambitious – collaborate to recruit and support 250,000 additional adults to serve students as tutors, mentors, and in other student success roles. Given the impacts of the COVID-19 pandemic layered on top of existing inequities, the Biden-Harris administration knew that students needed as many people as possible to provide academic and wraparound supports. Since the launch, NPSS has supported schools, school districts, community-based organizations, AmeriCorps programs and sponsors, state and local governments, and colleges and universities to create, improve, and scale high-quality programs that deploy adults in evidence-based, student support roles. This work has included: Building a network of more than 200 supporting champions and 55 colleges and universities taking direct action to support P-12 students across the country. Releasing voluntary quality standards created by a coalition of leading national organizations. Engaging leading national experts to answer hundreds of technical assistance requests . Providing a plethora of resources , including guides, communications tools, and professional learning opportunities, to diverse audiences. Providing funding under AmeriCorps Volunteer Generation Fund and the NPSS Support Hub’s Community Collaboration Challenge. Leading strategic efforts to engage specific populations, including college students and older Americans in service. And in October , AmeriCorps was thrilled to join our partners to celebrate NPSS’ success in not only meeting, but exceeding President Biden’s goal one year early with an estimated 323,000 additional adults stepping up to help students over the last two school years. Based on a new report from the Johns Hopkins Everyone Graduates Center , during the 2023-24 school year, an estimated additional 136,000 adults provided tutoring, mentoring, college and career advising, and other essential support in public schools. When combined with the estimated additional 187,000 adults who had already joined these efforts in the 2022-23 school year, it shows schools, youth organizations, and other community groups have successfully met the President’s challenge, well before the summer 2025 deadline. Previous Next The Work Ahead Though student outcomes are beginning to improve, students still need the critical supports provided by adults in NPSS-aligned roles. And these caring adults also need programs like AmeriCorps VISTA that support their service, recruit and manage volunteers, and more. That’s why the NPSS will continue to provide support to national, state, and local organizations to ensure that all students have what they need to succeed and thrive. This includes advancing the work of the NPSS Higher Education Coalition . Members of this coalition gathered earlier in October in Washington, DC, to not only celebrate their progress to engage more college students with younger students, but also to plan for the expansion of their efforts in the coming year. AmeriCorps State and National Director Sonali Nijhawan joined the summit to highlight how AmeriCorps and higher education have partnered for decades to provide college students with opportunities to serve while earning money to pay for their education. The NPSS Support Hub has released the application for the 2025 Community Collaboration Challenge , an opportunity for nonprofit organizations, school districts, city or state agencies, and higher education institutions to apply for microgrants ranging from $5,000 to $10,000 to launch, expand, and test evidence-based, people-powered support initiatives for the betterment of children and youth in their communities. Organizations looking to utilize these supports as part of a larger strategy to address chronic absenteeism and/or to engage high school students in NPSS-aligned roles are invited to apply by November 15. Though we have answered President’s Biden’s call, the NPSS will continue to provide professional development and resources to the public at no-cost. Later this year, the NPSS Support Hub will release a rich training resource library, including new materials from MENTOR , to bolster training of individuals in evidence-based student support roles. Whether it was college students or caring older adults, thank you to the AmeriCorps members and AmeriCorps Seniors volunteers who served to empower and support the nation’s students and made the launch of this initiative so successful. Terra Wallin is an AmeriCorps alumna who served with Teach For America and is currently P-12 Education Advisor at AmeriCorps. In this role, she manages AmeriCorps’ engagement in the National Partnership for Student Success and the Youth Mental Health Corps and supports grantees and partners in implementing activities to support P-12 students. Previous The College Alternative to a Fulfilling Career Next In the Face of Disaster, AmeriCorps Rises to the Challenge Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2024-10-29/all-treats-no-tricks-national-partnership-student-success-celebrates-progress-work",
    "https://www.partnershipstudentsuccess.org/",
    "https://www.partnershipstudentsuccess.org/supporting-champions/",
    "https://www.partnershipstudentsuccess.org/colleges/higher-ed-coalition/",
    "https://www.partnershipstudentsuccess.org/voluntary-quality-standards/",
    "https://www.partnershipstudentsuccess.org/technical-assistance/",
    "https://www.partnershipstudentsuccess.org/resources-and-support/",
    "https://www.partnershipstudentsuccess.org/community-collaboration-challenge/",
    "https://www.americorps.gov/newsroom/press-release/americorps-partners-surpass-president-bidens-tutor-mentor-recruitment-goal",
    "https://www.partnershipstudentsuccess.org/2023-24-principals-survey/",
    "https://www.partnershipstudentsuccess.org/colleges/higher-ed-coalition/",
    "https://www.partnershipstudentsuccess.org/project/2025-community-collaboration-challenge/",
    "https://www.mentoring.org/",
    "https://www.partnershipstudentsuccess.org/",
    "https://www.youthmentalhealthcorps.org/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2024-10-29/all-treats-no-tricks-national-partnership-student-success-celebrates-progress-work&amp;title=All Treats, No Tricks: National Partnership for Student Success Celebrates Progress and the Work Ahead",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2024-10-29/all-treats-no-tricks-national-partnership-student-success-celebrates-progress-work&amp;title=All Treats, No Tricks: National Partnership for Student Success Celebrates Progress and the Work Ahead&amp;source=https://americorps.gov/blogs/2024-10-29/all-treats-no-tricks-national-partnership-student-success-celebrates-progress-work",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2024-10-29/all-treats-no-tricks-national-partnership-student-success-celebrates-progress-work&amp;url=https://americorps.gov/blogs/2024-10-29/all-treats-no-tricks-national-partnership-student-success-celebrates-progress-work&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2024-10-22/college-alternative-fulfilling-career",
    "https://americorps.gov/blogs/2024-10-31/face-disaster-americorps-rises-challenge",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps State and National; AmeriCorps VISTA; AmeriCorps Seniors; Volunteer Generation Fund",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2024",
  "subdomain_2": "10",
  "subdomain_3": "29"
}