{
  "id": "americorpsgov_about_what_we_do_disaster_services_unithtml",
  "url": "https://americorps.gov/about/what-we-do/disaster-services-unit",
  "title": "disaster-services-unit",
  "content": "Disaster Services Unit | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb About What We Do Disaster Services AmeriCorps and AmeriCorps Seniors help communities across the country prepare for, respond to, and recover from natural and man-made disasters. What We Do Disaster Services Unit Active Disaster Response Economic Opportunity Education Environmental Stewardship Healthy Futures COVID-19 Veterans and Military Families The Disaster Services Unit (DSU) leads the agency’s engagement across the disaster services cycle with federal, state, local, nonprofit, and other partners. The DSU’s role as the central hub for the agency’s disaster-related activities ensures that AmeriCorps engagement in this area is appropriate, consistent, and coordinated. The DSU also provides technical assistance before, during, and after a disaster. This includes but is not limited to national service roles and functions in the disaster cycle, accessing national service support, volunteer and donations management, disaster response and recovery planning, disaster partnership building; and training support. Active and Recent Responses AmeriCorps’ expertly trained Disaster Response Team serves in national disaster response efforts by supporting shelter operations, call centers, volunteer and donation management, muck and gut operations, blue-roof tarping and debris cleanup, among other services. FIND OUT MORE “I’ve been working with AmeriCorps volunteers for over a decade and they are some of the most flexible, hard-working and dedicated volunteers advancing FEMA’s mission helping people before, during and after disasters.” - Gonzalo Hernández Emergency Management Specialist | Mass Care/Emergency Assistance | Individual Assistance | Recovery Directorate How AmeriCorps Responds National Response Framework (NRF) AmeriCorps, through the DSU, is part of the NRF. The NRF is a guide to how the nation responds to all types of disasters and emergencies. It is built on scalable, flexible, and adaptable concepts identified in the National Incident Management System to align key roles and responsibilities across the nation. This Framework describes specific authorities and best practices for managing incidents that range from the serious but purely local to large-scale terrorist attacks or catastrophic natural disasters. The National Response Framework describes the principles, roles, responsibilities, and coordinating structures for responding to an incident and how response efforts integrate with those of the other mission areas. National Disaster Recovery Framework (NDRF) As the NRF serves as the national guide for disaster response, the NDRF serves as the guide for long-term recovery and is supported by the continual development of detailed field guidance, and training tools. The NDRF describes the concepts and principles that promote effective federal recovery assistance. AmeriCorps provides a support to the NDRF through the Recovery Support Functions. The NDRF captures resources, capabilities, and best practices for recovering from a disaster. It recognizes that significant challenges confront all recovery efforts, from a relatively localized incident to a large-scale disaster that demands substantial allocation of resources. Importantly, the NDRF is intended to address of all kinds of disasters, both big and small, whether it is Presidentially declared or not. Through its connection with the National Planning Frameworks, including the National Response Framework and the National Disaster Recovery Framework, AmeriCorps is positioned to be a leader in the disaster community. FEMA Mission Assignment Development In a federally declared disaster, the DSU will work with state and federal partners to identify unmet needs. In developing a Mission Assignment, the DSU will identify unmet needs, develop a timeframe for response, and provide technical assistance to both State and FEMA partners. AmeriCorps Disaster Response Teams (A-DRTs) ADRTs are AmeriCorps programs that have a heightened focus and commitment to disaster response and recovery. A-DRTs engage in activities and trainings year-round, are a nationally deployable resource, and are recognized in the emergency management community as leaders in volunteer management. AmeriCorps Members and AmeriCorps Seniors Volunteers One of our key areas is disaster response and recovery and our programs have long since been the first to respond and the last the leave. AmeriCorps NCCC FEMA Corps is a disaster-assistance focused track of AmeriCorps NCCC that is directly deployable by the Federal Emergency Management Agency (FEMA). AmeriCorps Seniors RSVP engages 55 and over volunteers in each stage of disaster response. Serve with Us Interested in disaster response service with AmeriCorps? Find out more Resource Capabilities AmeriCorps Disaster Response Teams (A-DRTs) A-DRTs are current AmeriCorps programs that have focus on disaster services and serve as nationally deployable resources. The DSU oversees and implements the A-DRT program. All A-DRTs follow a standard, established protocol in the field when deployed by the DSU and are under the management of the AmeriCorps Incident Command System. These members can deploy to nearly any disaster and provide: AmeriCorps Command Team (ACT) Volunteer management Donations management Mucking/gutting (post flood) Debris management Call center and data management Mass Care (sheltering, feeding) Long term recovery development AmeriCorps State and National Programs often respond to disasters as part of their ongoing grant program, and also as a result of cooperative agreements with AmeriCorps. AmeriCorps members engage in preparedness, response, and recovery. Programs with service that is interrupted by disaster may temporarily be redirected to disaster response activities. These programs provide support to their community by engaging in: Volunteer management Disaster survivor assistance. AmeriCorps NCCC Members engage in a variety of projects related to disaster response and other phases of disaster (preparedness, recovery, and mitigation). See A-DRT Capabilities for response capabilities Preparedness education Rebuilding homes Natural debris clearing and prescribed burns NCCC teams can be called upon to respond to disasters, often serving with local, state, tribal and federal partners. AmeriCorps NCCC FEMA Corps FEMA Corps members deploy with Federal Emergency Management Agency (FEMA) during a disaster. They will most often serve at the Joint Field Office engaged in a variety of activities including: Disaster Survivor Assistance (registering survivors for assistance) Logistics support Public Assistance projects (surveying, data management) GIS Mapping AmeriCorps VISTA Members may serve with partner organizations that are responding to the disaster, or working with local organizations in the community. Programs with service that is interrupted by disaster may temporarily be redirected to disaster response activities, such as volunteer coordination, donations management, or call center coordination. AmeriCorps Seniors RSVP RSVP volunteers serve with organizations that play a role in the disaster response efforts. RSVP volunteers are serving in their own communities and have their own networks prior to and after the disaster event. RSVP can serve in a variety of capacities, including feeding, donations management, call center support, and Volunteer Reception Center support. Disaster Cadre The AmeriCorps Disaster Cadre is a specialized group of federal staff members from across the agency who, when listed as available, can deploy to perform disaster field activities directly related to specific disasters, special projects, activities related to sustaining partnerships, and preparedness efforts within the disaster and emergency management field. The Cadre supports the Disaster Services Unit. The above video may include external links to YouTube’s video platform. YouTube’s privacy and security practices and policies may differ from AmeriCorps'. AmeriCorps is not responsible for these links nor does it endorse the content of the third-party website. Find out more . A Closer Look at A-DRTs A-DRTs Basics Toggle A-DRT deployments are managed by the Disaster Services Unit. An Incident Command System (ICS) structure is used on deployments, adjusting the structure to align with the size of the operation. When established, all deployed programs are managed under the AmeriCorps Incident Command Team (ACT). A-DRTs are trained in disaster services functions to include ICS 100/200/300; NIMs 700/800; EMT; CPR/First Aid; Volunteer and Donations Management; Mass Care/Family Services; Shelter Operations; OSHA certified Chainsaw Training; Hazmat certification. Can deploy under very short notice, within hours in some cases. Ability to deploy, serve, and subsist under harsh conditions with little infrastructure; can be self-sufficient in early disaster response to house and feed independently; bring own tools and vehicles. Capabilities Toggle Individual Assistance Distribution of Life-Sustaining Supplies; Support for Mass Care: Sheltering; Feeding; Health and Wellness Checks; Mucking and Gutting; Debris clean-up; Emergency Roof Tarping; Emergency Home Repair; Mold Suppression; Hazard Tree Removal/Chainsaw; Minor home repair. Public Assistance Critical Debris Removal; Flood Fighting (Sandbagging, etc.); Dispatch and Tracking of Donated Equipment; Park and Public Lands Restoration. Volunteer and Donations Management Volunteer Reception Center: Establish and Manage Operations; Database Management (homeowner intake and volunteers); Damage assessments; Track Volunteer Hours (can be used for State soft match); Field Leadership for Volunteer Engagement: Deliver training in safety and tasks; Support volunteer housing/logistics; Warehousing Support; Points of Distribution (PODs), and Donations Tracking. Community Outreach Damage and Other Needs Assessment; Support to 2-1-1 or Other Call Centers; Client Intake and Tracking; Public Situational Awareness; Case Management; Support for Multi Agency Resource Centers (MARCs); Transportation; Staffing for Staging Areas and Logistics; Canvassing. Capacity Building Support to Emergency Management; Support to Voluntary Organizations Active in Disaster (VOADs), Community Organizations Active in Disaster (COADs), and Long-Term Recovery Committees (LTRCs); Inter-agency Facilitation; Surge Capacity for Staffing; Support for Emergency Farm and Animal Care. A-DRT Programs Toggle American Conservation Experience AmeriCorps National Civilian Community Corps (NCCC) AmeriCorps St. Louis ERT/Safety Corps Appalachian Conservation Corps (Conservation Legacy) Arizona Conservation Corps (Conservation Legacy) California Conservation Corps Conservation Corps New Mexico (Conservation Legacy) Conservation Corps North Carolina (Conservation Legacy) Conservation Corps of Minnesota and Iowa Florida Conservation Corps Iowa Commission on Volunteer Service (Volunteer Iowa) Louisiana Conservation Corps (American YouthWorks) Missouri Community Service Commission Montana Conservation Corps Nevada Conservation Corps Rocky Mountain Youth Corps Steamboat Springs, Colorado Rocky Mountain Youth Corps Taos, New Mexico San Jose Conservation Corps SBP Serve Kentucky Southeast Conservation Corps (Conservation Legacy) Southwest Conservation Corps (Conservation Legacy) Texas Conservation Corps (American YouthWorks) The Student Conservation Association Utah Conservation Corps Washington Conservation Corps Grantee Resources Featured Resources Toggle Disaster Response Framework State Service Commissions and Disaster Services At a Glance - National Service Disaster Assets Managing Spontaneous Volunteers in Times of Disaster AmeriCorps Disaster Services Blueprint This collection of resources contains everything needed for a full-day classroom training on managing spontaneous volunteers in times of disaster, including participant materials, trainer guide, PowerPoint presentation, and forms and instructions for the Volunteer Reception Centers exercise. Training objectives are to: understand spontaneous volunteers and the benefits and burden they can bring; identify the fundamentals of volunteer management in disaster response setting; identify stakeholders in spontaneous volunteer management; learn and use the vocabulary and concepts of disaster and disaster management; understand the role of VOADs/COADs; recognize the importance of public messaging; understand the principles for managing donated goods; understand the various roles involved in staffing a Volunteer Reception Center; and understand the role of technology and social media in managing spontaneous volunteers in times of disaster. Online Courses Toggle Introduction to AmeriCorps Disaster Services National Service and Disaster Response and Recovery For information on how to login to Litmos (online training library), review this document . Performance Measures and Sample Documents Toggle Disaster Service Performance Measures (PDF) Disaster Service Performance Measures (Video) Sample Language for State Service Commissions Engaged in Disaster Services This collection of documents from the Iowa Commission on Volunteer Service (ICVS) is intended to help state commissions write language/agreements with their AmeriCorps programs to engage in disaster-related activities. Includes: Exhibit I Disaster Cadre – this is an agreement between ICVS and any Iowa AmeriCorps program that provides disaster services. Program Director Manual: Disaster Preparedness and Response – this section of the program director manual provides some information about ICVS and AmeriCorps expectations for disaster response. AmeriCorps Program Handbook: Disaster Language – shared by an ICVS program that uses members to deploy for disasters (local, state, and federally declared). Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/about/what-we-do/disaster-services-unit",
    "http://americorps.gov/serve/fit-finder/AmeriCorps-NCCC/fema-corps",
    "http://americorps.gov/serve/fit-finder/AmeriCorps-Seniors-RSVP",
    "https://americorps.gov/serve/fit-finder?field_age_value=All&amp;field_commitment_value=All&amp;field_interests_value%5BDisaster+Response%5D=Disaster+Response",
    "https://issuu.com/americasservicecommissions/docs/2023-disaster-pub-digital",
    "https://americorpsonlinecourses.litmos.com/account/login?ReturnUrl=%2fcourse%2f335751%3fr%3dFalse%26ts%3d637546963646383628&amp;r=False&amp;ts=637546963646383628",
    "https://americorpsonlinecourses.litmos.com/account/login?ReturnUrl=%2fcourse%2f4982395%3fr%3dFalse%26ts%3d637546964895227653&amp;r=False&amp;ts=637546964895227653",
    "https://youtu.be/Inp73RJIozw",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/Disaster%20Response%20Framework.pdf",
    "https://americorps.gov/sites/default/files/document/At%20A%20Glance%20-%20National%20Service%20Disaster%20Assets.pdf",
    "https://americorps.gov/sites/default/files/document/AmeriCorps-Disaster-Services-Blueprint.pdf",
    "https://americorps.gov/sites/default/files/document/How%20to%20create%20Litmos%20account.pdf",
    "https://americorps.gov/sites/default/files/document/Disaster%20Services%20Performance%20Measures.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC; AmeriCorps State and National; AmeriCorps VISTA; AmeriCorps Seniors",
  "focus_population": [
    "Veterans and Military Families"
  ],
  "ages_studied": [],
  "resource_type": "about",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "about",
  "subdomain_1": "what-we-do"
}