{
  "id": "americorpsgov_blogs_2023_12_07_building_bridges_fostering_civic_engagement_through_americorps_partnershipshtml",
  "url": "https://americorps.gov/blogs/2023-12-07/building-bridges-fostering-civic-engagement-through-americorps-partnerships",
  "title": "building-bridges-fostering-civic-engagement-through-americorps-partnerships",
  "content": "Building Bridges and Fostering Civic Engagement Through AmeriCorps Partnerships | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Building Bridges and Fostering Civic Engagement Through AmeriCorps Partnerships Submitted by dsong on Tue, 11/21/2023 - 09:53 Dec 07, 2023 Jennifer Leshnower Emboldened by President Biden’s call for a new era of national service that bridges divides, AmeriCorps continues to advance efforts that fuel social cohesion. AmeriCorps participated in the United We Stand Summit a year ago, expressing our deepest resolve to unify America through service. A year later, as we celebrate AmeriCorps’ 30th anniversary, we continue to learn from programs, bring new learning resources to the table, and highlight the variety of approaches that help bridge divides. As AmeriCorps’ first-ever bridging and democracy fellow, I am honored to support the president’s unity and democracy agenda by leading the agency’s work in this crucial area. By encouraging Americans to engage with their communities, we aim to foster a sense of constructive action, civic participation, and belonging that will help bridge divides across social, economic, political, and other demographic divides and bring us closer together. We are constantly exploring new opportunities to strengthen our capacity for bridge-building, elevate promising practices in the service field, connect generations to initiatives in civic, faith, and secular spaces, and advance research efforts that measure the impact bridge-building has on individual service members, volunteers, and organizations. We’ve seen firsthand that service builds bridges. It can strengthen ties, create bonds, and foster community. Nearly 51 percent of the US population aged 16 and over, or 124.7 million people, informally helped their neighbors between September 2020 and 2021 at the height of the COVID-19 pandemic, according to the latest Volunteering and Civic Life in America research . The research reveals that despite the devastating impact of the pandemic, Americans continued to serve each other and their communities — giving their time and talent to lend a helping hand at a time of unprecedented need. This year, AmeriCorps partnered with Service Year Alliance to launch a multi-year bridge-building pilot project – a first-of-its-kind community of practice to bring together a wide range of AmeriCorps programs, state service commissions, and leaders in the bridging and democracy-building sector. Alongside more than 15 national service organizations and an advisory board with members from Greater Good Science Center , CoGenerate , America’s Service Commissions , Bridge USA , Civic Health Project , Interfaith America , and more, the initiative will examine, measure, and spread effective practices and interventions that develop members as active citizens and build their skills and motivation to bridge divides. Image Caption Katherine, is a member at Welcome Baby, a Healthy Futures AmeriCorps program supported by U-Serve Utah. Image Caption AmeriCorps member Chartell spent her service year with Storytime Village in Wichita, Kan. as a Lead For America Hometown Fellow. Image Caption Move for America’s Len is an AmeriCorps member with the VISTA program focused on capacity building. Image Caption AmeriCorps member Talha serving with Interfaith Enrichment Corps (left, holding tomatoes) and Service Site Supervisor, Imam (right, holding okra), of Service Site Masjid Al Mumineen are distributing food donated from Touba Gardens. Previous Next Apart from new initiatives, federal funding such as Days of Service Grants, Volunteer Generation Funds, and more also support national service programs that generate new lessons in civic bridge-building. We join and participate in thought-leader convenings that help us deepen our understanding of civil discourse, compassionate leadership, and engaged listening. But civic bridge-building represents more than just a symbolic gesture – it embodies an active and intentional effort to connect people across divides such as generational gaps, cultural differences, economic disparities, and varying viewpoints on societal matters. Organizations like CoGenerate converge two storied sectors – bridging and service – toward advancing multigenerational solutions. They reflect bridge-building in service by asking, “What if older and younger generations worked together to solve the problems that no generation can solve alone?” The Greater Good Science Center , a leading authority in the study of bridging differences, recognizes that the core actions of bridge-builders include: Seeking to understand someone else’s perspective, even if it’s not your own. By asking questions and suspending judgment, individuals can explore the nuanced dimensions of other’s opinions, as well as draw a clearer understanding of how to communicate what matters most to them. Seeing the humanity in others, despite disagreement. Identifying the person within your belief helps lower or remove the walls often placed between one another. Connecting over personhood can unite people in ways that facts or beliefs cannot do alone. Identifying common goals and shared values. Removing the expectation that one person’s opinion or belief is the only right answer or that there is a winner and a loser can significantly shift the outcome of the interaction towards actionable change. Bridge-building happens when good intentions meet practice, reflection, and finetuning. Through intentional practice, service-oriented organizations have a unique chance to cultivate unity and empathy, fostering an environment where diverse groups collaborate to address shared challenges. Research shows effective bridge-building can ease social isolation, enable the exchange of wisdom, increase a sense of inclusivity and connection, and strengthen community resilience. By improving lives, enhancing community well-being, and fostering civic engagement through service and volunteering, we can collectively work towards creating a more cohesive and supportive society. Today, Americans and the world face compounding heartbreaking tragedy, highlighting inequities and injustices everywhere. Service to others cuts through those forces that try to divide us. When you’re handing out water in sweltering heat or mucking and gutting homes destroyed by floods, ideological differences can fade—and we can begin to see each other’s humanity. Service gives communities across the nation a way to build bridges, break down barriers, and reveal our common humanity. While there’s still more work to be done, AmeriCorps commits to elevating the visibility of bridge-building leaders in and beyond the service field and raising our collective resolve and capacity to unify Americans from all walks of life. As we’ve seen from neighbors helping each other during the pandemic, everyday community volunteerism, or even full-time service with AmeriCorps or the Peace Corps, Americans can build bridges. If you’d like to be a part of fostering engagement in your community, answer the nation’s call to serve. Whether it be full-time service with AmeriCorps or starting smaller at a service project this MLK Day , you can help heal divides. Photo Credits (In order) Upstate Trails Upstate Greenways & Trails Alliance AmeriCorps members Hannah Hudson, Jacob Macnab, Micah Burris, and Katie McGowan on a Saturday morning bike ride with youth from Momentum Bike Clubs. Tuesday through Fridays our AmeriCorps members are building trails, and on Saturdays, we're bridging divides to ensure equitable usage of the trails from underserved communities. U-Serve Utah (State Service Commission) Katherine Grieg, is a member at Welcome Baby, a Healthy Futures AmeriCorps program supported by U-Serve Utah . Welcome Baby is a free community service designed to promote a healthy, secure, and enjoyable beginning for parents, new babies, and their family members. AmeriCorps members in this program recruit and manage volunteers to provide home visits within their own communities to increase child development support to new parents. The program also helps members develop high-level management skills, training skills, relationship development and problem-solving skills they can use in their future careers to promote positive change and continued civic participation. Lead for America, AmeriCorps Connection Corps Lead For America Hometown Fellow Chartell Grissom spent her service year with Storytime Village in Wichita, Kan. Here, she shares her summary of service presentation during graduation week in Washington, DC. Chartell's service focused on implementing programming to build a love of reading amongst children from a variety of high-need communities in the Wichita area. Beyond the local impact Chartell made, she remarked that her service year and connections to a village of peer AmeriCorps members were critical in enriching her nationwide perspective, building her leadership skills and growing her confidence. “I have been able to overcome a number of fears. So, as we say at Storytime Village, ‘It takes a village,’ and I am so grateful for my village,\" noted Chartell. Move for America (Photo Credit: Kevin Sullivan) Move for America ’s Len Sanqui is an AmeriCorps member with the VISTA program (2022-23), focused on capacity building. Len was working at an intercultural and interfaith nonprofit in Minneapolis, GMCC. She helped organize an event that brought together community members, community leaders, and nonprofit board members for an evening to build understanding around the challenges people face when experiencing poverty. The event built relationships while deepening participants' understanding of the issues they are working to solve. Interfaith Enrichment Corps Interfaith Enrichment Corps AmeriCorps member Talha Kahf (left, holding tomatoes) and Service Site Supervisor, Imam Ismail Aleem (right, holding okra), of Masjid Al Mumineen are distributing food donated from Touba Gardens (another IEC Service Site), for the community in Indianapolis. This service is one of many programs that Talha is involved with, including a peer support group for those re-entering the community from prison, training to assist victims of domestic violence, and participation of “Connectors” that assist those recently released from the hospital that are facing social isolation. AmeriCorps members receive training in interfaith civic bridging to learn how to best meet the social determinants of health across diverse faith communities in Indianapolis. Previous Honoring the Sacrifices Made by Our Hometown Heroes Next Happy Thanksgiving: This year, We’re Thankful for Your Service Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-12-07/building-bridges-fostering-civic-engagement-through-americorps-partnerships",
    "https://americorps.gov/partner/communities-initiatives/united-we-serve",
    "https://americorps.gov/about/our-impact/volunteering-civic-life",
    "https://www.serviceyearalliance.org/",
    "https://americorps.gov/newsroom/press-release/response-president-bidens-call-americorps-service-year-alliance-announce",
    "https://greatergood.berkeley.edu/",
    "https://cogenerate.org/",
    "https://www.statecommissions.org/",
    "https://www.bridgeusa.org/",
    "https://www.civichealthproject.org/",
    "https://www.interfaithamerica.org/",
    "https://cogenerate.org/",
    "https://greatergood.berkeley.edu/topic/bridging_differences/definition#why-bridge-differences",
    "https://americorps.gov/serve/",
    "https://americorps.gov/serve/volunteer/mlk-day",
    "https://gcc02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fugata.org%2F&amp;data=05%7C01%7CRFrazier%40americorps.gov%7C8d03d935b1a045fc510c08dbf73c5478%7Cd2f850a78dce4fb3a79c6867f9514312%7C0%7C0%7C638375610729771754%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&amp;sdata=56KnVUOUN7XLTvng9Za2a1j7A76UsZgcnT%2B%2BebMCd%2Fw%3D&amp;reserved=0",
    "https://gcc02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fuserve.utah.gov%2F&amp;data=05%7C01%7CRFrazier%40americorps.gov%7C8d03d935b1a045fc510c08dbf73c5478%7Cd2f850a78dce4fb3a79c6867f9514312%7C0%7C0%7C638375610729771754%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&amp;sdata=SAGJYi86jKJXsSPKj7yY9ePH%2By4xQIGiM39u2NSiEpE%3D&amp;reserved=0",
    "https://gcc02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.americanconnectioncorps.org%2F&amp;data=05%7C01%7CRFrazier%40americorps.gov%7C8d03d935b1a045fc510c08dbf73c5478%7Cd2f850a78dce4fb3a79c6867f9514312%7C0%7C0%7C638375610729771754%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&amp;sdata=FOK18PlwiOR36uoO9yKFi1LjV039e%2FB5ukii9cCDRn0%3D&amp;reserved=0",
    "https://gcc02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.move4america.org%2F&amp;data=05%7C01%7CRFrazier%40americorps.gov%7C8d03d935b1a045fc510c08dbf73c5478%7Cd2f850a78dce4fb3a79c6867f9514312%7C0%7C0%7C638375610729771754%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&amp;sdata=G4%2Bz1lHgAY2jCFkZeEiZfBQYj0%2FR74WBNT%2Fnhn%2FWASA%3D&amp;reserved=0",
    "https://gcc02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.indycic.org%2Fiec-service%2F&amp;data=05%7C01%7CRFrazier%40americorps.gov%7C8d03d935b1a045fc510c08dbf73c5478%7Cd2f850a78dce4fb3a79c6867f9514312%7C0%7C0%7C638375610729771754%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&amp;sdata=4kJQVOVKswV%2F27KtPs2ih5%2FCeKKH8TbIWj8kAH6fD%2B4%3D&amp;reserved=0",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-12-07/building-bridges-fostering-civic-engagement-through-americorps-partnerships&amp;title=Building Bridges and Fostering Civic Engagement Through AmeriCorps Partnerships",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-12-07/building-bridges-fostering-civic-engagement-through-americorps-partnerships&amp;title=Building Bridges and Fostering Civic Engagement Through AmeriCorps Partnerships&amp;source=https://americorps.gov/blogs/2023-12-07/building-bridges-fostering-civic-engagement-through-americorps-partnerships",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-12-07/building-bridges-fostering-civic-engagement-through-americorps-partnerships&amp;url=https://americorps.gov/blogs/2023-12-07/building-bridges-fostering-civic-engagement-through-americorps-partnerships&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-11-16/honoring-sacrifices-made-our-hometown-heroes",
    "https://americorps.gov/blogs/2023-11-23/happy-thanksgiving-year-were-thankful-your-service",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "Volunteer Generation Fund",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "12",
  "subdomain_3": "07"
}