{
  "id": "americorpsgov_blogs_2021_06_28_national_vaccine_month_action_needs_youhtml",
  "url": "https://americorps.gov/blogs/2021-06-28/national-vaccine-month-action-needs-you",
  "title": "national-vaccine-month-action-needs-you",
  "content": "National Vaccine Month of Action Needs You | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb National Vaccine Month of Action Needs You Submitted by eschneider on Mon, 06/28/2021 - 09:12 Jun 28, 2021 AmeriCorps staff Join those wearing the AmeriCorps \"A\" and help your community recover from the pandemic Free childcare. Free shared services rides. Lots of incentives. And a month dedicated to vaccine action. The Biden Administration, in partnership with many federal agencies—including AmeriCorps— corporations, and nonprofit organizations are pulling out the stops to encourage people to complete their COVID-19 vaccinations. “Those wearing the AmeriCorps’ “A” have assisted more than 2.5 million people at vaccination sites across the country—they’ve made a significant impact on our country’s ability to vaccinate as many people as possible and recover from the pandemic,” said Karen Dahl, Senior Advisor for COVID-19 at AmeriCorps. Those members are serving in communities across the country and developing innovative and accessible programs to help make getting vaccinated as easy as possible. In Maine, AmeriCorps member Will Parker, serving with the Resilience Corps at the Greater Portland Council of Governments, helped create a map showing all transit routes and vaccination sites in Maine’s Cumberland and York counties. The map includes instructions on scheduling an appointment and how to get there. Community organizations are now using this tool to help those looking to get vaccinated. AmeriCorps members serving with the Conservation Trust of North Carolina and Wake County Health Department participated in a Month of Action bus tour visit and canvass in Raleigh, North Carolina with Environmental Protection Agency Administrator Michael Regan. At the Nashville Metropolitan Development and Housing Agency , an AmeriCorps grantee with members in the VISTA program serving, conducted a virtual COVID-19 vaccine education town hall in May and have two more planned in July. The purpose of the town hall is to educate Nashville Promise Zone residents on COVID-19 treatments as well as dispel rumors about the vaccination. Led by AmeriCorps members in the VISTA program, the Mayor’s Office in New Orleans, Louisiana is planning pop-up vaccination events in target communities where vaccination rates are lower. “We’ve made so much progress together—united—with a mission to protect the American public. I want to offer my thanks to every national service member, every volunteer, and offer my encouragement to those who haven’t yet been vaccinated. Vaccines are free and available to anyone who wants one,” said Dahl. Since January, with just 5 percent of Americans having received at least one vaccination, the Biden Administration has sprinted to reach its aspirational goal to have 70 percent of all Americans vaccinated by July 4. Based on today’s estimates, Americans age 30 and older have reached this milestone, and those age 27 and up, are on track to meet 70 percent once the data for the July 4th holiday weekend is compiled. Visit vaccines.gov to find where to go, how to get there, and how you can help spread the word to others in your neighborhoods, networks, and friend groups. Need help finding a vaccine in the U.S.? Call 1-800-232-0233. If you are looking for other ways to help, visit We Can Do This website hosted by Health and Human Services for easy ways to support the Month of Action. Previous Celebrate Immigrant Heritage Month with a #MadeInAmeriCorps Story Next Pride Rings True in National Service Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2021-06-28/national-vaccine-month-action-needs-you",
    "https://www.transittogether.org/vaccinationsites?locale=en",
    "https://www.wral.com/coronavirus/epa-administrator-visits-raleigh-as-part-of-vaccination-push/19727816/",
    "http://www.nashville-mdha.org/",
    "https://ready.nola.gov/incident/coronavirus/vaccine/calendar/",
    "http://www.vaccines.gov/",
    "https://wecandothis.hhs.gov/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2021-06-28/national-vaccine-month-action-needs-you&amp;title=National Vaccine Month of Action Needs You",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2021-06-28/national-vaccine-month-action-needs-you&amp;title=National Vaccine Month of Action Needs You&amp;source=https://americorps.gov/blogs/2021-06-28/national-vaccine-month-action-needs-you",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2021-06-28/national-vaccine-month-action-needs-you&amp;url=https://americorps.gov/blogs/2021-06-28/national-vaccine-month-action-needs-you&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2021-06-25/celebrate-immigrant-heritage-month-madeinamericorps-story",
    "https://americorps.gov/blogs/2021-06-29/pride-rings-true-national-service",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2021",
  "subdomain_2": "06",
  "subdomain_3": "28"
}