{
  "id": "americorpsgov_blogs_2022_07_12_my_journey_americorps_member_doctor_social_sciencehtml",
  "url": "https://americorps.gov/blogs/2022-07-12/my-journey-americorps-member-doctor-social-science",
  "title": "my-journey-americorps-member-doctor-social-science",
  "content": "My Journey from AmeriCorps Member to Doctor of Social Science | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb My Journey from AmeriCorps Member to Doctor of Social Science Submitted by dsong on Tue, 07/12/2022 - 17:00 Jul 12, 2022 Courtney Tull As a young professional, for most of my career I was either an AmeriCorps member, a volunteer, or a leader of volunteers. My career in service began in 2017 when I accepted a role as an AmeriCorps volunteer coordinator for Sussex County Habitat for Humanity. After recruiting and leading volunteers in their mission to build affordable housing for a summer, I was hooked. I signed on for an additional year as an AmeriCorps member with a desire to “get things done,” as we say. During this time, I quickly learned about volunteers’ dedication to their communities, and the connection they developed from years, if not decades, of serving together. As an AmeriCorps member, I grew as an individual and discovered a love for national service and volunteerism. My experience prompted my educational journey and motivated me to earn a master’s degree in Administration of Human Services at Wilmington University in Delaware. This degree program especially appealed to me because of the focus on nonprofit administration and the coursework related to volunteerism. Courtney Tull, CVA, DSocSci Five years later, I am not only a proud AmeriCorps alumna, but I was also a full-time volunteer services manager, AmeriCorps program manager, a certified volunteer administrator, an active member of the Delaware Association of Volunteer Administrators, director of music for church choirs, and an advocate to serve communities. Serving through AmeriCorps with the opportunity to inspire other volunteers was life changing. I began my doctorate in social sciences with a focus on preventing adverse health outcomes. Inspired by my time with AmeriCorps, my dissertation research focused on volunteers and the suspected connections between volunteering, well-being, and quality of life. After designing and completing a mixed-methods research study, further connections were found between service and the increased well-being of those who serve regularly. My research also collected data about the primary reasons individuals chose to serve in roles that fit into their values and interests. National service members who locate a position that appeals to their specific values and interest can experience more benefits to their social and physical health when compared to volunteering in the \"wrong\" role. For example, an AmeriCorps conservation corps crew leader can potentially gain a lot more physically, while an AmeriCorps volunteer coordinator gains a lot more socially. Volunteers who understand and follow their motivations reap greater rewards from their service. This data provides the grounds to tailor recruitment and marketing strategies to match the motivations of volunteers. It also will help promote service opportunities as methods of preventing adverse health outcomes. Serving in AmeriCorps helped me realize my career path and future. Now that I’ve completed my doctoral degree and presented my research to numerous organizations, I am focused on using what I learned to help research and better community health by helping train professional and volunteer audiences. Regardless of which specific path I find, I am committed to becoming a stronger advocate for service so that national service programs will continue to inspire members and flourish. Find out more about national service opportunities for students and young adults for this summer . Courtney Tull, CVA, DSocSci is an experienced leader in nonprofit and human service administration specializing in volunteer management, community engagement, and social science. Courtney earned the Delaware Service Impact Award from the Governor's Commission on Community and Volunteer Service in 2018 as a result of her AmeriCorps service. As a practitioner, Courtney has recruited thousands of volunteers and AmeriCorps members to aid Sussex County Habitat in its mission to build affordable housing and strengthen communities in Delaware. Since 2020, she has designed and presented her doctoral-level research about the relationship between volunteering and well-being to professional audiences locally and nationally, also being recognized as Wilmington University's College of Social and Behavioral Sciences Academic Award Recipient in 2022. Courtney recently relocated to Orlando, Florida where she enjoys getting to know her new community, sitting on her balcony to read and look for new healthy recipes, and caring for her cat and guinea pigs. Previous How AmeriCorps Service Put Me on a Path from Jail to Harvard Graduate School Next Ten Years of Responding to Crisis Situations Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2022-07-12/my-journey-americorps-member-doctor-social-science",
    "https://americorps.gov/serve/fit-finder/americorps-vista#summer-associate",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2022-07-12/my-journey-americorps-member-doctor-social-science&amp;title=My Journey from AmeriCorps Member to Doctor of Social Science ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2022-07-12/my-journey-americorps-member-doctor-social-science&amp;title=My Journey from AmeriCorps Member to Doctor of Social Science &amp;source=https://americorps.gov/blogs/2022-07-12/my-journey-americorps-member-doctor-social-science",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2022-07-12/my-journey-americorps-member-doctor-social-science&amp;url=https://americorps.gov/blogs/2022-07-12/my-journey-americorps-member-doctor-social-science&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2022-07-08/how-americorps-service-put-me-path-jail-harvard-graduate-school",
    "https://americorps.gov/blogs/2022-07-29/ten-years-responding-crisis-situations",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2022",
  "subdomain_2": "07",
  "subdomain_3": "12"
}