{
  "id": "americorpsgov_about_agency_overview_equity_action_planhtml",
  "url": "https://americorps.gov/about/agency-overview/equity-action-plan",
  "title": "equity-action-plan",
  "content": "AmeriCorps’ Equity Action Plan | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb About Agency Overview AmeriCorps’ Equity Action Plan Agency Overview Agency-Wide Policies and Notices AmeriCorps Fraud Alert AmeriCorps’ Equity Action Plan Budget and Performance Plans Civil Rights for Employees, Service Members, and Volunteers Digital Strategy Disability and Accessibility Federal Register Notices FOIA and the Privacy Act No FEAR Act Open Government Plain Writing Privacy Policy Results of Grant Competitions Statutes and Regulations Strategic Plan Vulnerability Disclosure Policy Advancing Equity at AmeriCorps Message from the CEO \"The administration’s commitment to advancing equity and supporting underserved communities not only reinforces equity work at AmeriCorps, but also bolsters the country’s efforts to act nationwide.\" READ MORE AmeriCorps Agency Equity Plan AmeriCorps' Equity Action Plan focuses on five key areas: Advancing Civil Rights: At the core of equity are the laws, regulations, and policies that serve as its foundation. We are committed to full compliance with these laws and ensuring our grantees have the necessary training and tools. Recruiting and Retaining a Diverse Corps: We must increase representation in our national service corps from the communities we serve. We plan to do this by providing greater access to national service opportunities and benefits for people from underserved communities. Partnering with Native Communities: Our responsibilities to American Indians and Alaskan Natives and our nation-to-nation relationship with Tribal governments is driven by our Committee on Native American Affairs, which has supported our prioritized actions in this area to address longstanding barriers. Addressing Limited English Proficiency and Ensuring Language Access: Advancing equity through our resources and opportunities is impossible if they are not accessible. We must ensure that anyone, despite their level of English proficiency, can access our resources and service opportunities. Increasing Equity in Our Procurement Process: Much of how we accomplish our mission has to do with the vendors and contractors we utilize. Their services, experience, and diverse backgrounds are critical to advancing equity at AmeriCorps. Cultural Learning Community The AmeriCorps Office of Diversity, Equity, Inclusion, and Accessibility is launching the Cultural Learning Community – a monthly course to foster a more inclusive and equitable community for all our valued partners. These courses will provide an invaluable opportunity to deepen understanding, enhance skills, and increase partner engagement. Schedule Toggle Compassion Fatigue and the Road to Compassion Resilience Thursday, Jan. 25 During this course, participants will learn of compassion fatigue and how to build compassion resilience. Watch the recording Cultural Competence: Serving with Care and Awareness Thursday, Feb. 15 The work of service requires cultural competence in varying communities. This course will increase participants knowledge of cultural competence and how to enter diverse communities with awareness. Watch the recording Going Beyond Reasonable Accommodation (Allyship to individuals with disabilities) Thursday, March 21 This training will provide information on AmeriCorps’ Reasonable Accommodation (RA) program, how to process and access a reasonable accommodation, and understand ways to support accessibility needs. Watch the recording Going Beyond the Surface (Aspects of Diversity) Thursday, April 18 This course will provide knowledge that will strengthen the ability to navigate the world and community efforts through the exploration of topics such as identity, intersectionality and encouraging an inclusive mindset through open dialogue. Watch the recording Class and Access to Opportunity: A Look at the History and Impact of Poverty Thursday, May 16 This course examines the historical roots and societal impact of poverty and its multifaceted manifestations across different cultures over time. Attendees will be engaged in the analysis of the socio-economic forces that perpetuate poverty and critically evaluate strategies for poverty alleviation and social justice. Watch the recording Anti-Discriminatory Protections and Accommodations Under Title VI and VII Thursday, June 20 This training will discuss Civil Rights and Equal Employment Opportunity (EEO) protections for AmeriCorps’ internal and external stakeholders. The goal is to provide a general knowledge and understanding of rights and obligations under Civil Rights and EEO laws and jurisdictions. Register Creating Systemic Change by Operating Trauma Informed Organizations Thursday, July 18 In this course, attendees will learn what a Trauma-Informed Organization is and the importance of building systems to incorporate trauma-informed practices. This course will also share how to implement trauma-informed practices into current systems for creating sustainable change. Register Gender and Sexual Identity Thursday, August 15 Fundamental to the AmeriCorps mission is the obligation to honor the diversity of all stakeholders by treating everyone with respect and dignity. This course will provide a better understanding of gender and sexual identity related terms and discuss ways to introduce inclusive language to signal a welcoming and respectful environment for all. Register Managing Mental Health in the Workplace Thursday, Sept. 19 This course provides practical strategies for promoting mental well-being in professional settings, addressing topics such as stress management, work-life balance, and destigmatizing mental health issues. Attendees will learn how to recognize signs of mental distress and ways to foster a supportive work environment. Register From Equality to Equity (Educating the Differences) Thursday, Oct. 17 This course explores the distinctions between equality and equity, delving into the social and economic implications of both concepts. Attendees will engage in discussions that explore ways in which these principled intersect with various aspects within society and be presented with strategies that foster fairness and justice in an inclusive environment. Register Origins of Health Disparities and their Impact on Communities Thursday, Nov. 21 This course investigates the origin and contemporary impacts of health disparities within communities while addressing factors such as socioeconomic status, race, and access to healthcare. Attendees will gain an opportunity to discuss the complex interplay of social determinants and public health policies and explore possible strategies to mitigate disparities and promote health equity. This event has been cancelled. Invisible Disabilities and Protections Under Title VI and VII Thursday, Dec. 19 This course examines the legal and societal implications of unseen disabilities within the framework of Title VI and VII protections. Attendees will explore the intersections of disability rights and anti-discrimination laws while being presented material to understand the challenges and accommodations for individuals impacted by a disability in varying settings. Register ODEIA Virtual Summit Let’s Take a Journey: Exploring the Power of Strategy, Data and Accessibility Tuesday, April 30 12 pm – 4 pm ET There are foundational concepts linked to the power of strategy, data, and accessibility. Integrating them into organizational culture and business practices may increase equitable outcomes for all AmeriCorps stakeholders and the communities we serve. View the program Agenda Toggle Plenary Session 12 – 1:30 p.m. ET Break 1:30 p.m. – 1:40 p.m. ET During the two sessions below, choose from one of the three following workshops available to attend during each time block. The same three workshops are available during sessions one and two: Destination Data:  Exploring Data to Increase Equitable Outcomes Destination Accessibility: Granting Access: Dismantling Able-ism And Embracing Neurodiversity Destination Strategy: Strategic Alignment for Organizational Success and Community Impact Session One 1:40 p.m. – 2:45 p.m. ET Break 2:45 p.m. – 2:50 p.m. ET Session Two 2:50 – 3:55 p.m. ET AmeriCorps Agency Equity Team Toggle In line with Executive Order 13985, AmeriCorps established its Agency Equity Team, which represents an enterprise-wide cadre of leaders and key DEIA stakeholders. The AmeriCorps Agency Equity Team is leading the implementation of the Equity Action Plan and is serves as the agency’s accountability hub for DEIA implementation. AmeriCorps Agency Equity Team Members: Affinity Group Advisory Council Representative Associate Director of Policy Chief Data Officer Chief Financial Officer Chief Human Capital Officer Chief Information Officer Chief of Program Operations Chief of Staff Chief Operating Officer Chief Risk Officer Deputy Chief of Program Operations Deputy Chief of Staff Director, AmeriCorps NCCC Director, AmeriCorps Seniors Director, AmeriCorps State and National Director, AmeriCorps VISTA Director, Government Relations Director, Office of Civil Rights Director, Communications and Marketing Director, Office of Grant Admission Director, Office of Procurement Services Director, Office of Recruitment Director, Regional Operations Director, Research & Evaluation Director, Workforce Relations General Counsel Project Manager, Planning and Cross Agency Initiatives Senior Advisor for COVID-19 Senior Advisor for Diversity, Equity, Inclusion, and Accessibility Senior Advisor for Special Projects Senior Advisor for Strategic Partnerships Senior Advisor for Wounded Warrior Veteran and Military Families Team Lead for Employee Development, Office of Human Capital Notable Equity-Related Accomplishments Toggle Created a new role of Chief Diversity and Inclusion Officer slated to be filled in May 2022. Included racial equity as a funding priority in the FY 2021 AmeriCorps State and National and AmeriCorps Seniors grant competitions, and AmeriCorps VISTA program guidance. Created a Language Translation Services Project Manager position to support translation and interpretation services for agency programs and grant competitions. Formed a Committee on Native American Affairs with a senior advisor and special assistant dedicated to these efforts. Expanded the pipeline of paid summer interns through partnerships with Historically Black Colleges and Universities. Increased the living allowance for AmeriCorps State and National and AmeriCorps VISTA Resources Toggle AmeriCorps Strategic Plan Learn more about the Administration’s Equity Agenda Advancing Equity Through the American Rescue Plan Learn more about government-wide equity efforts Stakeholder Engagement Toggle AmeriCorps engaged with stakeholders to conduct a DEIA assessment of three key areas of operations: fostering an equitable workplace; promoting equitable grantmaking; and recruiting and retaining a diverse corps of AmeriCorps members and AmeriCorps Seniors volunteers. Stakeholder input strongly influenced the recommendations from the employee-driven DEIA initiative, the agency’s Equity Action Plan, and the FY 2021-FY 2025 AmeriCorps Strategic Plan development. AmeriCorps implemented a variety of stakeholder engagement strategies: Workforce-Driven DEIA Assessment and Workforce Survey – The 2020 DEIA initiative was driven by more than 50 passionate volunteers from across the AmeriCorps workforce who spent months evaluating agency operations, assessing barriers to advancing DEIA, and supporting underserved communities. Stakeholder Engagement Panels – AmeriCorps hosted three stakeholder engagement panels which included representatives from four association partners: Americas Service Commission, Voices for National Service, Service Year Alliance, and AmeriCorps Seniors Association. Panelists also included grantees from AmeriCorps and AmeriCorps Seniors programs: VISTA, AmeriCorps State and National, and AmeriCorps NCCC. Representation from the Office of Regional Operations included current and former staff members. AmeriCorps asked panelists the following questions: Within your own program (AmeriCorps VISTA, State & National, NCCC) what are barriers for you in applying, partnering, grant management, or other requirements that make it difficult to partner with us? What are specific immediate and longer-term changes we should consider to make our programming more accessible? What would you identify as the top three barriers to starting service for applicants from diverse backgrounds? What would you identify as the top three barriers to continuing/completing service for members from diverse backgrounds? What assistance would be beneficial for AmeriCorps to offer throughout the process (from proposal writing through grant management) to make our funding more accessible (planning grants, increased technical assistance, etc.)? What should stronger outreach and recruitment to new applicants look like? Do you have recommendations for us as an agency on ways to reach out and recruit more potential applicants working in Black, Indigenous, People of Color (BIPOC) communities? What are specific funding priorities or performance measures would allow you to focus your work more on diverse communities (BIPOC, LGBTQ, etc.)? Tribal Consultation – In April 2021, AmeriCorps hosted a Tribal consultation with Tribal leaders to ensure that AmeriCorps is equitable, fair, and accessible to Tribal nations. This allowed the agency to learn more about what is working, what is not working, and to make sure opportunities and resources meet the needs of Tribal nations. Participants were asked to share feedback on the following: Barriers for Tribal communities to access AmeriCorps resources, for members to serve with AmeriCorps and to achieve compliance with grants requirements. Ways AmeriCorps can support COVID response and recovery. Ways AmeriCorps can support veterans and military families. How AmeriCorps can more effectively consult and strengthen communications and relationships. Best practices from other agencies AmeriCorps should review. Ways to use technology to solicit tribal feedback on policies and activities. Ways to disseminate information that is most relevant. Request for Information – As part of AmeriCorps’ ARP investment , the agency pledged to create new national service opportunities; increase benefits for service members; and support nonprofit, Tribal, and community organizations that support underserved communities. To do this, AmeriCorps looked further into the barriers programs and members face. In accordance with Executive Order 13985 and as part of the agency’s commitment to DEIA, AmeriCorps launched a Request for Information (RFI), which closed on August 2, 2021, inviting public comment from any interested party, including current and former AmeriCorps program award recipients. Respondents relayed comments regarding any barriers that they, or the communities they served, faced in accessing benefits and services offered by AmeriCorps’ programs. This request gave the agency insight from members, volunteers, the broader national service community, and outside voices. AmeriCorps received over 600 comments, significant for a small agency, with the overwhelming majority focused on the value of the AmeriCorps living allowance and end of service Eli Segal Education award benefit. The comments were further analyzed by the Office of Research and Evaluation and supported a compelling case for increasing the living allowance and expanding flexibilities for the use of the Eli Segal Education End-of-Service Award . AmeriCorps looks forward to continuing to engage with national service stakeholders and the public. We will be announcing opportunities to share input on the plan in the coming months. Contact: ODEIA@americorps.gov Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/about/agency-overview/equity-action-plan",
    "https://americorps.gov/sites/default/files/document/Equity%20Action%20Plan%20Message%20From%20the%20CEO-04-26-2022.pdf",
    "https://www.youtube.com/watch?v=eE1N-J_468Q&amp;list=PLZ54wDoDlX7e9g4AZ2TA-gRn4FR5POZMr&amp;index=4",
    "https://www.youtube.com/watch?v=bj7ue2D5p2Q",
    "https://www.youtube.com/watch?v=1zDaEL6oLzM",
    "https://www.youtube.com/watch?v=DVa_dDRk3gc",
    "https://www.youtube.com/watch?v=cmrPKWQ4Fic&amp;list=PLZ54wDoDlX7e9g4AZ2TA-gRn4FR5POZMr&amp;index=14",
    "https://americorps.zoomgov.com/webinar/register/WN_cPJ9yc8NQt6QBwZSMcpDfw",
    "https://americorps.zoomgov.com/webinar/register/WN_MxSoc_vDTBGZcFSztmoBFQ",
    "https://americorps.zoomgov.com/webinar/register/WN_g6MicAH3Rsajy4t_pv0Vaw",
    "https://americorps.zoomgov.com/webinar/register/WN_80_YjIOGTAO3qEy4YRqIiA",
    "https://americorps.zoomgov.com/webinar/register/WN_zQN18i4ISCedBgZYFTWyAw",
    "https://americorps.zoomgov.com/webinar/register/WN_n7IVq_pOQ5et4HGrUEb4JA",
    "https://www.americorps.gov/newsroom/press-release/americorps-invests-1-billion-pandemic-recovery-through-national-service",
    "https://americorps.gov/about/agency-overview/strategic-plan",
    "https://www.whitehouse.gov/equity",
    "https://www.whitehouse.gov/wp-content/uploads/2022/05/ADVANCING-EQUITY-THROUGH-THE-AMERICAN-RESCUE-PLAN.pdf",
    "https://www.performance.gov/equity",
    "https://americorps.gov/newsroom/news/american-rescue-plan",
    "https://www.americorps.gov/members-volunteers/education-award-faqs",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/AmeriCorps-Equity-Action-Plan.pdf",
    "https://americorps.gov/sites/default/files/document/ODEIA-virtual-summit-program.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC; AmeriCorps State and National; AmeriCorps VISTA; AmeriCorps Seniors; Office of Research and Evaluation",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "about",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "about",
  "subdomain_1": "agency-overview"
}