{
  "id": "americorpsgov_blogs_2022_06_02_empowering_americas_youth_pridehtml",
  "url": "https://americorps.gov/blogs/2022-06-02/empowering-americas-youth-pride",
  "title": "empowering-americas-youth-pride",
  "content": "Empowering America's Youth with Pride | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Empowering America's Youth with Pride Submitted by rfrazier on Thu, 06/02/2022 - 13:59 Jun 02, 2022 AmeriCorps Staff Pride Month celebrates the LGBTQI+ community and serves as tribute to those who pushed gay rights forward as part of a series of events between police and LGBTQI+ protesters. These events stretched over six days beginning June 28, 1969, the Stonewall Riots, which would become the tipping point for the Gay Liberation Movement that grew from “Gay Pride Day” to encompass a month-long celebration. Today, Pride Month also serves as a memorial to those who have lost their lives to hate crimes or HIV/AIDS, as well as a testament to living freely and authentically. During Pride Month, it’s important to spotlight the valuable contributions of LGBTQI+ individuals across America and reaffirm our commitment to stand in solidarity with LGBTQI+ Americans in their ongoing struggle against discrimination and injustice. AmeriCorps members who identify as LGBTQI+ and allies across the nation are at the forefront of this movement making strides through service to empower and support community members. According to The Trevor Project's 2022 National Survey on LGBTQ Youth Health, 73% of LGBTQ youth have experienced discrimination and 36% have been physically threatened. This often leads to or is rooted in feeling unsafe in one’s educational or home environment. When youth don’t feel safe in school, that can lead to truancy, leaving school, poor grades, depression, and even self-harm or suicide, according to another report by GLSEN (Gay, Lesbian Straight Education Network). AmeriCorps members are at forefront of providing much-needed services to students at-risk. Meet Miguel, an AmeriCorps member serving with City Year Kansas City. As he transitioned from being homeless, he discovered City Year Kansas City, where he served as a mentor and tutor at public schools. He soon found his footing as an AmeriCorps member and his passion for helping students, especially for those struggling with their identity. Today, Miguel serves as an impact manager where he oversees peers in their own mentorship journey and builds relationships with families and school staff. “During those first few months of service, I was very skeptical if I belonged at City Year,” said Miguel.  “As someone who barely finished high school myself, I wasn’t sure if I was even the right person to mentor students. But once I began working with my students, I began learning quickly, too. As my knowledge and experiences continued, my confidence and “fit” within the organization became clearer.” Read more about making a difference in students’ lives In California, AmeriCorps members serve with Equality California, the first AmeriCorps program in the country specifically focused on LGBTQI+ youth. Members serve as mentors to students in the Fresno United School District and work to improve students’ social and emotional well-being which, in turn, helps  reduce depression and improves academic performance and grades. Brittney, an AmeriCorps member serving as mentor with Equality California “The end goal of this program is to let students really dive into their own identities, while also preparing them to become leaders by the end of the year,” said Brittney, an AmeriCorps member serving as a mentor. The program works like Big Brothers/Big Sisters. Mentors, like Brittney, ensure LGBTQI+ youth feel safe and supported so that no student is left behind. These members and organizations are at the core of national service. Their duties include  empowering the youngest members of society. AmeriCorps LGBTQI+ members and allies serve across the nation with that same focus. No one should be discriminated against or live in fear simply because of who they are or whom they love. AmeriCorps programs and members address these pressing challenges every day and serve communities most in need. This Pride Month and year-round, AmeriCorps brings these stories to light and honors the work of LGBTQI+ members and allies who fight for equality for all. Previous Giving Back to my AAPI Community through Service Next U.S. Department of Education Partners with AmeriCorps to Meet Educational Needs of Students Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2022-06-02/empowering-americas-youth-pride",
    "https://www.thetrevorproject.org/survey-2022/",
    "https://www.midamericalgbt.org/chamber-voices-i-am-more-than-a-queer-black-male/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2022-06-02/empowering-americas-youth-pride&amp;title=Empowering America&amp;#039;s Youth with Pride ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2022-06-02/empowering-americas-youth-pride&amp;title=Empowering America&amp;#039;s Youth with Pride &amp;source=https://americorps.gov/blogs/2022-06-02/empowering-americas-youth-pride",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2022-06-02/empowering-americas-youth-pride&amp;url=https://americorps.gov/blogs/2022-06-02/empowering-americas-youth-pride&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2022-05-25/giving-back-my-aapi-community-through-service",
    "https://americorps.gov/blogs/2022-06-15/us-department-education-partners-americorps-meet-educational-needs-students",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2022",
  "subdomain_2": "06",
  "subdomain_3": "02"
}