{
  "id": "americorpsgov_blogs_2020_11_10_americorps_vista_taking_poverty_and_racial_injustice_higher_educationhtml",
  "url": "https://americorps.gov/blogs/2020-11-10/americorps-vista-taking-poverty-and-racial-injustice-higher-education",
  "title": "americorps-vista-taking-poverty-and-racial-injustice-higher-education",
  "content": "An AmeriCorps VISTA Taking On Poverty and Racial Injustice in Higher Education | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb An AmeriCorps VISTA Taking On Poverty and Racial Injustice in Higher Education Submitted by admin on Tue, 11/10/2020 - 16:41 Nov 10, 2020 Nicole Jackson Welcome to the Poverty + Racial Injustice Stories Project. Our nation is experiencing an awakening, and for some, an introduction to the injustices that Black people have been facing in this country for decades. We are dedicating this project to the stories of AmeriCorps members whose work goes beyond the VISTA mission to eradicate poverty. These stories will show how their work in tackling this mission intersects with combatting racial injustices in the communities they serve. Our hope is that 1. AmeriCorps members in the VISTA program will be seen and celebrated for their work, 2. The stories will provide a blueprint for others to follow, and 3. By sharing stories from areas including housing, literacy, and nutrition, readers will get a glimpse into just how far reaching the effects of racial injustice can be. Emily Ward California State University System - Center for Community Engagement Long Beach, CA Position: AmeriCorps VISTA Leader 2017 – 2018; 2019-2021 Emily Ward’s passion for serving her community began long before she made the decision to become an AmeriCorps member in the VISTA program. She served with friends and through church opportunities throughout middle and high school and continued volunteering while in college. The opportunity to begin her AmeriCorps journey came once she graduated from undergrad. She was set to attend graduate school for philosophy but decided that she wanted to do something more tangible and less removed from being helpful to others. In 2017, Emily began her first term as an AmeriCorps member with the State and National program the Colorado Reading Corps. In 2019, after briefly attending graduate school, she returned to AmeriCorps, this time serving in the AmeriCorps VISTA program as a VISTA Leader with the California State University (CSU) Stem VISTA Program. What is the goal of the CSU Stem VISTA Program? Our mission is to eliminate equity gaps in STEM undergraduate degree programs in the California State University system for low-income students, women, and students of color. Research has shown that earning a bachelor’s degree increases earning potential throughout one’s lifetime. How does your work combat poverty and racial injustice, particularly in higher education? We believe that higher education is a pathway out of poverty for a lot of students. However, we know that the higher education system is really flawed and was not created with certain students in mind. Historically, higher education has been for upper middle class, white cis-gendered men. We want to look at these systems and see where we can reevaluate and make changes to better honor the gifts and talents that students of color or Pell grant recipients, low-income students, female students, bring to the table since the system was not created with them in mind. A lot of students that we serve are first generation college students who often have to navigate a number of unknown barriers to get into and graduate from college. One of the core models that we utilize in our program is called the Community Cultural Wealth Model . There's an article that we use, and that all of our VISTA members and our cohort read by Dr. Tara J. Yosso. It's really asset and strength based in its approach, stating that students already come to college having a wealth of experiences that are valuable. It’s our systems in academia that don't value things like navigational capital or familial ties or linguistic capabilities of our bilingual or multilingual students. Our program often works with colleges of science or academic support centers and career centers to create programs that support students and their journey throughout school to help increase graduation rates and persistence to graduation trying to utilize and draw from these strengths that students have. What are the results that you’ve seen from this work? One of the biggest factors to graduation is a sense of belonging. If students feel that they belong on a campus and that they're truly a team player there, that dramatically enhances their chances of graduating within four to six years. That's what a lot of our programs are geared towards - financial assistance and creating community. Last year we transitioned our data-tracking to better follow students involved in VISTA programming for four years of undergrad, so in 2023 we should have much better quantitative evidence supporting our work. We do have, however, data from the first three years of the CSU STEM VISTA program showing that the retention equity gap was eliminated for students of color who participated in CSU STEM VISTA supported activities, with 85.87% of URM students retained compared to 85.5% of non-URM. Additionally, 88.77% of Pell-eligible students were retained compared to 84.36% of non-Pell-eligible. Additionally, I’ve seen amazing results in the growth and success of our VISTA members! For example, we’re currently piloting a mentorship program for CSU STEM VISTA alumni to mentor current members. There are four alums mentoring this year: all of them graduated from a California State University, all of them served as VISTA members at a California State University, and all of them now work at different California State University campuses! Our cohorts tend to be just as diverse as the student population we’re serving, so it’s awesome to see the long-term effects of our trainings and professional development for VISTAs who serve with us. They continue to find success and bring all their cross-cultural experiences to their educational and career paths beyond VISTA. What do you wish people understood about the connection between poverty and racial injustice? I really wish that everyone could understand the historical and systemic aspects to racialized poverty and how that affects institutions particularly higher education. I think there is still a fairly pervasive notion in this country that racism and poverty are individual issues - that if someone is living in poverty, it's due to some individual fault or flaw and that racism doesn’t exist on some grand scale and that the two are not intertwined. That's just not the case. There is something in psychology called the fundamental attribution error. It's when someone does something that bothers us and, we think it's a personality flaw. We think it's because they're a bad person rather than because of some circumstance. I believe we fall into that same mindset on a larger scale of victim blaming those who don't achieve the \"norm\" status of middle-class white culture. We, as a white-dominated American culture, think it's a personal fault. We don't see the strengths of other cultures or people of color. We don't see how slavery and Jim Crow and all the things that have happened in this country in the past and are currently happening are the result of a system and not the fault of people who can't ‘pull themselves up by their bootstraps’—a metaphor that is often used to illustrate the opposite of what it means. . This idea bleeds into higher education. Colleges were not created for women, for people of color, for low-income people. They were created for wealthy white men. Just like slavery, we see that trickle down to the here and now. We see how policies that affect students don't consider circumstances. We don't often consider higher education and the struggles in degree attainment for students who work multiple jobs, for students who are parents, for students who are supporting their own families, for students who don't fit the \"norm\" of what we expect a college student to look like. It's not okay. This is what our program wants to change so that people can reap the benefits of having a college education and hopefully lift themselves and their communities out of poverty. How has this impacted how you view racial injustice? Serving in this role has deepened and expanded my understanding of social and racial justice. I was passionate about justice before this but have had the opportunity to dive deep and see how not only pervasive the issue is but find hope in the future. There are so many people who are passionate about the work, who care about it and who are working towards a future where there aren't equity gaps in education and where everyone's story and culture and values are treated as important and valuable. I feel truly honored that I get to work in a position where my job is doing this, is doing something that I find deeply fulfilling on a moral and ethical level. What will you take away from this experience? There's always room at the table for new voices, input, and collaboration. I feel blessed to work with a highly collaborative team - with my co-VISTA leader, with my program manager, and with all the VISTA members we work with. Everyone has different gifts and strengths to bring and different perspectives and experiences and all of them are valuable. It's not a competition. We all work together. Also, the necessity of self-care. A lot of VISTA members are in this work for the right reasons. They care about making the world a better place. They care about equity. Sometimes when you work in higher education, because our society doesn't value that work on an economic scale, I think sometimes people internalize that and we think our time isn't as valuable and our work isn't as valuable because we're not paid as well. So, one thing I always make a point to emphasize in every meeting and training is self-care. There's a culture of self-sacrifice and martyrdom in the nonprofit world that is not sustainable. If our true goal is sustainability and capacity building, we must take care of ourselves first. Why share your story? I wanted to share my story because I think this program is doing incredible work. I believe we have an effective model for engagement that could be useful for other VISTA programs. Any opportunity that I have to get the name of the program out there, I try to jump at because I think what we're doing here is really valuable. We have a low attrition rate of our VISTAs. We have some awesome practices. We are always looking to share and improve the knowledge gained through our collective experience. Previous Veteran AmeriCorps Members Put Service Before Self Next Even Amidst a Pandemic, Veterans Never Stop Serving Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2020-11-10/americorps-vista-taking-poverty-and-racial-injustice-higher-education",
    "http://www.calstate.edu/cce/",
    "http://scholar.google.com/scholar_url?url=https://www.academia.edu/download/21775801/culturalwealth.pdf&amp;hl=en&amp;sa=X&amp;ei=y-uJX-_eGYKOygTu9JSwBw&amp;scisig=AAGBfm2oZ37-CEk1NUts7KiwsKq97QJ64g&amp;nossl=1&amp;oi=scholarr",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2020-11-10/americorps-vista-taking-poverty-and-racial-injustice-higher-education&amp;title=An AmeriCorps VISTA Taking On Poverty and Racial Injustice in Higher Education",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2020-11-10/americorps-vista-taking-poverty-and-racial-injustice-higher-education&amp;title=An AmeriCorps VISTA Taking On Poverty and Racial Injustice in Higher Education&amp;source=https://americorps.gov/blogs/2020-11-10/americorps-vista-taking-poverty-and-racial-injustice-higher-education",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2020-11-10/americorps-vista-taking-poverty-and-racial-injustice-higher-education&amp;url=https://americorps.gov/blogs/2020-11-10/americorps-vista-taking-poverty-and-racial-injustice-higher-education&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2020-11-10/veteran-americorps-members-put-service-self",
    "https://americorps.gov/blogs/2020-11-10/even-amidst-pandemic-veterans-never-stop-serving",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2020",
  "subdomain_2": "11",
  "subdomain_3": "10"
}