{
  "id": "americorpsgov_blogs_2024_03_11_americorps_week_americorps_nccc_directors_salute_americas_young_adultshtml",
  "url": "https://americorps.gov/blogs/2024-03-11/americorps-week-americorps-nccc-directors-salute-americas-young-adults",
  "title": "americorps-week-americorps-nccc-directors-salute-americas-young-adults",
  "content": "AmeriCorps Week: AmeriCorps NCCC Director’s Salute to America’s Young Adults | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps Week: AmeriCorps NCCC Director’s Salute to America’s Young Adults Submitted by dsong on Sun, 03/10/2024 - 20:18 Mar 11, 2024 Ken Goodson Happy AmeriCorps Week ! During AmeriCorps’ 30th anniversary , the nation celebrates the Americans who have answered the call to serve our communities during AmeriCorps Week. AmeriCorps members, AmeriCorps Seniors volunteers, and alumni have committed to addressing our country’s most pressing challenges for the past 30 years, demonstrating that national service is not a moment but a movement to bring out the best of America. Ken, left, with AmeriCorps members serving with the NCCC program in Colorado To kickstart AmeriCorps Week celebrations, AmeriCorps NCCC Director Ken Goodson shares how his commitment to service started as a young adult helps him lead a program for 18-26-year-olds, transforming communities and their lives. From Peace Corps Volunteer to National Service Director I grew up in a family that volunteered a lot. My grandfather was a bishop in the church, so naturally, I spent a lot of my youth with regular commitments at the food bank and staffing the shelter run in the church basement. I then had the eye-opening experience of living overseas as a young adult when I spent two years as a student in the South Pacific. The intensity and joy of life outside of one’s comfort zone was addictive. I then joined the Peace Corps was the intersection between those two passions of serving others and gaining new experiences – service to my fellow human and living outside my comfort zone. I originally signed up to serve two years, which became 15 years with the Peace Corps, mostly overseas. At Peace Corps, my fondest memory is being a part of a five-person team that created a reform plan for the agency, which resulted in the largest increase in appropriations in Peace Corps history. Giving back to an organization that invested in me as a Peace Corps alum was fulfilling. Ken, third from right in second row, during his term as Peace Corps country director in Mongolia I was in Washington, DC, preparing to relocate to Nepal for work when I saw the AmeriCorps NCCC Region Director position posted in 2012. I applied primarily because AmeriCorps NCCC’s mission to strengthen communities and develop leaders through service resonated strongly with me. The opportunity to be associated with this mission and ensure service benefits both those who serve and those who request our services was too good of an opportunity to pass up. My family scrapped our plans for Nepal and moved to Colorado with AmeriCorps NCCC in July of 2012. After serving as the Southwest region director for seven years, I left AmeriCorps NCCC to serve as regional administrator for the launch of AmeriCorps Office of Regional Operations Mountain region in 2019. I love start-ups and remain grateful for this opportunity. I returned to AmeriCorps NCCC in 2021 and have been the director since April of 2022. Young Adults are Pivotal for Personal Development, and the Community From coast to coast, our members serving in the AmeriCorps NCCC program travel as a team to support national and community priorities such as environmental conservation, climate resilience, and disaster recovery in affected communities. AmeriCorps NCCC offers four service pathways: In the Traditional Corps , teams of AmeriCorps members and team leaders serve full-time with local and national partner organizations to complete hands-on projects. Summer of Service is largely the same as Traditional Corps, but for a shorter commitment that aligns with the summer months and subsequently reduces barriers to participation for interested young adults. FEMA Corps is where AmeriCorps members and team leaders serve full-time to advance FEMA-identified priorities focused on disaster preparedness, mitigation, response, and recovery projects. Forest Corps is a new program created in partnership with the US Forest Service, where AmeriCorps members and team leaders will support projects that focus on wildland fire prevention, reforestation, and more starting in the summer of 2024. Ken, fourth from left, during a hike with AmeriCorps members serving with the NCCC program in New Mexico AmeriCorps NCCC programs deliver impactful service experiences for young adults that frequently make an impact on their lives and career paths. Our members deliver for community partners and disaster survivors who rely on AmeriCorps NCCC and FEMA Corps teams to meet their most pressing needs. All our programs, and soon including the Forest Corps, are team-based. Our teams are built with young adults from all different walks of life. You don’t serve in AmeriCorps NCCC if you are looking to operate within your comfort zone or surround yourself with those who see the world the same as you. While the program’s mission of strengthening communities and developing leaders is always essential to our nation, in a polarized America, it is AmeriCorps NCCC’s model of bringing a diverse collection of young adults and community partners from different backgrounds together to pursue common goals and a shared purpose that makes it particularly important today. Our country needs more of the discomfort that AmeriCorps NCCC allows our members and partners to face, address, and ultimately thrive in. As a regional director, regional administrator, and now AmeriCorps NCCC director, launching new programs and partnerships with my colleagues has been a joy. I have the privilege of seeing firsthand how these young adults are making a difference in communities and their own lives through service. While a regional administrator at the Office of Regional Operations, I worked with NCCC and agency colleagues at the onset of the COVID-19 pandemic to build a program that leveraged each of the agency’s programs. More than 1,000 individuals served, and more than 60,000 Coloradans benefitted. More recently, our AmeriCorps NCCC team worked to construct the Forest Corps program. This type of teamwork, where we put our heads together to leverage 30 years of the program history to meet the moment of today by creating a new program focused on climate change and building the next generation of environmental leaders for our nation, was a wonderful experience. Ken, second from right, visiting an AmeriCorps NCCC team serving in Homer, Alaska Group accomplishments and team efforts are my favorites. Last year, I had the chance to visit our members serving in Homer, Alaska. The team at AmeriCorps members serving with the Alaska Center for Coastal Studies help protect and preserve the state’s outdoors, providing environmental education, building garden beds, and removing invasive species while also learning professional skills to prepare them for their future careers. Several of the team members then received job offers from the community organizations they partnered with. Creating New Opportunities Through Service Ken, third from left in second row, during AmeriCorps Week 2023 celebrations with AmeriCorps members serving with NCCC, community partners, AmeriCorps colleagues, and elected officials I’ve seen how national service has transformed our country throughout the years. Since 2000, AmeriCorps NCCC teams have assisted more than 20.6 million people in disaster areas, recruited or coordinated nearly 940,000 volunteers, and protected more than 1.6 million acres of land through firefighting and land management. And today, service continues to give me hope. No matter what I read or hear in the news, a site visit to spend time with an AmeriCorps member or AmeriCorps Seniors volunteer in action reminds me why it is not naïve to be optimistic. As we celebrate AmeriCorps Week , I send my appreciation not only to our members and AmeriCorps Seniors volunteers but to my colleagues at AmeriCorps NCCC and across the agency, as well as to the millions of AmeriCorps alums and community partners I’ve been fortunate to work with and learn from over the past 12 years. Thank you for your service, and let’s keep the AmeriCorps movement going. Previous Celebrate National Service Members of the World During AmeriCorps Week Next AmeriCorps Week: How a Five-Year-Old's Service Started and How It’s Going Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2024-03-11/americorps-week-americorps-nccc-directors-salute-americas-young-adults",
    "https://americorps.gov/americorpsweek",
    "https://americorps.gov/americorps30",
    "https://americorps.gov/serve/americorps/americorps-nccc",
    "https://americorps.gov/serve/americorps/americorps-nccc/traditional-corps",
    "https://americorps.gov/summerofservice",
    "https://americorps.gov/serve/americorps/americorps-nccc/fema-corps",
    "https://americorps.gov/serve/americorps/americorps-nccc/forest-corps",
    "https://socialpresskit.com/americorps30#americorps-week-2024",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2024-03-11/americorps-week-americorps-nccc-directors-salute-americas-young-adults&amp;title=AmeriCorps Week: AmeriCorps NCCC Director’s Salute to America’s Young Adults ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2024-03-11/americorps-week-americorps-nccc-directors-salute-americas-young-adults&amp;title=AmeriCorps Week: AmeriCorps NCCC Director’s Salute to America’s Young Adults &amp;source=https://americorps.gov/blogs/2024-03-11/americorps-week-americorps-nccc-directors-salute-americas-young-adults",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2024-03-11/americorps-week-americorps-nccc-directors-salute-americas-young-adults&amp;url=https://americorps.gov/blogs/2024-03-11/americorps-week-americorps-nccc-directors-salute-americas-young-adults&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2024-03-08/celebrate-national-service-members-world-during-americorps-week",
    "https://americorps.gov/blogs/2024-03-13/americorps-week-how-five-year-olds-service-started-how-its-going",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC; AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2024",
  "subdomain_2": "03",
  "subdomain_3": "11"
}