{
  "id": "americorpsgov_blogs_2020_11_20_americorps_and_americorps_seniors_covid_19_responsehtml",
  "url": "https://americorps.gov/blogs/2020-11-20/americorps-and-americorps-seniors-covid-19-response",
  "title": "americorps-and-americorps-seniors-covid-19-response",
  "content": "AmeriCorps and AmeriCorps Seniors COVID-19 Response | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps and AmeriCorps Seniors COVID-19 Response Submitted by kaparker on Wed, 12/09/2020 - 14:07 Nov 20, 2020 Erin Delany, AmeriCorps staff More than 21,400 AmeriCorps Members and AmeriCorps Seniors Volunteers Actively Engaged in COVID-19 Response. In spite of the challenges presented by the COVID-19 pandemic, national service  programs continue to respond to the needs of their communities in innovative and timely ways. Since the beginning of the public health crisis, more than 21,400 AmeriCorps members and AmeriCorps Seniors volunteers have responded to the pandemic through direct service initiatives. Collectively, these  members and volunteers have: Assisted an estimated 4.4 million people Provided more than 10 million meals Supported more than 950 mass care facilities Collected and distributed more than 56.5 million pounds of food and Conducted more than 725,000 wellness checks. In addition to direct COVID-19 responders, thousands of other AmeriCorps members and AmeriCorps Seniors volunteers continue to help their communities by virtually teaching and mentoring youth, supporting veterans and military families, protecting public lands, responding to natural disasters, combatting senior isolation, and more. National service programs and grantees across the country have executed a number of direct initiatives to support communities as they recover from the impact of the pandemic. Recent innovative responses include: In Colorado , the Department of Public Health and Environment is recruiting an additional 100 AmeriCorps members to serve in the state’s COVID-19 Containment Response Corps (CCRC) . Since June, more than 470 AmeriCorps members and 165 AmeriCorps Seniors volunteers have served in Colorado’s CCRC, an effort which Colorado Governor Jared Polis describes as “an important part of Colorado’s COVID-19 response.” In Vermont , the Rutland and Addison County AmeriCorps Seniors RSVP program is finding new ways to serve while keeping their volunteers safe. AmeriCorps Seniors volunteers serving in RSVP are giving back to their communities while remaining socially distant or safe at home: recent volunteer efforts include delivering groceries for fellow seniors with less mobility or greater COVID risk, conducting a drive-through food drive for families in need, and sewing almost 4,000 reusable masks. In Washington , the South Whidbey School District is using AmeriCorps members to get students back in the classroom. The South Whidbey School District founded their school farm six years ago, but in the wake of the pandemic it has become an essential tool to facilitate in-person learning. With the help of AmeriCorps members, the South Whidbey School District built a curriculum around their school farm that encourages students to get outside, fostering healthy eating habits and physical activity while staying COVID-safe. In New York , an AmeriCorps member serving in the VISTA program is collaborating with Mutual Aid Tompkins County to coordinate a series of outdoor pantries with nonperishable food items and toiletries. These pantries are stocked by community donations, with a goal of combatting the increased rates of food insecurity caused by the COVID-19 pandemic. Stories of the Week Across the country, AmeriCorps members and AmeriCorps Seniors volunteers continue to rise to the challenges created by the COVID-19 pandemic, serving their communities where the need is greatest. These excerpts of stories of service from across the country represent just a few of the ways that our members and volunteers continue to work with local organizations to “get things done” for America. Hometown Heroes: Partnership brings WiFi to local students (Hawaii) Nonprofit organizations Hawaii County Economic Opportunity Council (HCEOC), Teach For America Hawaii, and HawaiiKidsCAN partnered with Kahakai Elementary School and the Hawaii County Department of Research and Development to equip a vehicle with a mobile router from Cradlepoint that features unlimited wireless data from AT&T. This hub is on a route to bring connectivity directly to students, and is able to provide high-speed internet at a radius of 100 feet to 200 feet for approximately 100 simultaneous users, depending on specific terrain of the area, ensuring that students are able to access online programming while maintaining safety guidelines and social distancing. Nonprofit making crucial repairs to Las Vegas homes (Nevada) \"All the people who applied for it have to either have lost their job due to COVID and need a critical repair on their home or sheltering in place due to COVID,\" says Rebuilding Together Executive Director, Bob Cleveland. He says the grant money will help about 100 valley homeowners with issues like; water and plumbing leaks, roof repairs, plus A/C and heating problems. Research Underway To Determine Pandemic's Impact On Iowa's Immigrants (Iowa) The Socio-Economic Health and Well-Being of Immigrants Living in the State of Iowa During the COVID-19 Pandemic project will research how the COVID-19 pandemic has affected, and is still affecting, Iowa’s immigrant population. Nonprofit organization DREAM Iowa partnered with the Ethnic Minorities of Burma Advocacy and Resource Center (EMBARC), the AmeriCorps Refugee RISE program and a University of Northern Iowa public health graduate student to survey immigrants and refugees living in the state. Habitat for Humanity Back to Work (California) Habitat for Humanity of Greater Sacramento is back to work helping those in need. Back in March, the Sacramento branch of the organization had to lay off 90 percent of its staff. With the help from the Paycheck Protection Program and River City Bank, the nonprofit was able to bring workers back in April. Today, Congresswoman Doris Matsui visited the Habitat for Humanity workers. Members of the nonprofit say support like that from local and state leaders in the community is greater than ever before. Previous AmeriCorps Seniors: Creativity and Community During COVID-19 Next AmeriCorps Member Changes Career Aspiration after Moving Gap Year in VISTA Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2020-11-20/americorps-and-americorps-seniors-covid-19-response",
    "https://www.coloradopolitics.com/coronavirus/colorado-to-recruit-100-americorps-members-for-covid-19-containment-force/article_b2261f60-3b85-5007-8199-0e143e615979.html",
    "https://www.rutlandherald.com/news/senior-volunteer-programs-adjusts-to-covid/article_48202b8a-1a27-5f0a-b4e1-390275a70109.html",
    "https://www.seattletimes.com/education-lab/how-a-whidbey-island-school-district-is-using-its-beloved-farm-to-bring-students-back-to-in-person-learning/",
    "https://theithacan.org/life-culture/local-food-pantries-provide-support-during-pandemic/",
    "https://www.westhawaiitoday.com/2020/11/18/hawaii-news/hometown-heroes-partnership-brings-wifi-to-local-students/",
    "https://www.ktnv.com/rebound/coronavirus-money-help/nonprofit-making-crucial-repairs-to-valley-homes",
    "https://www.iowapublicradio.org/ipr-news/2020-10-21/research-underway-to-determine-pandemics-impact-on-iowas-immigrants",
    "http://my.tvey.es/y8S7E",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2020-11-20/americorps-and-americorps-seniors-covid-19-response&amp;title=AmeriCorps and AmeriCorps Seniors COVID-19 Response",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2020-11-20/americorps-and-americorps-seniors-covid-19-response&amp;title=AmeriCorps and AmeriCorps Seniors COVID-19 Response&amp;source=https://americorps.gov/blogs/2020-11-20/americorps-and-americorps-seniors-covid-19-response",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2020-11-20/americorps-and-americorps-seniors-covid-19-response&amp;url=https://americorps.gov/blogs/2020-11-20/americorps-and-americorps-seniors-covid-19-response&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2020-11-20/americorps-seniors-creativity-and-community-during-covid-19",
    "https://americorps.gov/blogs/2021-01-12/americorps-member-changes-career-aspiration-after-moving-gap-year-vista",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2020",
  "subdomain_2": "11",
  "subdomain_3": "20"
}