{
  "id": "americorpsgov_blogs_2024_06_20_americorps_30_creating_new_pathways_employmenthtml",
  "url": "https://americorps.gov/blogs/2024-06-20/americorps-30-creating-new-pathways-employment",
  "title": "americorps-30-creating-new-pathways-employment",
  "content": "AmeriCorps 30: Creating New Pathways to Employment | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps 30: Creating New Pathways to Employment Submitted by elennevillehutchinso on Thu, 06/20/2024 - 10:11 Jun 20, 2024 AmeriCorps The US Office of Personnel Management announced a rule change for the Pathways Program taking effect Tuesday, June 11, 2024, expanding opportunities for AmeriCorps members and alumni. Now, individuals with or without degrees who have completed their AmeriCorps term of service are eligible to participate in the Pathways Recent Graduates and Interns programs , providing opportunities for paid work in agencies to kickstart their careers in the federal government. Joey Heavner, a former pathways program presidential management fellow at AmeriCorps, shares how the Pathways Program can benefit AmeriCorps members during the agency’s 30th anniversary pathways to employment month. 1. What is the Pathways Program? The federal government uses the Pathways Program to hire individuals in the early stages of their careers. Participants receive a variety of benefits, including noncompetitive conversion to a term or permanent job in the federal civil service upon completion of their program. The Pathways Program offers opportunities for training, mentorship, and temporary assignments with other agencies—all of which can help you grow as a professional. 2. How did you first learn about the Pathways Program? I first heard about the Pathways Program from my classmates while completing my Master of Public Policy degree at the University of Maryland. While I wasn’t initially considering a career in the federal government, the idea grew on me throughout my education program. I worked for a few years in nonprofit organizations, so the opportunity to serve and make a positive impact appealed to me. 3. How has your career advanced since you started the program? I used to work as an accountant, and my days were monotonous. I felt disconnected from the impact of my work. So, I went back to school to pivot to a more dynamic and relationship-oriented position. I couldn’t have imagined a better fulfillment than my experience with the Pathways Program. Through the program, I developed a passion for helping others find their own path to a successful career. A key part of my fellowship was my temporary detail at AmeriCorps, which focused on the intersection of national service and workforce development. My supervisor invested a tremendous amount in my professional development. I was able to attend a conference where I learned much more about national service programs and co-presented a workshop. That experience deepened my passion for helping others find the right career path for themselves. After completing the program, I secured a permanent position as a program analyst in the Department of Labor’s Office of Apprenticeship. Previous Next 4. What do you need to succeed in the Pathways Program? A dedication to public service is essential. Traits like patience, hard work, and creativity are also crucial to success. People who can bring diverse backgrounds and strengths to the Pathways Program make the federal civil service stronger and our country a better place. 5. Do you have any advice for people looking to enter the Pathways Program? I would cast a wide net when searching for a role. Take the chance to learn about different federal agencies, even ones that are tangential to your core interests. You might find a perfect role on an amazing team in a place you weren't expecting. 6. How can national service kickstart careers? My Pathways Program experience helped me get to where I am today. I love the work I get to do supporting the development of registered apprenticeship programs , providing opportunities to individuals from diverse backgrounds and helping employers in a wide array of industries. Just like AmeriCorps members, individuals who complete their apprenticeships are eligible to participate in the Pathways Program. AmeriCorps programs are integral to developing meaningful career pathways for AmeriCorps members. To learn about the benefits of AmeriCorps, and to become involved in one of AmeriCorps’ programs focused on career building, visit the Pathways to Employment Fact Sheet . Joey is a program analyst at the US Department of Labor, Employment and Training Administration. He serves in the Strategic Partnerships and Industry Engagement Division in the Office of Apprenticeship. Joey previously served in the US Department of Labor’s Employment and Training Administration's Office of the Assistant Secretary with a focus on workforce development policy and programs, providing communications, external engagement, and project management support to agency leadership. He supported the Employment and Training Administration's “Investing in America” and place-based development portfolios, including the “Good Jobs, Great Cities” initiative. Prior to joining the Department of Labor, Joey completed a Master of Public Policy program at the University of Maryland, gaining experience in climate and sustainability work, impact investing, and communications. Before entering graduate school, he worked in the private and nonprofit sectors. In the nonprofit sector, he worked on international economic development through financial inclusion programs in low-resource contexts – microloans, small and medium enterprise lending, and savings groups. In the private sector, Joey was a certified public accountant and served as an internal and external auditor. Joey lives in Baltimore, Md., with his wife and two-year-old daughter. He enjoys spending time with his family and friends, reading, running, cycling, exploring cities, and watching soccer. Previous AmeriCorps 30: My Pathway from Service to Higher Education Next AmeriCorps 30: Celebrations Across the Nation to Recognize the Impact of National Service Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2024-06-20/americorps-30-creating-new-pathways-employment",
    "https://help.usajobs.gov/working-in-government/unique-hiring-paths/students",
    "https://www.apprenticeship.gov/",
    "https://americorps.gov/sites/default/files/document/AmeriCorps-Pathways-Employment-Fact-Sheet.pdf",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2024-06-20/americorps-30-creating-new-pathways-employment&amp;title=AmeriCorps 30: Creating New Pathways to Employment",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2024-06-20/americorps-30-creating-new-pathways-employment&amp;title=AmeriCorps 30: Creating New Pathways to Employment&amp;source=https://americorps.gov/blogs/2024-06-20/americorps-30-creating-new-pathways-employment",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2024-06-20/americorps-30-creating-new-pathways-employment&amp;url=https://americorps.gov/blogs/2024-06-20/americorps-30-creating-new-pathways-employment&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2024-06-17/americorps-30-my-pathway-service-higher-education",
    "https://americorps.gov/blogs/2024-06-27/americorps-30-celebrations-across-nation-recognize-impact-national-service",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2024",
  "subdomain_2": "06",
  "subdomain_3": "20"
}