{
  "id": "americorpsgov_blogs_2013_03_27_service_news_digest_cncs_newshtml",
  "url": "https://americorps.gov/blogs/2013-03-27/service-news-digest-cncs-news",
  "title": "service-news-digest-cncs-news",
  "content": "Service News Digest: CNCS in the News | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Service News Digest: CNCS in the News Submitted by admin on Wed, 03/27/2013 - 00:00 The Service News Digest is a regular feature on the Serve.gov blog. In this series, we showcase articles that feature national service and Corporation for National and Community Service programs. Take a look at some of the great stories that had people talking recently. AmeriCorps Conserving, one step at a time The Citizens' Voice (Pennsylvania), March 18, 2013 Tiffany Welch, 25, is a member of AmeriCorps, a government civil service program that does work in areas such as education, conservation and housing. She and her colleagues clamp into the breaker box and install a transmitter for a wireless energy display that will allow the resident to monitor her energy use, and more importantly, how much money she is spending. School crisis teams ready to respond UT San Diego (California), March 25, 2013 Buchheit was one of 11 counselors and psychologists from the county office who went to El Camino High School and Cesar Chavez Middle School on March 14. The team augmented the schools' own counselors and psychologists and volunteers from the Promoting Achievement and Student Success (PASS) AmeriCorps program. Low-income families in mountains get boost from Habitat for Humanity The Denver Post - Online (Colorado), March 25, 2013 Blue Spruce Habitat for Humanity is branching out to other areas in the mountains. With three houses being erected in Evergreen and three more in the planning stage, the nonprofit also is in the design phase for a house in Idaho Springs. […] Cyndy Cservenyak, an AmeriCorps volunteer, works on outreach and also coordinates volunteers for build days. Minnesota Reading Corps helps her give back to the community Park Bugle (Minnesota), March 25, 2013 Minnesota Reading Corps is a research-based AmeriCorps program targeted at Minnesota students from age 3 through third grade with the goal of helping ensure all Minnesota children are on track to reading proficiency by the end of third grade. I work one-on-one daily with my students, monitor their progress weekly and have a file full of graphs to show their growth that I can share with their teachers. It's inspiring to see the number of letter sounds or words they can read in a minute increasing each week. AmeriCorps Project Conserve tours Polk County farms Tryon Daily Bulletin – Online (North Carolina), March 25, 2013 Project Conserve is an AmeriCorps program unique to western North Carolina, and members are placed at host sites that focus on land conservation, water quality, energy conservation, and local food and farmland initiatives. Two serve Macoupin County through AmeriCorps State Journal-Register - Online (Illinois), March 24, 2013 Alexandria “Alex” Boles, one of two people serving a stint at the Macoupin County Public Health Department as a member of the AmeriCorps service program, has found her duties to be an eye-opener when it comes to working with domestic violence victims. Homeless role-playing event draws attention to Grand Rapids' housing challenges MLive.com (Michigan), March 21, 2013 Michigan's Campaign to End Homelessness and AmeriCorps are teaming up for a simulation designed to raise awareness of the challenges many people face in obtaining affordable housing. Rebuild Joplin celebrates opening of 59th house Joplin Globe - Online (Missouri), March 20, 2013 “Once they got out of that immediate crisis mode, they looked at what was the biggest need, and the biggest need was housing,” she said. Rebuild Joplin now operates with a paid staff of eight to 10, and a volunteer staff from AmeriCorps of about 35 to 40, Finnie said. A Place to Power Up: Technology and Teamwork Edutopia (California), March 19, 2013 Through one of its many partnerships, PowerUP has teamed with the national AmeriCorps VISTA program to provide two staffers for each new center. These individuals work closely with the staff of partnering organizations to ensure that computer-related activities are coordinated with other programs for youth. Build-a-Bed project responds to needs of county children Tribune Courier - Online (Kentucky), March 18, 2013 Thirty or more Marshall County children will be sleeping in new beds this year, thanks to the Build-a-Bed project. Debbie Proctor, a reading and math interventional teacher at Jonathan Elementary School, is a member of AmeriCorps. She and other AmeriCorps teachers in the county have selected Build-a-Bed as their service project. AmeriCorps NCCC Raven 5 team swoops in to do good works The Meadville Tribune (Pennsylvania), March 25, 2013 The Adopt a Roof program is moving slowly but surely after winter storms grounded National Civilian Community Corps (NCCC) team Raven 5, expected to complete 15 roofing projects by mid-April. AmeriCorps VISTA Storm recovery VISTA shares her experiences The Daily Mountain Eagle - Online (Alabama), March 23, 2013 A month in Walker County wasn't enough for Karen Neupauer. Neupauer, who spoke to the Rotary Club of Jasper this week, is a native of Lancaster, Pa., who is currently assisting with long-term recovery efforts as an AmeriCorps VISTA. Neupauer had a successful career in the construction industry before a slowdown in the economy inspired her to dedicate more time to disaster relief. Senior Corps: RSVP Help with legal matters readily available Centre Daily Times (Pennsylvania), March 25, 2013 According to Taylor, the Retired Senior Volunteer Program assists with income tax preparation for low- to middle-income taxpayers. Through the sponsorship of the county commissioners, the RSVP and Penn State, free tax help is available in Centre County. An IRS effort called the Volunteer Income Tax Assistance program also offers free tax help to low-to-moderate income individuals/families that generally fall lower than $51,000 combined household income. RSVP celebrates 40th anniversary The News-Courier - Online (Alabama), March 23, 2013 Dr. Sidney Sandridge, former president of Athens State College wrote the first RSVP grant for Limestone County in 1973. Today, RSVP has 381 active volunteers serving more than 145,000 hours annually working with 55 volunteer stations. Veterans and Military Families National Guard Kicks Off 'Joining Community Forces' TheBayNet.com (Maryland), March 24, 2013 The National Guard Bureau recently signed an agreement with the Corporation for National and Community Service to work together to develop and mature a network of support in the three critical areas of employment, wellness, and education. Watson said the CNCS already has dedicated more than 100 members of Volunteers in Service to America to help develop and foster this critical network of support at the local level across the United States. City Year City Year hopes to improve education in South LA Intersections South LA (California), March 18, 2013 Over 200,000 South LA residents do not have a high school diploma according to the 2000 census. City Year, a non-profit organization that partners with public schools to help students succeed, hopes to change this. Previous AmeriCorps Works for Disaster Services Next Chavez Day of Service Sows Seeds of Healthy Eating, Sustainability Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2013-03-27/service-news-digest-cncs-news",
    "http://photos.nationalservice.gov/Servegov/As-Seen-onServegov/11021047_TH7QMx#!i=1177334462&amp;k=XFvVqzV&amp;lb=1&amp;s=A",
    "https://citizensvoice.com/news/conserving-one-step-at-a-time-1.1459793",
    "https://www.utsandiego.com/news/2013/mar/25/counselors-help-students-crisis-trauma/",
    "https://www.denverpost.com/news/ci_22863215/low-income-families-mountains-get-boost-from-habitat",
    "https://www.parkbugle.org/minnesota-reading-corps-helps-her-give-back-to-her-community/",
    "https://www.tryondailybulletin.com/2013/03/22/americorps-project-conserve-tours-polk-county-farms/",
    "https://www.sj-r.com/top-stories/x609791567/Two-serve-Macoupin-County-through-AmeriCorps",
    "https://www.mlive.com/news/grand-rapids/index.ssf/2013/03/homeless_simulation_event_tomo.html",
    "https://www.joplinglobe.com/local/x1221093473/Rebuild-Joplin-celebrates-opening-of-59th-house",
    "https://www.edutopia.org/place-to-power-up",
    "https://www.tribunecourier.com/view/full_story/21951267/article-Build-a-Bed-project-responds-to-needs-of-county-children",
    "https://meadvilletribune.com/local/x765745952/Raven-5-team-swoops-in-to-do-good-works",
    "https://www.mountaineagle.com/view/full_story/22052863/article-Storm-recovery-VISTA-shares-her-experiences?instance=main_article",
    "https://www.centredaily.com/2013/03/25/3549651/help-with-legal-matters-readily.html",
    "https://enewscourier.com/x2000919683/RSVP-celebrates-40th-anniversary",
    "https://www.thebaynet.com/news/index.cfm/fa/viewstory/story_ID/31479",
    "https://www.intersectionssouthla.org/index.php/story/city_year_hopes_to_improve_education_in_south_la2/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2013-03-27/service-news-digest-cncs-news&amp;title=Service News Digest: CNCS in the News",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2013-03-27/service-news-digest-cncs-news&amp;title=Service News Digest: CNCS in the News&amp;source=https://americorps.gov/blogs/2013-03-27/service-news-digest-cncs-news",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2013-03-27/service-news-digest-cncs-news&amp;url=https://americorps.gov/blogs/2013-03-27/service-news-digest-cncs-news&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2013-03-21/americorps-works-disaster-services",
    "https://americorps.gov/blogs/2013-03-28/chavez-day-service-sows-seeds-healthy-eating-sustainability",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC; AmeriCorps VISTA",
  "focus_population": [
    "Veterans and Military Families",
    "Low-income"
  ],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2013",
  "subdomain_2": "03",
  "subdomain_3": "27"
}