{
  "id": "americorpsgov_about_agency_overview_no_fear_acthtml",
  "url": "https://americorps.gov/about/agency-overview/no-fear-act",
  "title": "no-fear-act",
  "content": "No FEAR Act | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb About Agency Overview No FEAR Act Agency Overview Agency-Wide Policies and Notices AmeriCorps Fraud Alert AmeriCorps’ Equity Action Plan Budget and Performance Plans Civil Rights for Employees, Service Members, and Volunteers Digital Strategy Disability and Accessibility Federal Register Notices FOIA and the Privacy Act No FEAR Act Open Government Plain Writing Privacy Policy Results of Grant Competitions Statutes and Regulations Strategic Plan Vulnerability Disclosure Policy No FEAR Act On May 15, 2002, President George W. Bush signed legislation called the No FEAR Act (Notification and Federal Antidiscrimination and Retaliation Act of 2002). This act, which took effect on October 1, 2003, makes Federal agencies individually accountable for violations of anti-discrimination and whistleblower protection laws. The intent of the No FEAR Act is to help ensure that federal agencies demonstrate a commitment to ensuring that employees who pursue claims under the federal administrative equal employment opportunity (EEO) complaint process and who engage in whistleblower activities are protected and are not  subjected to retaliation.  The law also encourages Federal agencies to expeditiously resolve complaints that are raised at the administrative level when it is appropriate to do so. Requirements and agency responsibilities under the No FEAR Act include: Payment of settlements and judgments: Agencies that lose or settle discrimination and whistleblower cases must pay judgments out of their individual budgets. In the past, most of these settlements and judgments were paid from a government-wide “judgment fund.” Under the No FEAR Act, agencies must reimburse the fund for court judgments and settlement payments to complainants. Employee information and education: Agencies must give their employees, former employees, and applicants for employment written notification of discrimination and whistleblower protection laws. This written notification must include posting the information on the agency’s web site. Agencies are also required to provide their employees with training regarding the rights and remedies applicable to them under these laws. The U.S. Office of Special Counsel (OSC) ( www.osc.gov ) is responsible for ensuring that agencies meet their obligations to inform and educate their employees regarding the Whistleblower Protection Act. The Office of Special Counsel is an independent federal investigative and prosecutorial agency whose basic mission is to guard against prohibited personnel practices in the federal workplace, with a special emphasis on protecting government whistleblowers. Training for managers: Agencies should ensure that managers have adequate training in the management of a diverse workforce, dispute resolution and other essential communication skills. Annual reports to Congress: Each agency must file an annual report with Congress, the Equal Employment Opportunity Commission, and the Attorney General providing information about discrimination and whistleblower cases filed against the agency, including details on how cases were resolved and any disciplinary actions against agency employees resulting from violations of discrimination and whistleblower protection laws. Posting of EEO complaint data on the Internet: Each Federal agency must post on its public web site summary statistical data relating to equal opportunity complaints filed against the agency. The agency must post data for the current fiscal year on a cumulative basis (year-to-date information), updated quarterly. An agency also must post year-end data for the five previous fiscal years for comparison purposes. In addition, section 302 of the No FEAR Act requires the Equal Employment Opportunity Commission (EEOC) to post government-wide, summary statistical data pertaining to hearings requested under 29 C.F.R. Part 1614 and appeals filed with EEOC. The posting of EEO data on agency public web sites is intended to assist Congress, Federal agencies, and the public in assessing whether and the extent to which agencies are living up to their equal employment opportunity responsibilities.  (The specific data to be posted is described in section 301(b) of the No FEAR Act and 29 C.F.R. 1614.704. See the Final Rule regarding Posting Requirements in Federal Sector Equal Employment Opportunity). Read the No FEAR Act Read AmeriCorps’ Latest No FEAR Act Report 2022: No FEAR Act report (FY2022, Q3) No FEAR Act report (FY2022, Q2) No FEAR Act report (FY2022, Q1) 2021: No FEAR Act report (FY2021, Q1) No FEAR Act report (FY2021, Q2) No FEAR Act report (FY 2021, Q3) No FEAR Act report (FY 2021, Q4) Civil Rights and Workforce Diversity Policy As the Chief Executive Officer, I am committed to fostering a workplace which is free of discrimination or harassment in any form, providing all employees the ability to compete on a fair and level playing field. AmeriCorps is committed to treating all persons with dignity and respect while building a diverse, equitable, inclusive, and accessible workplace in which its benefits and opportunities for advancement are available to all. We will achieve this by strengthening the foundations of diversity, equity, inclusion, and accessibility (DEIA) at AmeriCorps. We will prioritize the well-being of employees by fostering an environment that is inclusive and fair; and that encourages participation of all employees in every facet of AmeriCorps, by weaving DEIA into every aspect of workplace culture. Our leadership is firmly committed to promoting a climate of mutual respect and appreciation for all AmeriCorps employees, enabling all to thrive. Every AmeriCorps manager, supervisor, and employee must abide by this policy. Promoting DEIA includes meeting our obligations under the laws, regulations, and executive orders meant to prevent or remedy discrimination. This policy covers all personnel programs, management practices, and decisions, including, but is not limited to, recruitment, hiring, merit promotions, transfers, reassignments, training, career development, benefits, and separations. Our leadership recognizes that achieving an energized, high-performing workforce cannot happen without managers and employees who treat all persons with dignity and respect regardless of race, color, national origin, gender, age, religion, sexual orientation, disability, gender identity or expression, political affiliation, marital or parental status, pregnancy, reprisal, genetic information, or military service. It is essential that our employees work in, and foster, environments free from discrimination and harassment. AmeriCorps’ mission is to provide opportunities for individuals of all ages and backgrounds to serve their communities and country. Commitment to the principles of non-discrimination, equal opportunity and DEIA, by all employees, is crucial to achieving our mission. As we work with national and community nonprofit organizations, faith-based groups, schools, and state and local agencies to enable service members and volunteers to meet critical needs in their communities, AmeriCorps’ interactions with these groups should reflect our commitment to these principles. Implicit in each employee's successful work performance, and explicit in each supervisor’s performance appraisal, are goals and objectives to abide by our civil rights laws and support DEIA in our workforce. Any person who violates this policy will be subject to appropriate personnel action, up to and including removal from federal service. Any AmeriCorps employee, former employee, or applicant for employment who believes they were discriminated against in violation of civil rights laws, regulations, or this policy, or subject to reprisal for opposing discrimination or participating in discrimination complaint proceedings (e.g., as a complainant or witness) should raise their concerns with our Office of Civil Rights (OCR). Discrimination claims should be brought to the attention of the OCR within 45 calendar days of the occurrence to be accepted for investigation in a formal complaint. Service members, volunteers, employees, and applicants for Federal employment who wish to file a discrimination complaint may do so by sending an email message to eo@americorps.gov or by leaving a voice message on the Civil Rights Hotline at 1-202-606-3461. In addition, employees may also consider our Alternate Dispute Resolution (ADR) Program as an informal way to resolve workplace conflicts. If you are interested in learning more about our ADR program, please email adr@americorps.gov . Michael D. Smith Chief Executive Officer AmeriCorps Program Civil Rights and Non-Harassment Policy Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/about/agency-overview/no-fear-act",
    "http://www.osc.gov",
    "https://www.govinfo.gov/content/pkg/FR-2004-01-26/html/04-1505.htm",
    "https://www.commerce.gov/cr/files/no-fear-act-public-law",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2024_03_28_AmeriCorps_No_FEAR_Act_Report_FY2023.pdf",
    "https://americorps.gov/sites/default/files/document/Employee-No-Fear-Act-Report-FY2022-Q3.pdf",
    "https://americorps.gov/sites/default/files/document/Employee-No-Fear-Act-Report-FY2022-Q2.pdf",
    "https://americorps.gov/sites/default/files/document/Employee-No-Fear-Act-Report-FY2022-Q1.pdf",
    "https://americorps.gov/sites/default/files/document/Employee_No_Fear_Act_Report_FY2021_1st_quarter.pdf",
    "https://americorps.gov/sites/default/files/document/Employee_No_Fear_Act_Report_FY2021_2nd_quarter.pdf",
    "https://americorps.gov/sites/default/files/document/Employee%20No%20Fear%20Act%20Report%20FY2021%203rd%20Q.pdf",
    "https://americorps.gov/sites/default/files/document/Employee_No_Fear_Act_Report_FY2021_4th_quarter.pdf",
    "https://americorps.gov/sites/default/files/document/AmeriCorps-Program-Civil-Rights-and-Non-Harassment-2023-11-14-508.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "about",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "about",
  "subdomain_1": "agency-overview"
}