{
  "id": "americorpsgov_blogs_2023_03_14_americorps_unites_celebration_older_adults_volunteer_their_second_acthtml",
  "url": "https://americorps.gov/blogs/2023-03-14/americorps-unites-celebration-older-adults-volunteer-their-second-act",
  "title": "americorps-unites-celebration-older-adults-volunteer-their-second-act",
  "content": "AmeriCorps Unites in Celebration: Older Adults Volunteer for Their Second Act | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps Unites in Celebration: Older Adults Volunteer for Their Second Act Submitted by dsong on Thu, 03/09/2023 - 14:10 Mar 14, 2023 AmeriCorps Staff AmeriCorps salutes those 140,000 AmeriCorps Seniors volunteers who share their time and life skills to help our children, fellow older adults, and community members. Every day, AmeriCorps Seniors volunteers’ commitment makes a positive impact on their community, transforming the lives of those they serve: For more than 50 years , AmeriCorps Seniors volunteers in the RSVP program get things done across the nation from managing volunteers, helping serve at food banks, and providing disaster awareness. Volunteers serving in the Senior Companion program befriend older adults and assist with daily living tasks such as transportation to appointments, cooking meals, and more to allow them to better maintain independence and age with dignity. Through the Foster Grandparents program , one of AmeriCorps Seniors’ oldest programs, volunteers connect with children, students, and younger adults, taking on pivotal roles to help shape future generations. AmeriCorps Seniors volunteers serving in the Foster Grandparent program Volunteers are essential AmeriCorps uniters , helping people in their communities recover from the aftereffects of the COVID-19 pandemic. From supporting food banks to conducting check-ins with isolated older adults, volunteers stepped in to lift up our communities during unprecedented times. Foster Grandparents united in service to combat learning loss, answering President Biden’s call for 250,000 more tutors and mentors to accelerate student recovery and success. Lifting up the community through soup kitchens AmeriCorps Seniors volunteer Jim Kowalski has been serving with the RSVP program for more than a decade. After retiring as a behavioral health counselor, Jim decided to become a volunteer to give back in his new free time. Jim joined the Soup Kitchen of Greater Wheeling in Ohio, making more than 10,000 hoagies for community members in need. He says the greatest thing about volunteering at the soup kitchen is meeting people and socializing. It’s a place where those in need can sit down and enjoy a hot meal as a community. AmeriCorps volunteer Jim serving at the Soup Kitchen of Greater Wheeling (Photo credit The Intelligencer / Wheeling News-Register ) War refugee befriends his community’s older adults Chue Vang arrived in Missoula, Montana in 1979 as a war refugee from Laos. After immigrating, he settled into the Hmong community in Missoula. He worked with community members and served on the board of the Refugee Assistance Center until it closed, and in 2011, he joined the Senior Companion program with Serve Montana to continue helping those who needed his assistance. Since then, he’s served nearly 14,000 hours and logged more than 24,000 miles helping others. Chue provides translation services to help others communicate with their healthcare providers, complete important medical forms, and live healthier lives as a Senior Companion. Chue (left) helping his Senior Companion client garden Helping students thrive in and out of the classroom In Puerto Rico, Foster Grandparent Guillermo Rivera Tricoche serves with the Cerebral Palsy Center , an organization that offers interdisciplinary services to children with special needs from months to 16-years-old helps students, in Ponce, Puerto Rico. 89-year-old Guillermo supports children with developmental disabilities, cerebral palsy, neurological disorders, and multiple and severe disabilities to thrive in and out of the classroom. His service helps students integrate into the school community through not only tutoring but with catered curriculums such as social work, physical therapy, speech-language pathology, special education, summer camps, and more. Guillermo says that volunteering helps keep him young while creating bonds with his students. Guillermo (left) with AmeriCorps CEO Michael D. Smith AmeriThanks to older adults who give back AmeriCorps Seniors volunteers dedicate their second act to transform the lives of their communities. Their wisdom and commitment continue to help shape our nation for the better. Know a senior ready to volunteer and make a difference? Join us! Learn more about AmeriCorps Seniors opportunities . Join AmeriCorps Week celebrations Follow AmeriCorps blog series , Facebook , Instagram , LinkedIn , and Twitter to join AmeriCorps Week and Day of the A . Previous AmeriCorps Unites in Celebration: Young Adults Become the Nation’s Changemakers Next AmeriCorps Unites in Celebration: From Music to Dentistry - AmeriCorps VISTA's Innovative Service Pathways Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-03-14/americorps-unites-celebration-older-adults-volunteer-their-second-act",
    "http://americorps.gov/seniors",
    "https://americorps.gov/blogs/2022-08-21/five-decades-americorps-senior-rsvp",
    "https://americorps.gov/serve/americorps-seniors/americorps-seniors-rsvp",
    "https://americorps.gov/serve/americorps-seniors/americorps-seniors-senior-companion-program",
    "https://americorps.gov/serve/americorps-seniors/americorps-seniors-foster-grandparent-program",
    "https://americorps.gov/about/what-we-do/united-we-serve",
    "https://americorps.gov/newsroom/americorps-joins-white-house-department-education-launch-national-effort-support-student",
    "http://wheelingsoup.org/",
    "https://www.theintelligencer.net/",
    "https://serve.mt.gov/",
    "https://agencias.pr.gov/agencias/oppea/Pages/default.aspx",
    "https://americorps.gov/pathfinder",
    "https://americorps.gov/newsroom/blog",
    "https://www.facebook.com/americorps",
    "https://www.instagram.com/americorps/",
    "https://www.linkedin.com/company/americorps/",
    "http://twitter.com/AmeriCorps",
    "https://socialpresskit.com/AmeriCorpsToolkits",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-03-14/americorps-unites-celebration-older-adults-volunteer-their-second-act&amp;title=AmeriCorps Unites in Celebration: Older Adults Volunteer for Their Second Act",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-03-14/americorps-unites-celebration-older-adults-volunteer-their-second-act&amp;title=AmeriCorps Unites in Celebration: Older Adults Volunteer for Their Second Act&amp;source=https://americorps.gov/blogs/2023-03-14/americorps-unites-celebration-older-adults-volunteer-their-second-act",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-03-14/americorps-unites-celebration-older-adults-volunteer-their-second-act&amp;url=https://americorps.gov/blogs/2023-03-14/americorps-unites-celebration-older-adults-volunteer-their-second-act&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-03-13/americorps-unites-celebration-young-adults-become-nations-changemakers",
    "https://americorps.gov/blogs/2023-03-15/americorps-unites-celebration-music-dentistry-americorps-vistas-innovative-service",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA; AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "03",
  "subdomain_3": "14"
}