{
  "id": "americorpsgov_blogs_2022_08_05_unite_through_service_september_11html",
  "url": "https://americorps.gov/blogs/2022-08-05/unite-through-service-september-11",
  "title": "unite-through-service-september-11",
  "content": "Unite through Service on September 11 | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Unite through Service on September 11 Submitted by rfrazier on Thu, 08/04/2022 - 13:44 Aug 05, 2022 AmeriCorps Staff In the days and months following the 9/11 tragedy, Americans at home and around the world came together, knowing that the things that divided us were smaller than those that united us. Despite divides, differences, and ideologies, we came together as a nation. We grieved as a community, cared for one another, and then set to work rebuilding and lifting our neighborhoods. The heroism of trained volunteers and first responders inspired thousands of then-teenagers and 20-somethings to act. Many enlisted in the military during wartime and knowingly risked their lives to protect our country. Others chose to serve their country through volunteer or national service opportunities with AmeriCorps, aiding the injured, serving as family caseworkers, and helping those displaced from Ground Zero find housing and other services. Julie, an AmeriCorps member with the NCCC program serving with a community of schools in Aurora, Ill., was flown to support recovery efforts after the 9/11 attacks. First in Washington, D.C. for three days, Julie and her team supported a Red Cross call center open to anyone with friends, family and loved ones in impacted areas. She talked with individuals in an effort to reconnect family and friends. \"Because of 9/11, I dedicated my life to service. Now I understand the importance of getting programs and policies in place to help volunteers get in there and get things done.” -Julie, AmeriCorps Alumna Julie and her team were next flown to New York City, where she spent two months as a case manager at Pier 94—helping people who had lost loved ones, lost homes, lost jobs. After completing her NCCC service, Julie returned to New York City to volunteer again, this time with one of 10 Red Cross centers – supporting the general recovery effort and managing cases. 9/11 changed her life. Read more stories about how 9/11 changed AmeriCorps members lives. Unite through Service This year AmeriCorps asks you to continue honoring the heroes and those lost through acts of service. One good deed can spark a passion and create relationships between communities and individuals that extend beyond this day to inspire a lifetime of service in all Americans. You can volunteer with your favorite nonprofit organization, donate blood, or band together with neighbors to help support students in local schools. Find a service project that reflects what matters most to you. 10 ways you can show up on 9/11 Day: Help others get vaccinated or find a testing location. Arrange a health fair or dental clinic. Donate school supplies. Deliver or serve meals to those at risk of hunger. Asses your community’s disaster preparedness. Check out the needs of a veteran's center. Sign up to be a mentor or tutor. Organize a park clean-up or create a community green space. Give your time to your local hospital or hospice. Visit a senior center and make a new friend. You can also create your own community service project . If you have a service project you would like to share, please email: Sept11@cns.gov . Share your AmeriCorps volunteer or service story in the aftermath of 9/11. Also, tell us if 9/11 was the spark that ignited your passion to serve. We would be honored to share your story. Get in touch with our team to learn more. Share your story. Use Your Voice. Your service story is crucial to inspiring your neighbors and strangers, alike. Before, during, and after your day of service in remembrance of September 11, encourage your network by sharing your service project. Use social media to share the service project you’ll be participating in on 9/11 Day. Post your picture and videos on Instagram , Facebook , or Twitter –don't forget to use #911Day . As we commemorate 9/11 Day, let’s ensure that what unites us will always outlast what is trying to divide us. How will you serve this 9/11? Previous Ten Years of Responding to Crisis Situations Next The Second Gentleman is Ready to Serve Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2022-08-05/unite-through-service-september-11",
    "https://americorps.gov/newsroom/press-releases/2011/americorps-stories-how-911-changed-my-life",
    "https://americorps.gov/join/find-volunteer-opportunity",
    "https://americorps.gov/newsroom/events/911-day/911-day-resources",
    "https://www.instagram.com/americorps/",
    "https://www.facebook.com/americorps",
    "https://twitter.com/AmeriCorps",
    "https://twitter.com/hashtag/911day",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2022-08-05/unite-through-service-september-11&amp;title=Unite through Service on September 11 ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2022-08-05/unite-through-service-september-11&amp;title=Unite through Service on September 11 &amp;source=https://americorps.gov/blogs/2022-08-05/unite-through-service-september-11",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2022-08-05/unite-through-service-september-11&amp;url=https://americorps.gov/blogs/2022-08-05/unite-through-service-september-11&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2022-07-29/ten-years-responding-crisis-situations",
    "https://americorps.gov/blogs/2022-08-05/second-gentleman-ready-serve",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2022",
  "subdomain_2": "08",
  "subdomain_3": "05"
}