{
  "id": "americorpsgov_evidence_exchange_Bridging_the_Opportunity_Divide_for_Low_Income_Youth_Implementation_and_Early_Impacts_of_the_Year_Up_Programhtml",
  "url": "https://americorps.gov/evidence-exchange/Bridging-the-Opportunity-Divide-for-Low-Income-Youth%3A-Implementation-and-Early-Impacts-of-the-Year-Up-Program",
  "title": "Bridging-the-Opportunity-Divide-for-Low-Income-Youth%3A-Implementation-and-Early-Impacts-of-the-Year-Up-Program",
  "content": "Bridging the Opportunity Divide for Low-Income Youth: Implementation and Early Impacts of the Year Up Program | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Bridging the Opportunity Divide for Low-Income Youth: Implementation and Early Impacts of the Year Up Program Back Year Up is a training program for urban young adults between ages 18 and 24. The program provides six months of full-time training in the IT and financial service sectors, followed by six-month internships at major firms. The full-time program provides extensive support and puts a heavy emphasis on the development of professional and technical skills. Year Up is one of nine programs in the federally sponsored Pathways for Advancing Careers and Education (PACE) evaluation. Study Goals : This evaluation used implementation and impact studies to build on evidence for other career pathways approaches. It explores the possibility that more comprehensive interventions will prove more effective than lower-intensity programs. Research Questions : The research questions were: Was the Year Up program model implemented as designed across the program’s eight offices? How did employment, training, and related service experiences differ between young adults randomly selected to participate in Year Up (the treatment group) and those who could not access the program (the control group)? What were the effects of access to Year Up on earnings, career-track employment, postsecondary education, and related outcomes? How did these effects vary across subgroups and across the eight local offices? Findings: The evaluation found the following: Year Up implemented its program with high fidelity to its design. Year Up had positive effects on the scope and nature of services received by its students. Effects on earnings were consistently large and positive. For more information, download the full report , appendices , and report brief . Full report Full Report New_Profit_YearUp_Final Report v.2_7.30.2018.pdf New_Profit_YearUp_Final Report v.2 Appendices_7.30.2018.pdf New_Profit_VPP_Year_Up_Report _Brief_FINAL_508.pdf Further information Program/Intervention Year Up Implementing Organization Year Up Intermediary(s) New Profit and Venture Philanthropy Partners/Year Up AmeriCorps Program(s) Social Innovation Fund Age(s) Studied 18-25 (Young adult) Study Type(s) Impact Study Design(s) Experimental (RCT) Level of Evidence Strong Researcher/Evaluator Abt Associates Published Year 2019 Study Site Location (State) California Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/evidence-exchange/Bridging-the-Opportunity-Divide-for-Low-Income-Youth%3A-Implementation-and-Early-Impacts-of-the-Year-Up-Program",
    "https://nationalservice.gov/sites/default/files/evidenceexchange/New_Profit_YearUp_Final%20Report%20v.2_7.30.2018.pdf",
    "https://nationalservice.gov/sites/default/files/evidenceexchange/New_Profit_YearUp_Final%20Report%20v.2%20Appendices_7.30.2018.pdf",
    "https://nationalservice.gov/sites/default/files/evidenceexchange/New_Profit_VPP_Year_Up_Report%20_Brief_FINAL_508.pdf",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/evidenceexchange/New_Profit_YearUp_Final%20Report%20v.2_7.30.2018_1.pdf",
    "https://americorps.gov/sites/default/files/evidenceexchange/New_Profit_YearUp_Final%20Report%20v.2%20Appendices_7.30.2018_1.pdf",
    "https://americorps.gov/sites/default/files/evidenceexchange/New_Profit_VPP_Year_Up_Report%20_Brief_FINAL_508_1.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "Social Innovation Fund",
  "focus_population": [],
  "ages_studied": [
    "18-25 (Young adult)"
  ],
  "resource_type": "evidence-exchange",
  "topic": "",
  "year": "",
  "domain": "evidence-exchange"
}