{
  "id": "americorpsgov_evidence_exchange_A_Systematic_Review_of_Senior_Corps____Impact_on_Volunteers_and_Program_Beneficiarieshtml",
  "url": "https://americorps.gov/evidence-exchange/A-Systematic-Review-of-Senior-Corps___-Impact-on-Volunteers-and-Program-Beneficiaries",
  "title": "A-Systematic-Review-of-Senior-Corps___-Impact-on-Volunteers-and-Program-Beneficiaries",
  "content": "A Systematic Review of Senior Corps’ Impact on Volunteers and Program Beneficiaries | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb A Systematic Review of Senior Corps’ Impact on Volunteers and Program Beneficiaries Back The Senior Corps Program, administered by the Corporation for National and Community Service (CNCS), engages adults 55 years and older in national service that provides benefits both to local communities and to the volunteers themselves. This report describes the history and goals of the three Senior Corps programs and reviews the literature on the effectiveness of these programs to: identify the strength of the evidence base for Senior Corps contextualize these findings within the larger literature on the impact of volunteering for older adults offer recommendations and lessons learned from this review Study Goals : The goal of this report was to systematically review the evaluation literature on three Senior Corps programs from 1980 to 2019 to determine what the academic literature and research realizes about the impact of Senior Corps on those who volunteer in its programs and on those served by Senior Corps volunteers. Research Questions: The research questions were: What is the strength of the evidence base for Senior Corps? What is the impact of Senior Corps service on volunteers and beneficiaries? What is the effectiveness of specific Senior Corps service models or interventions? How do findings from the research on volunteering among older adults generally compare to the findings from research about Senior Corps specifically? What are the learnings, best practices and key resources that can inform the work of CNCS, its grantees, and other stakeholder groups? Findings: The evaluation found the following: Findings show a positive impact of Senior Corps participation (75% of the outcomes studied having positive results) on both volunteers and beneficiaries. The majority of the evaluations reviewed examined psychosocial and physical health outcomes; consequently, the majority of the positive outcomes observed for volunteers are in these two domains. The majority of these positive findings (78%) are from non-experimental designs, and most did not directly test for statistical significance, so more rigorous evaluation will help address selection bias and further strengthen the evidence base. For more information, download the f ull report. Full report Full Report 2019-09-09-Senior-Corps-Research-Review-Synthesis-Report _to CNCS_508.pdf Senior-Corps-Meta-Analysis-Feasibility-Memo-7-31-2019 _508.pdf Senior Corps-Recommendation-07-31-2019 _508.pdf 2019.07.18 Senior Corps Timeline_REVISED_clean09082020_508.pdf Senior Corps RRS Annotated Bib_21Sept2020_508.pdf Further information Program/Intervention Best Practice Dissemination, Senior Corps Program Implementing Organization CNCS Office of Research and Evaluation Commissioned Report AmeriCorps Program(s) AmeriCorps Seniors Age(s) Studied 55+ (Older adult) Focus Population(s)/Community(s) Rural Suburban Urban Outcome Category Aging in place Benefit to national service members/volunteers Nonprofit development Improving AmeriCorps Researcher/Evaluator JBS International Published Year 2019 Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/evidence-exchange/A-Systematic-Review-of-Senior-Corps%E2%80%99-Impact-on-Volunteers-and-Program-Beneficiaries",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/evidenceexchange/2019-09-09-Senior-Corps-Research-Review-Synthesis-Report%20_to%20CNCS_508_1.pdf",
    "https://americorps.gov/sites/default/files/evidenceexchange/Senior-Corps-Meta-Analysis-Feasibility-Memo-7-31-2019%20_508_1.pdf",
    "https://americorps.gov/sites/default/files/evidenceexchange/Senior%20Corps-Recommendation-07-31-2019%20_508_1.pdf",
    "https://americorps.gov/sites/default/files/evidenceexchange/2019.07.18%20Senior%20Corps%20Timeline_REVISED_clean09082020_508_1.pdf",
    "https://americorps.gov/sites/default/files/evidenceexchange/Senior%20Corps%20RRS%20Annotated%20Bib_21Sept2020_508_1.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors; Office of Research and Evaluation",
  "focus_population": [
    "Rural",
    "Suburban",
    "Urban"
  ],
  "ages_studied": [
    "55+ (Older adult)"
  ],
  "resource_type": "evidence-exchange",
  "topic": "",
  "year": "",
  "domain": "evidence-exchange"
}