{
  "id": "americorpsgov_blogs_2020_05_14_may_14_update_americorps_and_senior_corps_covid_19_responsehtml",
  "url": "https://americorps.gov/blogs/2020-05-14/may-14-update-americorps-and-senior-corps-covid-19-response",
  "title": "may-14-update-americorps-and-senior-corps-covid-19-response",
  "content": "May 14 Update: AmeriCorps and Senior Corps COVID-19 Response | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb May 14 Update: AmeriCorps and Senior Corps COVID-19 Response Submitted by admin on Thu, 05/14/2020 - 14:04 May 14, 2020 CNCS More than 6,275 AmeriCorps and Senior Corps Members Actively Engaged in COVID-19 Emergency Response Despite the obstacles presented by COVID-19, AmeriCorps and Senior Corps programs across the country have acted quickly and creatively to continue their critical work in new ways, or to pivot to meet emerging needs. Since the start of the national emergency, more than 6,275 AmeriCorps members and Senior Corps volunteers have served in direct response to COVID-19. Collectively, these national service members have: Assisted nearly 1.2 million people Provided more than 2 million meals Collected and distributed more than 14 million pounds of food, and Conducted more than 90,000 wellness checks They are joined in service by thousands of AmeriCorps members and Senior Corps volunteers who continue to meet the needs of their communities by virtually teaching, tutoring and mentoring students, restoring public lands, helping families remain in their homes and referring homeless individuals to supportive services, building capacity for local nonprofits, or connecting with isolated seniors. National Service Continues to Get Things Done The stories of service coming from across the country demonstrate the commitment of AmeriCorps members and Senior Corps volunteers to continue to “get things done” for the communities and residents that are counting on them. Below are a few stories that show how we continue to serve our communities in impactful ways. Charlotte teacher continues to work while getting treatment for cancer (North Carolina) First year Charlotte-Mecklenburg Schools (CMS) math teacher and AmeriCorps member Wil Loesel is teaching in the middle of two health emergencies. One is COVID-19 and the other is his personal story. Back in March, Loesel was diagnosed with cancer. He didn’t let the diagnosis stop him from teaching. Soon after his diagnosis, he stayed in the hospital and taught from his hospital bed. He was thinking about his students. Senior Corps RSVP members reaching out in creative ways (Michigan) Local Senior Corps volunteers have gone above and beyond during the state shutdown in order to continue assistance to those in need and show appreciation for all the hardworking community members. Volunteers from Otsego County United Way and Senior Corps RSVP have been working from home, finding new ways to reach out. When the shelter-in-place order took effect, volunteers from the United Way called the 325 Senior Corps RSVP members to make sure they had access to everything they needed including food, medication and transportation to medical appointments. Volunteers also have been paired with vulnerable populations for weekly phone calls to check in and see if they need anything. AmeriCorps members came to San Juan County to build trails. They ended up delivering food. (Utah) Conservation work was off the table, but in the town of Bluff, a group of volunteers had just begun organizing a grassroots relief effort for southeast Utah, and they were looking for assistance. The AmeriCorps members were in need of work, and the aid group was in desperate need of more volunteers to help with the time-consuming deliveries. “I’ll be honest, when I found out that instead of using power tools and living out in the wild, I’d be packing and delivering supplies, I was a little disheartened,” said Tee Murphy, an AmeriCorps member. “But after one day working with those wonderful people, doing the wonderful work, it quickly went away…. At the end of each workday with BAMA, I know my work will directly and greatly help families who have no one else to turn to amid this crisis.” Arizona Serve of Prescott supports a community in distress (Arizona) AmeriCorps members are filling vital roles in response to COVID-19 through Arizona Serve of Prescott College. Arizona Serve has over 100 AmeriCorps members that are working hard to create meaningful interventions in over 45 nonprofit or governmental agencies in Yavapai and Pima counties. These are just a few examples of how AmeriCorps and Senior Corps programs continue to make an impact in communities across the country. No matter the circumstances, our programs have the flexibility and our national service members have the commitment to meet the needs of Americans wherever and whenever they are needed. Previous From City Living to Rural Serving, an AmeriCorps VISTA Finds a New Calling Next AmeriCorps VISTA Helped Save His Life. Now He’s Working to Do the Same. Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2020-05-14/may-14-update-americorps-and-senior-corps-covid-19-response",
    "https://www.wbtv.com/2020/05/04/cms-teacher-continues-work-while-getting-treatment-cancer/",
    "https://www.petoskeynews.com/gaylord/featured-ght/top-gallery/rsvp-members-reaching-out-in-creative-ways/article_2dc5fac1-6045-5fbb-b4b2-b3f7f0c74b05.html",
    "https://www.sltrib.com/news/2020/05/07/americorps-members-came/",
    "https://www.dcourier.com/news/2020/may/06/arizona-serve-prescott-supports-community-distress/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2020-05-14/may-14-update-americorps-and-senior-corps-covid-19-response&amp;title=May 14 Update: AmeriCorps and Senior Corps COVID-19 Response",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2020-05-14/may-14-update-americorps-and-senior-corps-covid-19-response&amp;title=May 14 Update: AmeriCorps and Senior Corps COVID-19 Response&amp;source=https://americorps.gov/blogs/2020-05-14/may-14-update-americorps-and-senior-corps-covid-19-response",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2020-05-14/may-14-update-americorps-and-senior-corps-covid-19-response&amp;url=https://americorps.gov/blogs/2020-05-14/may-14-update-americorps-and-senior-corps-covid-19-response&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2020-05-01/city-living-rural-serving-americorps-vista-finds-new-calling",
    "https://americorps.gov/blogs/2020-05-15/americorps-vista-helped-save-his-life-now-he%E2%80%99s-working-do-same",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA",
  "focus_population": [
    "Schools",
    "Rural"
  ],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2020",
  "subdomain_2": "05",
  "subdomain_3": "14"
}