{
  "id": "americorpsgov_about_what_we_do_active_disaster_responsehtml",
  "url": "https://americorps.gov/about/what-we-do/active-disaster-response",
  "title": "active-disaster-response",
  "content": "Active Disaster Response | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb About What We Do Active Disaster Response What We Do Disaster Services Unit Active Disaster Response Economic Opportunity Education Environmental Stewardship Healthy Futures COVID-19 Veterans and Military Families From forest fires and floods to hurricanes and tornadoes, to terror attacks and oil spills, AmeriCorps members have provided critical support to millions of Americans affected by disasters since 1994. AmeriCorps’ expertly trained Disaster Response Team serves in national disaster response efforts by supporting shelter operations, call centers, volunteer and donation management, muck and gut operations, blue-roof tarping and debris cleanup, among other services. Following a disaster, national service acts as a force multiplier, providing key resources and significantly expanding the capacity of existing organizations on the ground. AmeriCorps programs like NCCC and FEMA Corps are often involved in disaster recovery for many months to years after the initial disaster, visit the NCCC deployment page for long-term recovery efforts. Active and Recent Disaster Response AmeriCorps is currently responding to the following disasters: Hurricane Helene and Hurricane Milton On Thursday, Sept. 26, Hurricane Helene made landfall in Florida, impacting the southeastern US including Georgia, North Carolina, South Carolina, Tennessee, and Virginia. The 350-mile-wide category 4 hurricane brought 140 mph winds, heavy rains, and widespread storm surge. Helene caused significant flooding and debris across the region. On October 9, 2024, Hurricane Milton made landfall as a Category 4 storm in Florida’s Tampa Bay area bringing heavy rain, storm surge, and floods to many counties on the coast and in the interior of the state. Some areas in the state are still actively recovering from Hurricane Helene. AmeriCorps is actively engaged in response efforts in impacted areas from both Hurricanes. More than 480 AmeriCorps members serving with AmeriCorps NCCC and AmeriCorps NCCC FEMA Corps and personnel have responded to serve with a variety of partners to support recovery operations in Florida, North Carolina, South Carolina, Texas, Virginia, Georgia, and Washington, DC. There are currently 292 AmeriCorps members still on the ground helping with active recovery. In Florida, 140 AmeriCorps members are assisting with mucking and gutting with Starfish Disaster Recovery , Florida Conservation Corps , Southwest Conservation Corps, and California Conservation Corps ; and supporting FEMA with generating reports and admin support. In North Carolina, more than 120 AmeriCorps members are serving in emergency shelters, providing disaster survivor assistance, coordinating donations management, and assisting with cleanups. Members are supporting the operations of groups like the Catholic Charities Diocese of Raleigh , American Red Cross , AmeriCorps St. Louis , Conservation Corps Minnesota & Iowa , Conservation Corps North Carolina , American Conservation Experience East , SBP and Utah Conservation Corps . In Virginia, nearly 10 AmeriCorps members are assisting with recovery operations including mucking and gutting, debris removal and other disaster response services, alongside the US Forest Service , Pulaski County Emergency Management Agency , and FEMA. In South Carolina, nearly 10 AmeriCorps members are assisting with recovery operations including donations management and other disaster response services in Edgefield County and Greenville. Members are serving with the Merriweather Fire Department and American Red Cross . Learn more: https://www.fema.gov/hurricane-helene https://www.usa.gov/hurricane-helene Previous Next AmeriCorps Members on the Frontline in Florida Aid Hurricane Recovery Efforts on the Gulf Coast November 18, 2024 AmeriCorps and Serve Illinois Join Together to Support Communities During Natural Disasters October 28, 2024 Active Disaster Response Archive Please note that this list is not exhaustive. 2024 Toggle Iowa Flooding Iowa Northwest Iowa was beset by record flooding starting June 16 after extreme rainfall, leading to a disaster proclamation from Gov. Kim Reynolds, and the evacuation of thousands of residents. Some parts of Iowa received more than 15 inches of rain, causing water levels to surge and levees to fail. In much of northwest Iowa, rivers reached levels that had not been previously recorded in data from the National Oceanic and Atmospheric Administration or the U.S. Geological Survey. A-DRTs began their response 6/30/24 and will be integrated into statewide efforts supporting the affected counties in the form of mucking and gutting, mold suppression, canvassing, translation of documents, data scrubbing, information collection, and general volunteer and donations management efforts. Iowa Severe Storms Iowa Multiple rounds of thunderstorms brought torrential rainfall, damaging winds, hail, and destructive tornadoes across Iowa. Slow moving storms on the night of May 20, 2024, dropped 2 to 4 inches of rainfall, which resulted in flash flooding over portions of northern and central Iowa. Following the heavy rainfall, in the afternoon hours of May 21, multiple strong tornadoes formed throughout the state, including one which caused significant damage in the town of Greenfield, IA, among other locations. This line of storms also produced damaging winds, leading to widespread tree damage and power outages throughout the forecast area. A-DRTs began their response 6/3/24 and will be supporting warehouse management, volunteer coordination, VRC (Volunteer Reception Center) management, and crisis cleanup call downs. 2023 Toggle Hurricane Idalia Florida In response to a $750,000 FEMA Mission Assignment, AmeriCorps deployed 76 A-DRT members and staff from 6 programs: San Jose Conservation Corps, American Youthworks, American Conservation Experience, AmeriCorps St Louis, SBP, and Florida Conservation Corps. Teams served from 9/25/23-11/14/23. Duties included: performing tree removal, temporary roof repair, debris removal, mold suppression, and muck and gut services. Maui Wildfires Hawaii In response to a $600,000 FEMA mission assignment, AmeriCorps deployed 135 A-DRT members and staff from 7 programs: Volunteer Iowa, American Conservation Experience, AmeriCorps NCCC, AmeriCorps St. Louis, Montana Conservation Corps, California Conservation Corps, Conservation Corps Minnesota and Iowa. Teams served from 8/14/23-12/20/23. Duties included: support with spontaneous volunteers, donation and volunteer management, needs assessment, sheltering as needed and as AmeriCorps staff is capable. Super Typhoon Mawar Guam In response to a $712,500 FEMA mission assignment, AmeriCorps deployed 66 A-DRT members and staff from 6 programs: SBP, Conservation Corps Minnesota Iowa, American Youthworks, American Conservation Experience, California Conservation Corps and San Jose Conservation Corps. Teams served from 6/9/23-8/9/23. Duties included: non-hazardous disaster debris removal, chain-saw work (for qualified crews only), mucking and gutting, and mold suppression. New Mexico Wildfires New Mexico In response to a $500,000 FEMA mission assignment, AmeriCorps deployed 51 A-DRT members and staff from four programs: NCCC, American Youth Works, AmeriCorps St. Louis, and Rocky Mountain Youth Corps. Teams served from 01/23/2023 through 03/21/2023. Duties included: debris removal, muck and gut, and mold suppression. Hurricane Ian Florida In response to a $3,100,00 FEMA mission assignment, AmeriCorps deployed 188 A-DRT members and staff from eleven programs: SBP, Florida Conservation Corps, California Conservation Corps, Washington Conservation Corps, Texas Conservation Corps, Volunteer Iowa, Conservation Corps Missouri Iowa, Montana Conservation Corps, NCCC, ACE North Carolina, and Utah Conservation Corps. Teams served from 10/04/2022 through 02/10/2023. Duties included: data consolidation, damage assessments, debris removal, muck and gut, and mold suppression. 2022 Toggle Missouri Flooding Missouri In response to a $293,900 FEMA mission assignment, AmeriCorps deployed 68 A-DRT members and staff from four programs: Volunteer Iowa, Texas Conservation Corps, AmeriCorps St. Louis, and Conservation Corps Minnesota and Iowa. Teams served from 09/14/2022 through 10/13/2022. Duties included: debris removal, muck and gut, and mold suppression. Hurricane Ian Florida In response to a $3,100,00 FEMA mission assignment, AmeriCorps deployed 188 A-DRT members and staff from eleven programs: SBP, Florida Conservation Corps, California Conservation Corps, Washington Conservation Corps, Texas Conservation Corps, Volunteer Iowa, Conservation Corps Missouri Iowa, Montana Conservation Corps, NCCC, ACE North Carolina, and Utah Conservation Corps. Teams served from 10/04/2022 through 02/10/2023. Duties included: data consolidation, damage assessments, debris removal, muck and gut, and mold suppression. 2021 Toggle COVID Vaccine Support California, Colorado, Delaware, Florida, Kentucky, Maryland, Michigan, Missouri, Nevada, New Jersey, New York, North Carolina, Texas, Virginia, West Virginia In response to a $10,394,078 FEMA mission assignment, AmeriCorps deployed 1,012 A-DRT members and staff from seven programs: NCCC, Volunteer Iowa, SBP, Southwest Conservation Corps, Florida Conservation Corps, Conservation Corps of North Carolina, and Utah Conservation Corps. Teams served from 01/28/2021 through 09/12/2021. Duties included: COVID-19 Vaccination center support. Hurricane Ida New Jersey In response to a $610,000 FEMA mission assignment, AmeriCorps deployed 85 A-DRT members and staff from eight programs: Volunteer Iowa, Habitat for Humanity Iowa, Texas Conservation Corps, Southwest Conservation Corps, AmeriCorps NCCC, Conservation Corps North Carolina, Appalachian Conservation Corps, and Utah Conservation Corps. Teams served from 09/21/2021 through 11/20/2021. Duties included: debris removal, muck and gut, and mold suppression. Hurricane Ida New York In response to a $463,410 FEMA mission assignment, AmeriCorps deployed 64 A-DRT members and staff from five programs: AmeriCorps St. Louis, Southeastern Conservation Corps, Rocky Mountain Youth Corps, California Conservation Corps, and AmeriCorps NCCC. Teams served from 10/11/2021 through 12/20/2021. Duties included: debris removal, muck and gut, and mold suppression. 2020 Toggle Hurricane Laura Louisiana In response to a $460,000 FEMA mission assignment, AmeriCorps deployed 86 A-DRT members and staff from six programs: AmeriCorps NCCC, Louisiana Conservation Corps, Montana Conservation Corps, SBP, Utah Conservation Corps, Washington Conservation Corps. Teams served from 10/09/2020 through 12/07/2020. Duties included: debris removal, muck and gut, mold suppression, temporary roof repair, roof tarping, and hazard tree removal. Hurricane Sally Florida In response to a $465,000 FEMA mission assignment, AmeriCorps deployed 84 A-DRT members and staff from five programs: Texas Conservation Corps, AmeriCorps NCCC, Florida Conservation Corps, AmeriCorps St. Louis, and Utah Conservation Corps. Teams served from Oct. 23 through Dec. 22, 2020. Duties included: debris removal, muck and gut, mold suppression, temporary roof repair, and hazard tree removal. Iowa Derecho Iowa In response to a $233,000 FEMA mission assignment, AmeriCorps deployed 27 A-DRT members and staff from four programs: Volunteer Iowa, ACE Texas, Conservation Corps of Minnesota and Iowa, and NCCC. Teams served from date-to-date Duties included: damage assessments, debris removal, and tree removal. Midwest Floods Nebraska In response to a $400,000 FEMA mission assignment, AmeriCorps deployed 38 A-DRT members and staff from 3 programs: AmeriCorps St. Louis, AmeriCorps NCCC, and Texas Conservation Corps. Teams served from 04/01/2019-5/30/2019. Duties included: debris removal, muck and gut, volunteer management and donations management. 2019 Toggle Midwest Floods Iowa In response to a $919,600 FEMA mission assignment, AmeriCorps deployed 130 A-DRT members and staff from 8 programs: Conservation Corps Minnesota & Iowa, Volunteer Iowa, Washington Conservation Corps, AmeriCorps NCCC, California Conservation Corps, Texas Conservation Corps, Utah Conservation Corps, Southwest Conservation Corps. Teams served from 04/01/2019-08/10/2019. Duties included: damage assessments, muck and gut, mold suppression, debris removal, donations management, and volunteer management. 2018 Toggle Hurricane Lane Hawaii In response to a $5,000 FEMA mission assignment, AmeriCorps deployed DSU staff from to serve at the National Response Call Center (NRCC) from 08/23/2018-08/31/2018. Hurricane Michael Florida In response to a $2,615,000 FEMA mission assignment, AmeriCorps deployed 421 A-DRT members and staff from 10 programs: Washington Conservation Corps, California Conservation Corps, AmeriCorps NCCC, Arizona Conservation Corps, Rocky Mountain Youth Corps, Texas Conservation Corps, Greater Appalachian Conservation Corps and Florida Conservation Corps. Teams served from 10/12/18-02/18/2019 Duties included: damage assessments, muck and gut, debris removal, tree removal, roof tarping, temporary roof repair, and donation management. Hurricane Florence North Carolina In response to a $950,000 FEMA mission assignment, AmeriCorps deployed 163 A-DRT members and staff from six programs: Utah Conservation Corps, AmeriCorps NCCC, SBP, Conservation Corps New Mexico, Washington Conversation Corps, Conservation Corps Minnesota and Iowa. Teams served from 10/01/2018 to 01/30/2019. Duties included: mucking and gutting homes, mold suppression, and temporary roof repair. Hurricane Florence South Carolina In response to a $X FEMA mission assignment, AmeriCorps deployed 178 A-DRT members and staff from ten programs: Washington Conservation Corps, Conservation Corps New Mexico, Southeast Conservation Corps, Montana Conservation Corps, Conservation Corps Minnesota Iowa, AmeriCorps St Louis, SBP, AmeriCorps NCCC, Palmetto Conservation Corps and Rocky Mountain Youth Corps. Teams served from 10/05/2018-12/22/2018. Duties included: muck and gut, call centers, and needs assessments. Rio Grande Valley Flooding Texas In response to a $300,000 FEMA mission assignment, AmeriCorps deployed 796 A-DRT members and staff from ten programs: Washington Conservation Corps, Texas Conservation Corps, Conservation Corps Minnesota and Iowa, Southeast Conservation Corps, Utah Conservation Corps, California Conservation Corps, AmeriCorps NCCC, Southern Conservation Corps, Rocky Mountain Youth Corps, and Greater Appalachian Conservation Corps. Teams served from July 23, 2018, to August 31, 2018. Duties included: volunteer and warehouse management. 2017 Toggle Hurricane Harvey Texas In response to a $5,840,000 FEMA mission assignment, AmeriCorps deployed 796 A-DRT members and staff from ten programs: Washington Conservation Corps, Texas Conservation Corps, Conservation Corps Minnesota and Iowa, Southeast Conservation Corps, Utah Conservation Corps, California Conservation Corps, AmeriCorps NCCC, Southern Conservation Corps, Rocky Mountain Youth Corps, and Greater Appalachian Conservation Corps. Teams served from August 06, 2017, to December 21, 2017. Duties included: debris removal, mold suppression, muck and gut, blue roof tarping, temporary roof repairs and chain saw work. Hurricane Irma Florida In response to a $2,615,000 FEMA mission assignment, AmeriCorps deployed 421 A-DRT members and staff from six programs: AmeriCorps NCCC, California Conservation Corps, Arizona Conservation Corps, Rocky Mountain Youth Corps, Greater Appalachian Conservation Corps, and Washington Conservation Corps. Teams served from October 12, 2017, to February 28,2018. Duties included: debris removal, mold suppression, muck and gut, blue roof tarping, temporary roof repairs and chain saw work. Hurricane Maria Puerto Rico In response to a $5,239,800 FEMA mission assignment, AmeriCorps deployed 400 A-DRT members and staff from nine programs: AmeriCorps NCCC, SBP, California Conservation Corps, AmeriCorps St. Louis, Volunteer Iowa, Utah Conservation Corps, Conservation Corps of Minnesota and Iowa, Southwest Conservation Corps, and Washington Conservation Corps. Teams served from October 3, 2017, to August 13, 2018. Duties included: damage assessments, debris removal, muck and gut, roofing and chain saw work. Hurricane Maria U.S. Virgin Islands In response to a $4,050,000 FEMA mission assignment, AmeriCorps deployed 335A-DRT members and staff from six programs: AmeriCorps NCCC, California Conservation Corps, Volunteer Iowa, Texas Conservation Corps, Conservation Corps, and Washington Conservation Corps. Teams served from October 3, 2017,to August 14, 2018. Duties included: Disaster debris removal, muck and gut and chain saw work. ^ top Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/about/what-we-do/active-disaster-response",
    "https://starfishdisasterrecovery.org/",
    "https://www.floridastateparks.org/FLCC",
    "https://sccorps.org/",
    "https://ccc.ca.gov/",
    "https://www.catholiccharitiesraleigh.org/",
    "https://www.redcross.org/about-us/our-work/disaster-relief/hurricane-relief/hurricane-helene.html",
    "https://www.americorps-stl.org/",
    "https://conservationcorps.org/",
    "https://corpsnc.org/",
    "https://www.usaconservation.org/locations/eastern/",
    "https://www.sbpusa.org/",
    "https://userve.utah.gov/utah-conservation-corps/",
    "https://www.fs.usda.gov/",
    "https://www.pulaskicounty.net/emergency-management",
    "https://www.redcross.org/about-us/our-work/disaster-relief/hurricane-relief/hurricane-helene.html",
    "https://www.fema.gov/hurricane-helene",
    "https://www.usa.gov/hurricane-helene",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC",
  "focus_population": [
    "Veterans and Military Families"
  ],
  "ages_studied": [],
  "resource_type": "about",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "about",
  "subdomain_1": "what-we-do"
}