{
  "id": "americorpsgov_blogs_2023_03_15_americorps_unites_celebration_music_dentistry_americorps_vistas_innovative_servicehtml",
  "url": "https://americorps.gov/blogs/2023-03-15/americorps-unites-celebration-music-dentistry-americorps-vistas-innovative-service",
  "title": "americorps-unites-celebration-music-dentistry-americorps-vistas-innovative-service",
  "content": "AmeriCorps Unites in Celebration: From Music to Dentistry - AmeriCorps VISTA's Innovative Service Pathways | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps Unites in Celebration: From Music to Dentistry - AmeriCorps VISTA's Innovative Service Pathways Submitted by rfrazier on Fri, 03/10/2023 - 17:07 Mar 15, 2023 AmeriCorps Staff Each year, more than 7,000 AmeriCorps members serving in the VISTA program go into communities with one goal: to help alleviate poverty. Through partnerships with organizations and members of the community, they build up our nation by fundraising, grant writing, researching, volunteer recruitment, and other traditional office activities. But did you know that these members also use their talents and passion for sports, music, medicine, poetry, and more to make a difference? Check out how members put their passion to work to make an impact across the country with the VISTA program. Sports AmeriCorps member Allison serving with Team Fame Have a passion for sports? Through service, members like Alison have combined their love for sports with their desire to make a difference. For Alison, tennis has been an important part of her life since she was young. After playing at the collegiate level and completing her master’s degree, she wanted to share her passion for tennis with future generations. Today, she serves with the International Tennis Hall of Fame’s Team Fame , recruiting volunteers and students, mentoring both on the court and in the classroom, and chaperons students during trips, including the U.S. Open. Check out opportunities to serve with similar organizations: WellbeingNSport Social Media Marketing and Content Strategy Program Coordinator Backroads of Appalachia Addiction Recovery Advocate Business Plan Developer Tourism Developer Music AmeriCorps member DeNairo serving with the Muskogee Community Band Pride program If you have a passion for music, the VISTA program is great way for you to combine your passion and serve your community. DeNario recently spent his summer teaching leadership skills through music education to students in his hometown with the Muskogee Community Band Pride program. The program works to prevent summer learning loss by providing low-income students with additional music learning opportunities to help them succeed through high school and beyond. Check out opportunities to serve with similar organizations: Hopewell Music Cooperative – Literacy Leader Poetry View this post on Instagram A post shared by AmeriCorps (@americorps) As a poet, John uses his art to make a difference through service. Serving alongside Poetry for Personal Power , he supports the organization in its mission to use art to show that emotional distress is temporary and transformative. In his role, John writes and creates pieces that he can use to engage with prospective volunteers and sponsored artists, including in the poem featured in the video above. Gaining access to stories of artists and sharing how they deal with mental health issues allows the organization to connect with more people. Check out opportunities to serve with similar organizations: Missoula Writing Collaborative Elevate Branson - Creative Arts Coordinator Empowering Refugee Communities AmeriCorps member Hagan (left) and AmeriCorps member Kree (right) Have a heart for supporting resettled refugees? Meet Hagan and Kree. Through service in the VISTA program, they support Transplanting Traditions Community Farm in its mission to uplift food sovereignty in North Carolina's refugee community through access to land, education, leadership, and entrepreneurship opportunities for refugee farmers. Hagan develops innovative fundraising strategies, like a cooking class on preparing traditional food grown by farmers. Kree develops an educational curriculum for refugee farmers to help them learn business skills to improve their existing farm businesses. Check out opportunities to serve with similar organizations: Benevolence Farm & Transplanting Traditions Community Farm - Market Access Coordinator Refugee Assistance & Immigration Services Catholic Charities of Central Florida’s Comprehensive Refugee Services – Volunteer Coordinator Bethany Christian Services: Refugee Employment Specialist Refugee Technology Resource Developer Environmental Stewardship AmeriCorps member serving with a Stream Team United team Since 1989, Stream Team United has formed over 6,000 groups to help take care of Missouri’s streams, rivers, and lakes. Members serving in the VISTA program have helped the organization to expand water education programs to benefit low-income youth and their communities by managing volunteers, identifying donors and developing after-school programs. Check out opportunities to serve with similar organizations: City of Las Vegas - Environmental Stewardship North Minneapolis Northside Green Zone - Environmental Justice Coordinator Shelby County - Environment and Conservation Program Healthy Futures AmeriCorps member Patrick (left) and AmeriCorps member Paloma (right) Meet Patrick and Paloma, members who use their passion for health and medicine to make a difference. Patrick, recently completed his service in the Summer Associate program with More Smiles Wisconsin , where he spent the summer helping patients in the clinic through dental assisting and volunteer recruitment. Patrick’s passion for dentistry and his ability to make patients feel at ease made him a perfect fit Paloma serves with KidSight where she helps to ensure that children across Missouri have healthy vision. Through her service, she helps the organization in its mission to provide free vision screenings for children to identify causes of vision loss for early treatment. Check out opportunities to serve with similar organizations: Wisconsin Association of Free Clinics HealthNet of Rock County Wyoming Office of Rural Health Whether you’re a musician, athlete, an aspiring ecologist, or dentist you can channel your passion through service to tackle poverty in your community. Meanwhile gaining professional development skills, earning a living allowance, and an education award for college expenses. Find out more about opportunities in the AmeriCorps VISTA program. Previous AmeriCorps Unites in Celebration: Older Adults Volunteer for Their Second Act Next AmeriCorps Unites in Celebration: Veterans Serve Because We Care Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-03-15/americorps-unites-celebration-music-dentistry-americorps-vistas-innovative-service",
    "https://www.tennisfame.com/teamfame",
    "https://my.americorps.gov/mp/listing/viewListing.do?fromSearch=true&amp;id=116275",
    "https://my.americorps.gov/mp/listing/viewListing.do?fromSearch=true&amp;id=116273",
    "https://my.americorps.gov/mp/listing/viewListing.do?fromSearch=true&amp;id=113848",
    "https://my.americorps.gov/mp/listing/viewListing.do?fromSearch=true&amp;id=113847",
    "https://my.americorps.gov/mp/listing/viewListing.do?fromSearch=true&amp;id=113830",
    "https://my.americorps.gov/mp/listing/viewListing.do?fromSearch=true&amp;id=115645",
    "https://my.americorps.gov/mp/listing/viewListing.do?fromSearch=true&amp;id=115645",
    "https://www.instagram.com/reel/CovewjlooT_/?utm_source=ig_embed&amp;utm_campaign=loading",
    "https://www.instagram.com/reel/CovewjlooT_/?utm_source=ig_embed&amp;utm_campaign=loading",
    "https://www.instagram.com/reel/CovewjlooT_/?utm_source=ig_embed&amp;utm_campaign=loading",
    "https://www.poetryforpersonalpower.org/",
    "https://my.americorps.gov/mp/listing/viewListing.do?fromSearch=true&amp;id=116678",
    "https://my.americorps.gov/mp/listing/viewListing.do?fromSearch=true&amp;id=114861",
    "https://www.transplantingtraditions.org/",
    "https://my.americorps.gov/mp/listing/viewListing.do?fromSearch=true&amp;id=115634",
    "https://my.americorps.gov/mp/listing/viewListing.do?fromSearch=true&amp;id=116714",
    "https://my.americorps.gov/mp/listing/viewListing.do?fromSearch=true&amp;id=85613",
    "https://my.americorps.gov/mp/listing/viewListing.do?fromSearch=true&amp;id=116036",
    "https://my.americorps.gov/mp/listing/viewListing.do?fromSearch=true&amp;id=116029",
    "https://www.streamteamsunited.org/",
    "https://my.americorps.gov/mp/listing/viewListing.do?fromSearch=true&amp;id=109824",
    "https://my.americorps.gov/mp/listing/viewListing.do?fromSearch=true&amp;id=116025",
    "https://my.americorps.gov/mp/listing/viewListing.do?fromSearch=true&amp;id=104910",
    "https://www.moresmileswi.org/",
    "https://kid-sight.org/",
    "https://my.americorps.gov/mp/listing/viewListing.do?fromSearch=true&amp;id=100249",
    "https://my.americorps.gov/mp/listing/viewListing.do?fromSearch=true&amp;id=113070",
    "https://my.americorps.gov/mp/listing/viewListing.do?fromSearch=true&amp;id=106207",
    "https://americorps.gov/serve/americorps/americorps-vista",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-03-15/americorps-unites-celebration-music-dentistry-americorps-vistas-innovative-service&amp;title=AmeriCorps Unites in Celebration: From Music to Dentistry - AmeriCorps VISTA&amp;#039;s Innovative Service Pathways",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-03-15/americorps-unites-celebration-music-dentistry-americorps-vistas-innovative-service&amp;title=AmeriCorps Unites in Celebration: From Music to Dentistry - AmeriCorps VISTA&amp;#039;s Innovative Service Pathways&amp;source=https://americorps.gov/blogs/2023-03-15/americorps-unites-celebration-music-dentistry-americorps-vistas-innovative-service",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-03-15/americorps-unites-celebration-music-dentistry-americorps-vistas-innovative-service&amp;url=https://americorps.gov/blogs/2023-03-15/americorps-unites-celebration-music-dentistry-americorps-vistas-innovative-service&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-03-14/americorps-unites-celebration-older-adults-volunteer-their-second-act",
    "https://americorps.gov/blogs/2023-03-16/americorps-unites-celebration-veterans-serve-because-we-care",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA",
  "focus_population": [
    "Rural"
  ],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "03",
  "subdomain_3": "15"
}