{
  "id": "americorpsgov_blogs_2024_05_16_american_youth_address_mental_health_through_national_servicehtml",
  "url": "https://americorps.gov/blogs/2024-05-16/american-youth-address-mental-health-through-national-service",
  "title": "american-youth-address-mental-health-through-national-service",
  "content": "American Youth Address Mental Health through National Service | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb American Youth Address Mental Health through National Service Submitted by dsong on Thu, 05/16/2024 - 17:18 May 16, 2024 AmeriCorps Staff The US Surgeon General Vivek Murthy has called for a swift and comprehensive response to the youth mental health crisis. One in three high school students, and half of female students, have reported persistent feelings of hopelessness, with 122 million Americans living in communities that lack adequate mental health services. The nation’s current mental health crisis was exacerbated because of the COVID-19 pandemic. Unprecedented social isolation, job loss, widespread sickness, persistent food instability, and unfathomable grief all played a significant role in increasing mental health needs. For youth, disruptions in routines and relationships led to increased social isolation, anxiety, and learning loss, which further accentuates the mental health crisis among young adults. On May 16, 2024, AmeriCorps joins the nation to recognize Mental Health Action Day, a nationwide effort to drive society from mental health awareness to mental health action. On this day, AmeriCorps aims to motivate Americans to prioritize mental health as much as their physical health, encourage the public to discuss mental health more openly, and announce AmeriCorps’ action – the launch of Youth Mental Health Corps . Transforming Awareness to Action For the past 30 years, AmeriCorps has been committed to eliminating barriers and prioritizing improving mental health support for children and young people across the country. Since the COVID-19 pandemic, AmeriCorps programs have leveraged national service to help schools safely reopen and address students’ mental health needs, using evidence-based interventions that respond to students’ social, emotional, and academic needs—such as the ability to collaborate with others or persist through difficult challenges. With partners like the US Department of Education and the Centers for Disease Control and Prevention, AmeriCorps is answering the Biden-Harris administration’s call to support our youth’s mental health by addressing the determinants of behavioral health, investing in community services, and fostering a culture and environment that creates supportive learning environments. AmeriCorps members and AmeriCorps Seniors volunteers serve at nearly 9,500 K-12 schools as tutors, mentors, and in other key roles to help develop students’ educational and social development and provide support to teachers. And, more than 4,0000 members have served in Public Health AmeriCorps , providing vital public health services while also getting the experience and training they need to pursue a career in public health. Youth Help Peers Navigate Mental Health Challenges AmeriCorps understands that when systems act to promote well-being early, youth reap the mental and emotional benefits for years to come. This Mental Health Action Day, AmeriCorps builds upon Public Health AmeriCorps by joining the Schultz Family Foundation and Pinterest to launch Youth Mental Health Corps – an innovative, public-private collaboration to support the growing needs of young people while creating career pathways to address the national shortage of mental health professionals. Hundreds of AmeriCorps members ages 18-24 will serve in the Youth Mental Health Corps across eleven initial states to serve as navigators in middle and high schools and community-based organizations, helping them kickstart their careers. Young adults serving as AmeriCorps members in YMHC will gain hands-on experience, develop skills, receive an education award, and obtain a credential while filling critical gaps in the mental health workforce and care delivery system through three service pathways: School-based mental health navigator. AmeriCorps members will serve in schools, out-of-school-time programs, and community-based organizations with limited access to mental health services while earning credentials and/or credits toward a higher education program. Peer support/recovery navigator. Open to members who have lived experience with mental health challenges and/or substance abuse disorder, these AmeriCorps members will support peers and near-peers along their recovery journey while getting the training and experience required to earn a peer support/recovery specialist state certification. Community mental health navigator. AmeriCorps members will have the opportunity to serve youth and young adults in communities, expand access to mental health resources, and receive the training, support, and experience needed to earn a state-based community health worker certification. National Service is a Movement to Bring Out the Best of America AmeriCorps members and AmeriCorps Seniors volunteers have been committed to service, recruiting others to serve, and creating service experiences that transform lives. Through their dedication to addressing our nation’s immediate challenges like mental health, they’ve demonstrated the strength of the national service movement in our country and continuously proven that AmeriCorps is not just a moment in our history but a movement to bring out the best of America. This Mental Health Action Day and throughout Mental Health Awareness Month, serve to help advance more equitable health outcomes for our communities. Learn more about the Youth Mental Health Corps at www.youthmentalhealthcorps.org . Previous Older Volunteers Powering Intergenerational Connection Next AmeriCorps Seniors Programs Combat Isolation and Elder Abuse Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2024-05-16/american-youth-address-mental-health-through-national-service",
    "https://www.youthmentalhealthcorps.org/",
    "https://www2.ed.gov/documents/students/supporting-child-student-social-emotional-behavioral-mental-health.pdf",
    "https://www.cdc.gov/index.html",
    "https://americorps.gov/serve/americorps/americorps-state-national/public-health-americorps",
    "https://www.youthmentalhealthcorps.org/",
    "https://www.youthmentalhealthcorps.org&quot;%20%EF%B7%9FHYPERLINK%20&quot;https//www.youthmentalhealthcorps.org",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2024-05-16/american-youth-address-mental-health-through-national-service&amp;title=American Youth Address Mental Health through National Service",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2024-05-16/american-youth-address-mental-health-through-national-service&amp;title=American Youth Address Mental Health through National Service&amp;source=https://americorps.gov/blogs/2024-05-16/american-youth-address-mental-health-through-national-service",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2024-05-16/american-youth-address-mental-health-through-national-service&amp;url=https://americorps.gov/blogs/2024-05-16/american-youth-address-mental-health-through-national-service&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2024-05-10/older-volunteers-powering-intergenerational-connection",
    "https://americorps.gov/blogs/2024-05-24/americorps-seniors-programs-combat-isolation-elder-abuse",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors; Public Health AmeriCorps",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2024",
  "subdomain_2": "05",
  "subdomain_3": "16"
}