{
  "id": "americorpsgov_blogs_2016_12_22_season_celebration_and_impacthtml",
  "url": "https://americorps.gov/blogs/2016-12-22/season-celebration-and-impact",
  "title": "season-celebration-and-impact",
  "content": "A Season of Celebration and Impact | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb A Season of Celebration and Impact Submitted by admin on Thu, 12/22/2016 - 15:58 Dec 22, 2016 As we celebrate the holiday season, it is fitting to take a few moments to reflect on the accomplishments and milestones that define the Corporation for National and Community Service (CNCS). This has been an eventful year, and we have been able to continue serving our nation in meaningful ways.  Through it all, we have seen how service opens doors, builds stronger communities, and unites us behind common causes. This agency supports the cause of service across all age groups, and spans the diversity of challenges and concerns that drive people to take action.  We can look up and down our tally of accomplishments and see how much our work matters at the 50,000 locations where our program operate … and to those who give of themselves to help. Our most-experienced Senior Corps volunteer started our year off with a bang. “Grandma Virginia” McLaurin, a then-106-year-old Foster Grandparent , became a social media sensation after dancing her way through a meeting President Obama and First Lady Michelle Obama. Grandma Virginia’s many years of service to students in the Washington, D.C., Foster Grandparent program is one of the best case studies we have that service not only adds years to your life, but life to your years.  And she inspired her family to serve, as her granddaughter joined the program this fall as a new Foster Grandma! Our commitment to increasing national service through partnership opportunities continued this year.  We embarked on several initiatives that expanded the reach of service in new areas and to underserved populations.  From protecting our seniors through Elder Justice AmeriCorps and providing the spark that builds economic opportunity in AmeriCorps and the Delta Regional Authority, we created new avenues of service.  This year’s advancements add to an overall total of $195 million in partnerships that created 14,000 AmeriCorps positions. We also confirmed other ways partnerships are valuable to expanding national service. Our grantees help boost every dollar in our budget with $1.26 billion in outside resources from private businesses, foundations, and other sources – an amount exceeding the agency’s federal appropriation. In April, we held our most-successful Mayor, County, and Tribal Day of Recognition for National Service as 3,539 leaders representing more than 178 million Americans stood tall to support our AmeriCorps and Senior Corps programs.  No other single-day event generates this level of bipartisan support for a civically driven cause. One of the reasons these leaders support our programs is that they can count on us to respond during their greatest times of need.  AmeriCorps members and Senior Corps volunteers responded to multiple disasters, including the floods in South Carolina and Louisiana, wildfires in Tennessee, and the water crisis in Flint. Our Social Innovation Fund (SIF) is a shining beacon that lives up to its name as it finds what works and makes it work for more people.  Since its inception, the SIF has funded 426 evidence-based programs in 44 states, helping hundreds of thousands of Americans find jobs, gain skills, and improve health.  A new SIF partnership with the Department of Veterans Affairs to help veterans to find jobs is one of the fund’s many accomplishments. Among our achievements this year, the AmeriCorps One Million Member milestone has to be near the top of the list.  During the last 22 years, AmeriCorps has become a part of the nation’s conscience, making national service and its alumni part of the conversation on how we can improve this country by using service to create more-engaged citizens who are ready to lead the way into the future. Whenever our nation faces stubborn challenges such as the persistent scourge of poverty or newer issues like the opioid crisis, we are prepared to lean in and work toward finding solutions. In 2016, I have been fortunate to witness the work national service does all across the nation – stretching from the Alaskan wilderness across the Great Plains and down to Louisiana and over to South Carolina, among other places too numerous to name. At each stop, I have seen examples of the resilience, dedication, and commitment of the hundreds of thousands of Americans who contribute their time and energy to helping their neighbors. America is a better place because of our national service family, whether they are serving through the unique and effective AmeriCorps NCCC program or as a Senior Corps volunteer sharing the knowledge they have acquired over decades of life. I am so grateful for every Governor-appointed State Service Commission, national service participant, and social innovation program.  I believe service will be the driving force that brings our nation together in the months and years ahead – and keeps our nation moving forward to a brighter future. As this year comes to a close, I invite you to share your favorite moments on our Facebook page , and join this conversation about impact and inspiration.  Whether you serve in a program, administer a grant, or support us as an elected official or corporate leader, thank you for supporting national service and have a joyous holiday season! Wendy Spencer is the CEO of the Corporation for National and Community Service . Previous You Served For America, Now Teach For America Next National Service Makes Tax Day a Little Less Taxing Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2016-12-22/season-celebration-and-impact",
    "https://www.nationalservice.gov/programs/senior-corps",
    "https://www.nationalservice.gov/programs/senior-corps/senior-corps-programs/foster-grandparents",
    "http://links.govdelivery.com:80/track?type=click&amp;enid=ZWFzPTEmbWFpbGluZ2lkPTIwMTYxMjIyLjY4MDEzOTIxJm1lc3NhZ2VpZD1NREItUFJELUJVTC0yMDE2MTIyMi42ODAxMzkyMSZkYXRhYmFzZWlkPTEwMDEmc2VyaWFsPTE3MTUyMzM4JmVtYWlsaWQ9Z3R1Y2tlckBjbnMuZ292JnVzZXJpZD1ndHVja2VyQGNucy5nb3YmZmw9JmV4dHJhPU11bHRpdmFyaWF0ZUlkPSYmJg==&amp;&amp;&amp;105&amp;&amp;&amp;https://www.nationalservice.gov/programs/americorps",
    "https://www.nationalservice.gov/special-initiatives/mayor-and-county-recognition-day",
    "https://www.nationalservice.gov/programs/social-innovation-fund",
    "https://www.nationalservice.gov/onemillion",
    "http://links.govdelivery.com:80/track?type=click&amp;enid=ZWFzPTEmbWFpbGluZ2lkPTIwMTYxMjIyLjY4MDEzOTIxJm1lc3NhZ2VpZD1NREItUFJELUJVTC0yMDE2MTIyMi42ODAxMzkyMSZkYXRhYmFzZWlkPTEwMDEmc2VyaWFsPTE3MTUyMzM4JmVtYWlsaWQ9Z3R1Y2tlckBjbnMuZ292JnVzZXJpZD1ndHVja2VyQGNucy5nb3YmZmw9JmV4dHJhPU11bHRpdmFyaWF0ZUlkPSYmJg==&amp;&amp;&amp;109&amp;&amp;&amp;https://www.nationalservice.gov/programs/americorps/americorps-nccc",
    "https://www.facebook.com/nationalservice",
    "https://www.nationalservice.gov/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2016-12-22/season-celebration-and-impact&amp;title=A Season of Celebration and Impact",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2016-12-22/season-celebration-and-impact&amp;title=A Season of Celebration and Impact&amp;source=https://americorps.gov/blogs/2016-12-22/season-celebration-and-impact",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2016-12-22/season-celebration-and-impact&amp;url=https://americorps.gov/blogs/2016-12-22/season-celebration-and-impact&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2016-02-17/you-served-america-now-teach-america",
    "https://americorps.gov/blogs/2017-04-18/national-service-makes-tax-day-little-less-taxing",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "Social Innovation Fund; AmeriCorps NCCC",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2016",
  "subdomain_2": "12",
  "subdomain_3": "22"
}