{
  "id": "americorpsgov_blogs_2023_06_08_conservation_education_americorps_members_make_difference_animals_peoplehtml",
  "url": "https://americorps.gov/blogs/2023-06-08/conservation-education-americorps-members-make-difference-animals-people",
  "title": "conservation-education-americorps-members-make-difference-animals-people",
  "content": "From Conservation to Education, AmeriCorps Members Make a Difference for Animals and People | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb From Conservation to Education, AmeriCorps Members Make a Difference for Animals and People Submitted by dsong on Tue, 06/06/2023 - 16:58 Jun 08, 2023 AmeriCorps Staff A Childhood Dream Come True As a child, AmeriCorps member Brooke says the education programs offered at zoos, aquariums, and wildlife refuges in Wisconsin sparked her interest in animals. The complex interactions between humans, animals, and their shared environments intrigued her. After earning her degree in global health from the University of Wisconsin-Madison, Brooke joined Racine Zoo as an AmeriCorps member to gain experience in conservation and youth education programs, helping foster an enlightening and affordable wildlife experience that improves the bond between people and nature. Racine Zoo is one of several animal welfare programs relying on national service members to help them meet their mission. Each year, hundreds of AmeriCorps members and AmeriCorps Seniors volunteers serve in programs focused animal care, student wildlife education, and conservation efforts. “My most unforgettable experience at the Racine Zoo was getting to see some of the animals painting behind the scenes. Our Eastern Black Rhinos have ditched the paintbrushes, and instead like to use their prehensile upper lip, acting as an independent feature to carry paint to the canvas,” said Brooke. A Once in a Lifetime Opportunity Kenzie’s passion for the animal care field and appreciation for education in the conservation field led her to service. She joined the Racine Zoo AmeriCorps program, which launched in 2019, because it allows national service members to serve in programs with a unique blend of animal care, conservation, and education. She studied biology with an emphasis on animal behavior at the University of Wisconsin – Stevens Point, where she had the opportunity to work directly on projects that impacted the local human and wildlife communities. Through her service, Kenzie learns about proper animal care for approximately 75 different species and more than 300 animals, classroom management, and building teamwork skills. “My most unforgettable moment while serving was seeing a student's eyes light up when seeing a lion up close for the first time. It really cemented the importance of strong conservation and environmental programming in my mind,” said Kenzie. Finding Purpose after College Hope has wanted to work with animals – dogs and horses – for as long as she can remember. But, she found her passion for birds and research after moving to Florida. During her final semester in environmental studies at the New College of Florida, Hope was searching for post-graduation opportunities that fit her interests and skills when she found the Racine Zoo AmeriCorps program. Not only did the intersection of education and animal care pique her interest, but Wisconsin was an exciting new start for her. Hope is now an AmeriCorps member who says service has changed her life. “There have been many moments at the zoo that I will remember for the rest of my life, but the most incredible was my first time hand-feeding our Eastern Black Rhino, Timu. It has been remarkable spending so much time with all of our incredible animals and watching their relationships with their keepers,” said Hope. A Service Journey for Everyone AmeriCorps members serving in zoos and aquariums – like Brooke, Kenzie, and Hope – demonstrate how young people can find careers through service when they choose AmeriCorps. More than 7,900 serve as AmeriCorps members and AmeriCorps Seniors volunteers in Wisconsin. Whether it’s helping care for exotic or endangered animals, teaching the next generation about how we all coexist, or preparing today’s students for tomorrow’s jobs, AmeriCorps members at more than 900 locations serve to make lasting change for people and animals across the state. This National Zoo and Aquarium Month, find out how you can turn your passion for animals into a career opportunity  through national service . Previous Military Appreciation Month: Service Empowers Veterans and Military Families Next From Father to Child, Passing on the Value of Service Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-06-08/conservation-education-americorps-members-make-difference-animals-people",
    "https://racinezoo.org/",
    "https://americorps.gov/serve",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-06-08/conservation-education-americorps-members-make-difference-animals-people&amp;title=From Conservation to Education, AmeriCorps Members Make a Difference for Animals and People",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-06-08/conservation-education-americorps-members-make-difference-animals-people&amp;title=From Conservation to Education, AmeriCorps Members Make a Difference for Animals and People&amp;source=https://americorps.gov/blogs/2023-06-08/conservation-education-americorps-members-make-difference-animals-people",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-06-08/conservation-education-americorps-members-make-difference-animals-people&amp;url=https://americorps.gov/blogs/2023-06-08/conservation-education-americorps-members-make-difference-animals-people&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-05-26/military-appreciation-month-service-empowers-veterans-military-families",
    "https://americorps.gov/blogs/2023-06-16/father-child-passing-value-service",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [
    "Veterans and Military Families"
  ],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "06",
  "subdomain_3": "08"
}