{
  "id": "americorpsgov_blogs_2021_02_26_president_biden_visits_storm_ravaged_houston_americorps_steps_clutch_cityhtml",
  "url": "https://americorps.gov/blogs/2021-02-26/president-biden-visits-storm-ravaged-houston-americorps-steps-clutch-city",
  "title": "president-biden-visits-storm-ravaged-houston-americorps-steps-clutch-city",
  "content": "President Biden Visits Storm-Ravaged Houston, AmeriCorps Steps Up for Clutch City | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb President Biden Visits Storm-Ravaged Houston, AmeriCorps Steps Up for Clutch City Submitted by edelany on Fri, 02/26/2021 - 10:29 Feb 26, 2021 Sri Kulkarni, AmeriCorps Over my lifetime, I have seen tropical storms turn downtown Houston into a lake, and hurricane after hurricane devastate my hometown. For a city that saw three 500-year floods in three years, including Harvey, we Houstonians are a resilient community. Nothing prepared us for what we experienced last week. While much of the country was stuck at home due to the frigid weather of Winter Storm Uri, millions of Americans across Oklahoma, New Mexico, and my home state of Texas experienced the coldest temperatures ever recorded, losing power and heat for days. Many of us warmed ourselves by sleeping in our cars or burning our furniture as our bathtubs turned to ice. Pipes burst all over the city and many still are without safe drinking water in our homes. The collective trauma experienced in one week is hard to capture in words. In times like these, patriotic Americans committed to national service, collectively known as AmeriCorps, rise to the challenge and go where they are needed. Today, President Biden is in Houston to survey the aftermath, meet with neighbors whose lives were completely upended less than a week ago, and serve with local community volunteers at the Houston Food Bank. Even before the storm, national service members were serving in Texas, supporting local nonprofit and faith-based organizations providing COVID-19 relief. When the storm hit, AmeriCorps members in Houston and across the state quickly pivoted to help families assess damages, begin cleanup and start down the road to recovery. AmeriCorps members in the NCCC program were already working with local nonprofit The Restoration Team to provide residents continuing Hurricane Harvey recovery support. They quickly shifted their focus and began cleaning up homes that suffered water damage in the wake of the storm. Removing water-logged sheet rock and carpeting, installing temporary insulation, and conducting mold remediation, these members are making homes safer for storm-affected Texans. As I helped clean and document storm-damaged houses in Houston’s 5th Ward on February 21, the first volunteer I met was Andrew, an AmeriCorps alumnus, whose life was changed by national service. As soon as he was sure his family was safe and was able to leave his own home, he was out helping others who were not so lucky. The diversity of members and organizations pitching in to serve is truly moving as the commitment to national service crosses all bounds of language, ethnicity, and religion. Sewa International, a Hindu faith-based organization comprised mainly of immigrants, has 18 AmeriCorps members serving alongside the organization, which provided information sessions in Spanish ahead of Uri to teach people who have never dealt with extreme cold before how to protect their pipes from freezing. And after the storm, they are still here, helping neighbors complete basic needs assessments and partnering with schools to provide resources for students and their families. With the help of their AmeriCorps members, Sewa International hosted a critical food drive last weekend, delivering more than 43,000 pounds of food and thousands of gallons of water to our community. Other AmeriCorps members and AmeriCorps Seniors volunteers—along with the OneStar Foundation, Texas State Service  Commission—are serving across the state at this moment to help neighbors find their way forward; SBP launched an unmet needs survey for community distribution while preparing to deploy more members to support disaster recovery efforts; CitySquare in Dallas is operating a high-volume food bank; Senior Source, one of AmeriCorps longest-serving RSVP programs, expanded its fraud prevention education program to support seniors who can be targeted for fraudulent relief programs; and College Advising Corps continues to assist rescue efforts saving sea turtles from freezing waters surrounding South Padre Island. This is just a small sampling of how national service is responding to communities here and around the country. Houston is known as “Clutch City” because of a dramatic sports comeback 27 years ago. Yet, our greatest comebacks haven’t been on the basketball court, they’ve been from natural disasters. Throughout our country, people have been hit by unimaginable tragedies, but the reason we are able to come back again and again is because of the people who are willing to step up and serve their community when that community needs it the most. That’s what I call being clutch. Sri Kulkarni, a native Houstonian, serves as the chief of external affairs for AmeriCorps, the national service agency. More than 270,000 members serve in AmeriCorps and AmeriCorps Seniors programs across the country, committed to COVID-relief, economic and racial justice, disaster response, education, environmental stewardship, and a variety of local, state, and national volunteering and community service efforts. Previous Recounting the Stories and Lives of Blacks Americans: One Member’s Pursuit of Social Justice Next AmeriCorps Kicks-off Women’s History Month, Getting to Know Trailblazers Mary Tobin and Atalaya Sergi Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2021-02-26/president-biden-visits-storm-ravaged-houston-americorps-steps-clutch-city",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2021-02-26/president-biden-visits-storm-ravaged-houston-americorps-steps-clutch-city&amp;title=President Biden Visits Storm-Ravaged Houston, AmeriCorps Steps Up for Clutch City ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2021-02-26/president-biden-visits-storm-ravaged-houston-americorps-steps-clutch-city&amp;title=President Biden Visits Storm-Ravaged Houston, AmeriCorps Steps Up for Clutch City &amp;source=https://americorps.gov/blogs/2021-02-26/president-biden-visits-storm-ravaged-houston-americorps-steps-clutch-city",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2021-02-26/president-biden-visits-storm-ravaged-houston-americorps-steps-clutch-city&amp;url=https://americorps.gov/blogs/2021-02-26/president-biden-visits-storm-ravaged-houston-americorps-steps-clutch-city&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2021-02-22/recounting-stories-lives-blacks-americans-one-members-pursuit-social-justice",
    "https://americorps.gov/blogs/2021-03-05/americorps-kicks-womens-history-month-getting-know-trailblazers-mary-tobin-atalaya",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2021",
  "subdomain_2": "02",
  "subdomain_3": "26"
}