{
  "id": "americorpsgov_blogs_2017_12_19_hometown_heroes_dominic_gonzalez_gives_back_san_antonio_americorps_vistahtml",
  "url": "https://americorps.gov/blogs/2017-12-19/hometown-heroes-dominic-gonzalez-gives-back-san-antonio-americorps-vista",
  "title": "hometown-heroes-dominic-gonzalez-gives-back-san-antonio-americorps-vista",
  "content": "Hometown Heroes: Dominic Gonzalez Gives Back to San Antonio with AmeriCorps VISTA | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Hometown Heroes: Dominic Gonzalez Gives Back to San Antonio with AmeriCorps VISTA Submitted by admin on Tue, 12/19/2017 - 14:47 Dec 19, 2017 Service experience helps man overcome unexpected homelessness By Dominic Gonzalez As an AmeriCorps VISTA member serving with San Antonio’s Department of Human Services, I spent 12 months as a Research and Engagement Coordinator helping understand the families we serve and developing the professionals who engage them. My background prior to AmeriCorps VISTA encompassed work with impoverished populations, at-risk youth, homeless families, and abused children. My own story, however, took a hard turn when I came to rely on the services I used to provide. While battling epilepsy, I wound up living at a homeless shelter where I was once employed. My former colleagues became my service providers. ”The takeaway from my experience is simple yet profound: We can still give to others even if we have nothing for ourselves.“ I was homeless for 16 months. While living at the homeless shelter and becoming healthier, I volunteered to wash and fold blankets in the shelter’s industrial laundry room for a stipend of $10 a day. At the end of my evening shifts, I would push about 800 blankets to a gated courtyard where a staggering number of homeless people were lined up to claim them. Each day, the soiled blankets would be reclaimed, counted, washed, and redistributed without question. I found other opportunities to volunteer at my shelter. I tutored and mentored two homeless high school students (who both graduated from high school that spring); helped people write resumes; took disabled men on their errands and doctor’s appointments; and assisted the staff in completing day-to-day tasks. The takeaway from my experience is simple yet profound: We can still give to others even if we have nothing for ourselves. I had been living in my new home for just a couple weeks when I was selected as an AmeriCorps VISTA member. I was merely looking for an opportunity to work but what I found instead was an opportunity to serve my country, get my career back on track, and utilize my education for one of America’s most comprehensive education programs: Head Start. For this, I am humbled. After my service year, I intend to enroll in a Masters of Public Affairs program. I dream I will one day open a charitable residence that helps homeless teenagers graduate from high school, attend college, and choose a career. Previous A Thank You to Our Veterans Next Be the Greater Good. Join AmeriCorps. Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2017-12-19/hometown-heroes-dominic-gonzalez-gives-back-san-antonio-americorps-vista",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2017-12-19/hometown-heroes-dominic-gonzalez-gives-back-san-antonio-americorps-vista&amp;title=Hometown Heroes: Dominic Gonzalez Gives Back to San Antonio with AmeriCorps VISTA",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2017-12-19/hometown-heroes-dominic-gonzalez-gives-back-san-antonio-americorps-vista&amp;title=Hometown Heroes: Dominic Gonzalez Gives Back to San Antonio with AmeriCorps VISTA&amp;source=https://americorps.gov/blogs/2017-12-19/hometown-heroes-dominic-gonzalez-gives-back-san-antonio-americorps-vista",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2017-12-19/hometown-heroes-dominic-gonzalez-gives-back-san-antonio-americorps-vista&amp;url=https://americorps.gov/blogs/2017-12-19/hometown-heroes-dominic-gonzalez-gives-back-san-antonio-americorps-vista&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2017-11-09/thank-you-our-veterans",
    "https://americorps.gov/programs/americorps/join-americorps",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2017",
  "subdomain_2": "12",
  "subdomain_3": "19"
}