{
  "id": "americorpsgov_blogs_2022_08_05_second_gentleman_ready_servehtml",
  "url": "https://americorps.gov/blogs/2022-08-05/second-gentleman-ready-serve",
  "title": "second-gentleman-ready-serve",
  "content": "The Second Gentleman is Ready to Serve | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb The Second Gentleman is Ready to Serve Submitted by eschneider on Thu, 08/04/2022 - 18:03 Aug 05, 2022 AmeriCorps Staff FIRED UP! READY TO SERVE! Not even the sweltering heat could hold back Second Gentleman Douglas Emhoff and AmeriCorps CEO, Michael D. Smith from serving. They got to work creating green spaces in Baltimore, Md. with AmeriCorps members who serve with Civic Works. Baltimore has approximately 16,500 vacant lots. While some of these vacant spaces are slated for redevelopment, an estimated 65% of them are in communities without development demand. Civic Works’ community partners identify vacant lots and small, undervalued public parks that attract trash and debris for cleanup. And that where AmeriCorps members come in. Serving with Civic Works’ Community Landscaping Team, they help improve the grading, install native plants, trees, and grasses, install rain gardens, bioswales, and other best management practices, make vacant spaces more usable, encourage residents to maintain them, and reduce the flow of nutrients and sediments in stormwater. Joined by Baltimore Mayor Brandon Scott and Civic Works Executive Director Dana Stein, Emhoff and Smith served alongside AmeriCorps members at three separate garden sites. From digging in the hot ground to planting perennials and trees, they dusted off their gardening skills to plant the very first rain the garden in Baltimore’s Mount Clare neighborhood. “We need to rebuild all of our communities, and if you think about infrastructure, even planting trees and having clean air and clean water, places for people to actually congregate, and that’s what’s so amazing about what we learned here. We are reclaiming this vacant lot,” said Second Gentleman Douglas Emhoff. It's not the first time the second gentleman has come out to serve with AmeriCorps. He joined a similar project in DC during AmeriCorps Week. He may be an honorary AmeriCorps member soon enough. “One of my favorite things about being second gentleman is learning about all the programs we have… like AmeriCorps,” said the second gentleman, adding he will do anything he can to lift up these programs. Civic Works is one of more the more than 100 environmental and conservation corps in the AmeriCorps network.  More than 5,700 AmeriCorps members have served in Civic Works since 1993. Their mission is to strengthen Baltimore’s communities through education, skills development, and community service.  Each year, 100 AmeriCorps members, 100 job trainees, and 2,000 volunteers come together to “build brighter futures” through workforce development programs and operating a public high school; grow healthy food and green communities through community landscaping and urban farming; and create safe and affordable homes for older adults who want to age in place and families who want to save energy. They’ve made a large and lasting impact in their community. During the visit, the second gentleman, AmeriCorps CEO, and Baltimore mayor spoke with groups of AmeriCorps members about why they joined and what they’ve learned.  Then they picked up shovels, picks, and loppers and joined in the work.  Their first stop was planting perennials to hold rainwater in the ground and reduce storm water drain overflow. At station two, they weeded an old rain garden. At station three, they planted trees. During his visit, Emhoff said, “we need to do everything we can to combat what is a climate crisis. And I'm going to keep working with AmeriCorps on projects like this and other projects that they do throughout the country.” AmeriCorps couldn’t agree more. For nearly three decades, AmeriCorps has provided significant funding to support conservation corps and this investment is making a big impact. In 2021, 16,000 AmeriCorps members and AmeriCorps Seniors volunteers: improved more than 400,000 acres of parks and public lands; treated 14,500 miles of trails or rivers; weatherized or retrofitted more than 7,000 homes or public structures; protected or restored nearly 1,000 structures after natural disasters; and provided environmental stewardship education and training to more than 200,00 individuals. This summer, AmeriCorps made an initial investment of more than $63 million in new AmeriCorps grants to support more than 10,200 members who will carry out environmental stewardship, disaster services, and climate change projects in rural and urban communities across the country over the coming year. The agency will make additional climate and conservation focused grants in the coming weeks.  These resources will help AmeriCorps programs like Civic Works address a top priority of the Biden-Harris Administration: tackling the crisis of climate change. Following the tree planting, Emhoff again visited with the whole team of AmeriCorps members. “People like you who are helping the communities,” the second gentleman stated. “That’s what we need.” Previous Unite through Service on September 11 Next How You Can Honor 9/11 Day of Service Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2022-08-05/second-gentleman-ready-serve",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2022-08-05/second-gentleman-ready-serve&amp;title=The Second Gentleman is Ready to Serve ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2022-08-05/second-gentleman-ready-serve&amp;title=The Second Gentleman is Ready to Serve &amp;source=https://americorps.gov/blogs/2022-08-05/second-gentleman-ready-serve",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2022-08-05/second-gentleman-ready-serve&amp;url=https://americorps.gov/blogs/2022-08-05/second-gentleman-ready-serve&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2022-08-05/unite-through-service-september-11",
    "https://americorps.gov/blogs/2022-08-18/how-you-can-honor-911-day-service",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2022",
  "subdomain_2": "08",
  "subdomain_3": "05"
}