{
  "id": "americorpsgov_blogs_2021_04_23_americorps_tackling_climate_crisis_building_clean_energy_futurehtml",
  "url": "https://americorps.gov/blogs/2021-04-23/americorps-tackling-climate-crisis-building-clean-energy-future",
  "title": "americorps-tackling-climate-crisis-building-clean-energy-future",
  "content": "AmeriCorps is Tackling the Climate Crisis and Building a Clean Energy Future | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps is Tackling the Climate Crisis and Building a Clean Energy Future Submitted by pnolan on Fri, 04/23/2021 - 16:43 Apr 23, 2021 Sandy Scott, AmeriCorps After college, Wyatt Atkinson, a member of the Assiniboine and Sioux tribe, was looking for a way to help his reservation become energy independent. Through AmeriCorps, he gained hands-on experience installing solar power for low-income families in the GRID Alternatives SolarCorps program. Today, he leads the SolarCorps tribal program, working to fulfill his goal of energy sovereignty for tribal lands. Growing up in Northern Michigan, Leticia Rosha faced poverty and other hardships. After high school, she joined a local AmeriCorps program, carrying out conservation and habitat restoration projects. The experience gave her workforce skills and inspired her to pursue a career in environmental stewardship. Mike Bremer was having a tough time finding work and adjusting to civilian life after his military service ended. Then he joined AmeriCorps, serving on the all-veterans fire team with the Southwest Conservation Corps. With the skills he gained, Mike was able to secure a job with the U.S. Forest Service as a full-time wildland firefighter. Wyatt, Leticia, and Mike demonstrate a powerful principle of national service: protecting the environment expands economic opportunity. That principle offers a powerful solution as our nation faces the converging crises of climate change, racial inequity, and unemployment due to the pandemic. Tackling the Climate Crisis President Biden has proposed a robust, whole-of-government approach to combat the climate crisis. The plan reflects the overwhelming scientific consensus that climate change is real, it’s already causing significant damage to our environment and our economy, and it poses an existential threat if we don’t take begin taking comprehensive action now. The plan also recognizes that addressing climate change offers enormous potential to create millions of good-paying jobs that can transform our economy—and lives of the American people. A key pillar of the administration’s plan is a new Civilian Climate Corps to put a diverse generation of Americans to work conserving public lands, promoting renewable energy, building community resilience, and preparing young people for the green jobs of the future. With decades of experience in environmental stewardship, a vast network of partners across the country, a community-driven approach that is responsive to local needs, and proven pathways from service to employment, AmeriCorps is uniquely positioned to support the Civilian Climate Corps and meet other climate change priorities. A Modern Day CCC Eighty-eight years ago, the Civilian Conservation Corps engaged millions of young men in preserving parks and public lands, providing skills and experience to a generation of young people. For nearly three decades, AmeriCorps has served as a modern-day CCC, yet more diverse, equitable, and focused on 21st century environmental challenges. Working closely with other federal agencies, Governor-appointed State Service Commissions, and hundreds of nonprofit partners, AmeriCorps engages more than 15,000 AmeriCorps members and AmeriCorps Seniors volunteers each year in conservation, renewable energy, and community resilience projects that address the climate crisis: Preserving public lands and waters, protecting biodiversity, increasing reforestation, building restoring watersheds, and expanding access to recreation — improving 330,000 acres of public lands each year. Reducing carbon emissions and saving energy costs by weatherizing homes and public buildings, performing energy audits, and installing solar panels and other renewable energy systems. Supporting urban areas by creating and maintaining city parks and greenspaces, improving stormwater management, recycling, and maintaining urban farms. Reducing greenhouse gas emissions associated with food systems through community gardens, farm to table initiatives, reducing food waste, and nutrition education. Helping communities prepare, respond, and recover from natural disasters and other climate-change effects. Unlike the CCC of the New Deal era which was open only to men and was primarily white, AmeriCorps reflects the diversity of America. AmeriCorps members are as racially and ethnically diverse as the general population — men and women of all ages and backgrounds including low-income and minority young adults, Native Americans, veterans, and older Americans. Pathway to Future Green Jobs AmeriCorps is a proven pathway to employment that provides a living allowance, training, workforce skills, and sustained hands-on experience to prepare people for the clean energy jobs of the future. AmeriCorps members gain skills that are specific to their service — such as firefighting, habitat restoration, or weatherization — as well as general skills of leadership, teamwork, and problem-solving that benefit all employers. Some AmeriCorps program are certified pre-apprenticeships, while others offer industry-recognized credentials in first-aid/CPR, logging and chain saw safety, energy auditing, wildland firefighting, and other areas. Some AmeriCorps members are eligible for non-competitive eligibility for federal employment, creating a pipeline to public service that helps national service alumni achieve their career goals and federal agencies diversify their workforces to better realize their mission. In addition to workforce skills, AmeriCorps members earn an education award equal to the Pell grant that can be used to pay for college, technical training, or repay student loans. At a time of rising college costs and student debt, the education award makes post-secondary education more accessible and affordable. Fifty-one years ago, Wisconsin Senator Gaylord Nelson called the country to pause and think about how we can better take care of our planet, and Earth Day was born. Earth Day is a time to reflect on the state of our planet and steps we can take to preserve our natural resources for future generations. Climate change is a daunting challenge that requires coordinated and decisive action. It is a moment of peril, but also of extraordinary possibility. National service is exceptionally well positioned to preserve our lands and our waters, expand renewable energy use, and increase community resilience. Engaging passionate, committed Americans of all ages in national service to tackle the climate crisis is a smart and cost-effective way to increase racial and economic opportunity and build a more prosperous, sustainable future. #AmeriCorpsWorks Previous Help Health and Human Services Support Migrant Children Next Heather Baily Named an Honorary AmeriCorps Member Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2021-04-23/americorps-tackling-climate-crisis-building-clean-energy-future",
    "https://www.whitehouse.gov/briefing-room/presidential-actions/2021/01/27/executive-order-on-tackling-the-climate-crisis-at-home-and-abroad/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2021-04-23/americorps-tackling-climate-crisis-building-clean-energy-future&amp;title=AmeriCorps is Tackling the Climate Crisis and Building a Clean Energy Future",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2021-04-23/americorps-tackling-climate-crisis-building-clean-energy-future&amp;title=AmeriCorps is Tackling the Climate Crisis and Building a Clean Energy Future&amp;source=https://americorps.gov/blogs/2021-04-23/americorps-tackling-climate-crisis-building-clean-energy-future",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2021-04-23/americorps-tackling-climate-crisis-building-clean-energy-future&amp;url=https://americorps.gov/blogs/2021-04-23/americorps-tackling-climate-crisis-building-clean-energy-future&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2021-04-05/help-health-human-services-support-migrant-children",
    "https://americorps.gov/blogs/2021-05-13/heather-baily-named-honorary-americorps-member",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2021",
  "subdomain_2": "04",
  "subdomain_3": "23"
}