{
  "id": "americorpsgov_blogs_2022_10_20_building_proud_legacy_service_marylandhtml",
  "url": "https://americorps.gov/blogs/2022-10-20/building-proud-legacy-service-maryland",
  "title": "building-proud-legacy-service-maryland",
  "content": "Building a Proud Legacy of Service in Maryland | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Building a Proud Legacy of Service in Maryland Submitted by dsong on Thu, 10/20/2022 - 11:13 Oct 20, 2022 Fagan Harris One thing you should know about me is that I am a proud Marylander—and more specifically, a proud Baltimorean. I co-founded Baltimore Corps because I understand the power of bringing Marylanders together, pushing for more equitable social and economic systems, and building connections that make a difference in communities. At the same time, we know that some Maryland communities have been historically underserved and still face systemic barriers to overcoming poverty and accessing high-quality academic opportunities. When I accepted the nomination to join the AmeriCorps Board of Directors, I saw the potential to address these challenges. I also saw an incredible opportunity to connect diverse champions of national service in Maryland to like-minded projects across the country. Since then, I’ve seen the power of AmeriCorps to be a force multiplier as it expands programs’ impact and unites people from all walks of life though national service. Maryland has a heart for service, and AmeriCorps is amplifying my state’s volunteer impact by investing in critical programs and resources. Last year, AmeriCorps invested more than $18 million in schools, food banks, homeless shelters, health clinics, youth centers, veterans’ facilities, and other nonprofit and faith-based organizations across Maryland. These investments empowered more than 5,200 Americans of all backgrounds to meet local needs and strengthen communities at 700 locations across the state. AmeriCorps members serving with Maryland Conservation Corps Along the way, AmeriCorps programs are actively working alongside Marylanders to address community-specific issues, from college access to climate change to conservation. Here are a few examples: The Choice Program at University of Maryland, Baltimore County leverages AmeriCorps members in projects that help alleviate the impacts of poverty and improve college access for underserved youth. The Notre Dame Mission Volunteers Program, Inc. has more than 400 AmeriCorps members who provide small group and one-on-one instruction to underserved K-12 students and adults in 30 communities. The Maryland Department of Juvenile Justice Foster Grandparent Program connects older adults with youth offenders (ages 7-21) to cultivate supportive environments, jump start the school year, and create individualized care plans. Transform Mid-Atlantic creates a pipeline of mentoring services for under-resourced students, develops outreach for unemployed adult learners, and increases education access for first-generation families through more than 30 different projects with AmeriCorps members in the VISTA program deployed in Maryland, Delaware, and DC. Fund for Educational Excellence and Maryland Out of School Time engages AmeriCorps VISTA members to address disparities in youth development by strengthening before- and after-school programs in Maryland. Baltimore Community Health Corps is a new Baltimore Corps program and inaugural Public Health AmeriCorps grantee. Over the next three years, Baltimore Corps will recruit and train a total of 80 members to serve as community health navigators to improve health outcomes for residents and bolster the public health workforce in Maryland. Recently, I celebrated the 26 new AmeriCorps members serving in Baltimore Community Health Corps. It’s great to see local and state elected leaders acting in states like Maryland to advance national service. Action in Maryland’s legislature includes enactment of legislation that strengthens Maryland Corps by expanding the Chesapeake Conservation Corps and the Maryland Conservation Corps and creating both a Maryland Civilian Climate Corps and a Maryland Historic Trades Corp. Everyone Can Serve Again, these are just a few of the many examples that show how service can help build bridges and cultivate connections. National service has proven to be one of our best tools for reaching untapped talent and strengthening our communities. I have seen the incredible benefits of national service firsthand in Baltimore and across Maryland. And I know AmeriCorps is getting to work in your state, too. I urge you to find an opportunity to make your community and our country better and stronger through service. Fagan Harris was confirmed to the AmeriCorps Board of Directors by the US Senate in December 2021. As the co-founder and CEO of Baltimore Corps, Harris has led his team to re-imagine recruiting, hiring, and career advancement for underestimated communities. Previous Americans Unite in Service on 9/11 Day Next Giving Back to the Veteran Community Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2022-10-20/building-proud-legacy-service-maryland",
    "https://www.baltimorecorps.org/",
    "https://choice.umbc.edu/",
    "https://www.ndmva.org/",
    "https://djs.maryland.gov/Pages/Foster-Grandparent.aspx#:~:text=The%20program%20provides%20a%20way,Grandparent%20program%20for%2032%2B%20years.",
    "https://transformmidatlantic.org/",
    "https://ffee.org/",
    "https://www.baltimorecorps.org/bchealthcorps",
    "https://americorps.gov/publichealth",
    "https://americorps.gov/newsroom/press-release/americorps-baltimore-corps-rep-sarbanes-swear-inaugural-public-health",
    "https://www.baltimorecorps.org/bchealthcorps",
    "https://americorps.gov/",
    "https://www.americorps.gov/leadership/fagan-harris",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2022-10-20/building-proud-legacy-service-maryland&amp;title=Building a Proud Legacy of Service in Maryland",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2022-10-20/building-proud-legacy-service-maryland&amp;title=Building a Proud Legacy of Service in Maryland&amp;source=https://americorps.gov/blogs/2022-10-20/building-proud-legacy-service-maryland",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2022-10-20/building-proud-legacy-service-maryland&amp;url=https://americorps.gov/blogs/2022-10-20/building-proud-legacy-service-maryland&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2022-10-07/americans-unite-service-911-day",
    "https://americorps.gov/blogs/2022-11-10/giving-back-veteran-community",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA; Public Health AmeriCorps",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2022",
  "subdomain_2": "10",
  "subdomain_3": "20"
}