{
  "id": "americorpsgov_evidence_exchange_Greenville_Health_System__School_Based_Health_Centershtml",
  "url": "https://americorps.gov/evidence-exchange/Greenville-Health-System_-School-Based-Health-Centers",
  "title": "Greenville-Health-System_-School-Based-Health-Centers",
  "content": "Greenville Health System: School-Based Health Centers | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Greenville Health System: School-Based Health Centers Back The United Way of Greenville County (UWGC) received a 2014 Social Innovation Fund (SIF) grant to support the implementation of the OnTrack Greenville initiative, a collective impact dropout-prevention program for middle grade students. Greenville Health System (now known as Prisma Health – Upstate) is a subgrantee of UWGC that implemented School-Based Health Centers (SBHC). These SBHCs were integrated into existing school health room frameworks to provide a variety of medical services not otherwise available in schools. Study Goals : The evaluation builds additional evidence for the SBHC’s model impact on student attendance. The evaluation also examines additional outcomes, including course grades and behavior. The goal is to contribute to the national conversation on the relationship between health and educational outcomes, and the effectiveness of integrating health services within community-based settings. Research Questions : The evaluation included impact and implementation research questions. Some of the research questions were: Impact Questions: Did student who used SBHC services have higher attendance rates than matched comparison students? Did students who used SBHC services demonstrate improved course performance in English language arts and math? Did students who used SBHC services have fewer behavioral incidents than matched comparison students? Were students who used SBHC services more likely to have an identified medical home than matched comparison students? Following implementation of the SBHC model, was there an increase in the number of students who returned to class after a health visit at treatment middle schools? Following implementation of the SBHC model, was there an increase in the awareness of the SBHC’s purpose and services offered among school staff members at treatment middle schools? Implementation Questions: What factors influenced implementation? What proportion of students participated in SBHC activities? What proportion of students used specific services? What access trends were observed among subgroups of students? Findings: The evaluation found the following: There were no significant differences in average daily attendance or chronic absenteeism between SBHC students and comparison students. Students who used services at SBHCs showed significant growth in Measures of Academic Progress (MAP) math scores compared to matched comparison students. Students who used the SBHCs received, on average, 0.84 fewer days of out-of-school suspension and 3.10 fewer hours of in-school suspension than matched comparison students in the academic year 2016-2017. In academic year 2016-2017, the OnTrack Greenville schools had between 16 and 20 percent of their student population using the SBHC. Sports physicals were the reason for almost half of student visits to SBHCs in 2016-2017 and 2017-2018. For more information, download the full report and report brief . Full report Full Report UWGC Greenville Health System SBHC Final Impact Report 5.16.19_508.pdf UWGC_GHS Rr1040 2019.04.02 CNCS Report Brief_FINAL_508.pdf Further information Program/Intervention OnTrack Greenville - School-Based Health Centers Implementing Organization Greenville Health System Intermediary(s) United Way of Greenville County AmeriCorps Program(s) Social Innovation Fund Age(s) Studied 6-12 (Childhood) Study Type(s) Impact Implementation Study Design(s) Quasi-Experimental (QED) Level of Evidence Preliminary Researcher/Evaluator The Riley Institute of Furman University and Clemson University Published Year 2019 Study Site Location (State) South Carolina Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/evidence-exchange/Greenville-Health-System%3A-School-Based-Health-Centers",
    "https://www.nationalservice.gov/sites/default/files/evidenceexchange/UWGC%20Greenville%20Health%20System%20SBHC%20Final%20Impact%20Report%205.16.19_508.pdf",
    "https://www.nationalservice.gov/sites/default/files/evidenceexchange/UWGC_GHS%20Rr1040%202019.04.02%20CNCS%20Report%20Brief_FINAL_508.pdf",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/evidenceexchange/UWGC%20Greenville%20Health%20System%20SBHC%20Final%20Impact%20Report%205.16.19_508_1.pdf",
    "https://americorps.gov/sites/default/files/evidenceexchange/UWGC_GHS%20Rr1040%202019.04.02%20CNCS%20Report%20Brief_FINAL_508_1.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "Social Innovation Fund",
  "focus_population": [],
  "ages_studied": [
    "6-12 (Childhood)"
  ],
  "resource_type": "evidence-exchange",
  "topic": "",
  "year": "",
  "domain": "evidence-exchange"
}