{
  "id": "americorpsgov_evidence_exchange_GreenLight_Fund_College_Advising_Corps_Boston_Universityhtml",
  "url": "https://americorps.gov/evidence-exchange/GreenLight-Fund---College-Advising-Corps-%40-Boston-University",
  "title": "GreenLight-Fund---College-Advising-Corps-%40-Boston-University",
  "content": "GreenLight Fund - College Advising Corps @ Boston University | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb GreenLight Fund - College Advising Corps @ Boston University Back College Advising Corps @ Boston University (CAC) strives to increase the number of low-income, first-generation college, and underrepresented students entering and completing higher education. CAC recruits and trains recent college graduates from partner higher education institutions to serve as full-time advisers. Through a 2013 Social Innovation Fund grant, CAC provided college advisers in 33 Boston public high schools and in one additional Boston area charter school. Study Goals : The study aims to answer questions regarding the program’s impact on the college-going culture of schools, its effect on parents, and its influence on the advisers. Research Questions : The research questions were: What is CAC’s impact on college enrollment, college choice, and enrollment intensity, particularly for the targeted students? What is the program’s impact on students’ pathways to college? How does CAC affect the college going culture? How did CAC influence parents’ involvement in the college choice process? How does CAC affect advisers’ attitudes and life choices? How was CAC implemented in Boston including fidelity of treatment, the characteristics of services, and variations in implementation? Was CAC cost-effective? Findings: The study found the following: CAC improved college enrollment for students, with a significant positive impact when students were disaggregated by income status, race/ethnicity, and gender. CAC was found to have significant positive findings on college enrollment for Hispanic, low-income, and male students. The enrollment impacts of CAC are not concentrated in four- or two-year schools. Students who reported meeting with a CAC adviser were more likely to complete intermediate college preparation tasks than those who did not meet with an adviser. For more information, download the full report and report brief . Full report Full Report GreenLight_CAC_EASE_Final_Report_Greenlight_040219_508.pdf GreenLight_Rr1034_2019_03_22_CNCS_Report_Brief_CAC_Revisions_040419_508.pdf Further information Program/Intervention College Advising Corps @ Boston University (CAC) Implementing Organization College Advising Corps Intermediary(s) GreenLight Fund AmeriCorps Program(s) Social Innovation Fund Age(s) Studied 18-25 (Young adult) Study Type(s) Impact Implementation Study Design(s) Experimental (RCT) Level of Evidence Moderate Researcher/Evaluator Evaluation and Assessment Solutions for Education, LLC Published Year 2019 Study Site Location (State) Massachusetts Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/evidence-exchange/GreenLight-Fund---College-Advising-Corps-%40-Boston-University",
    "https://www.nationalservice.gov/sites/default/files/evidenceexchange/GreenLight_CAC_EASE_Final_Report_Greenlight_040219_508.pdf",
    "https://www.nationalservice.gov/sites/default/files/evidenceexchange/GreenLight_Rr1034_2019_03_22_CNCS_Report_Brief_CAC_Revisions_040419_508.pdf",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/evidenceexchange/GreenLight_CAC_EASE_Final_Report_Greenlight_040219_508_1.pdf",
    "https://americorps.gov/sites/default/files/evidenceexchange/GreenLight_Rr1034_2019_03_22_CNCS_Report_Brief_CAC_Revisions_040419_508_1.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "Social Innovation Fund",
  "focus_population": [],
  "ages_studied": [
    "18-25 (Young adult)"
  ],
  "resource_type": "evidence-exchange",
  "topic": "",
  "year": "",
  "domain": "evidence-exchange"
}