{
  "id": "americorpsgov_blogs_2023_02_23_black_voices_servicehtml",
  "url": "https://americorps.gov/blogs/2023-02-23/black-voices-service",
  "title": "black-voices-service",
  "content": "Black Voices of Service | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Black Voices of Service Submitted by rfrazier on Wed, 02/22/2023 - 11:10 Feb 23, 2023 AmeriCorps Staff Black History Month is the national celebration of the significant contributions of Black Americans to the ongoing story of America. From the fight for social equity, LGBTQI+ rights to climate justice, Black voices have long been at the forefront of progress in American history. At AmeriCorps, it’s no different. From tackling food security, systemic inequality to closing the gaps in our education and public systems, Black AmeriCorps members, AmeriCorps Senior volunteers, staff, and alumni have helped build a foundation for getting things done in communities across the country. Meet Amilia, an AmeriCorps member whose service in the VISTA program uniquely combines giving back and sports. Through her service as a rowing coach, she builds relationships with youth and in turn makes the sport more equitable for people of color. “Representation in a sport means everything for a kid. They think to themselves, ‘I can do this’,” said Amilia. By dedicating her time to her community, she is not only lifting up younger generations but serving as a role model. AmeriCorps member Amilia coaching crew. Another alumna, Portia served with AmeriCorps NCCC in the Southern Region. During her service, she rebuilt homes and schools after Hurricane Katrina, tutored youth in after school programs, and removed invasive species in Florida. \"This Black History Month, we should discuss better ways to celebrate, re-discover, and relearn people who have been overlooked. The US government first recognized Black History Month in 1976, but in 2023, what does it mean for a new generation, and how can it be connected to where we are now?\" Portia leveraged her service to start her career at AmeriCorps where she continues to build up communities today. AmeriCorps Alumna Portia and her AmeriCorps NCCC team. Grandpa JC is an AmeriCorps Senior Foster Grandparent and AmeriCorps Uniter , who has served for more than two decades with the Boys & Girls Clubs of Fresno County. At 93 years old, Grandpa JC lived through life-changing racism and segregation. While schools and jobs were limited for him, he found ways to give back, helping more than 100 children, and troubled young adults from underserved communities find their purpose through love and support. “I joined with the belief that every child deserves a chance for a better life. I understood what a difficult childhood was like. Some kids are from nothing, and we'll lose them if you don’t win them. Everybody deserves to be loved no matter where they come from.\" AmeriCorps Senior volunteer Grandpa JC and few of his foster grandkids. At AmeriCorps, the commitment to serve others is owned by every member of the team, including AmeriCorps CEO Michael D. Smith. After joining the agency in December 2021 , he hit the ground running: touring service projects across the country, speaking to local community leaders to better understand how national service can address local challenges, and serving alongside AmeriCorps members and AmeriCorps Senior volunteers. CEO Smith is committed to making national service more accessible to people from all walks of life. “It was at my Boys & Girls Club Family Center that I first met AmeriCorps members, along with all kinds of volunteers. My young mom was looking for affordable daycare options and found a community rich in love, kindness, and care. Volunteers took us camping, taught us about Black pride and social justice, and they gave us the opportunity to serve and care for our community when we were still little kids. I look forward to continuing to celebrate Black history, culture and joy this month and all year long, while we continue to do the work of reducing barriers and expanding opportunity to make service possible for all.” AmeriCorps CEO and AmeriCorps members serving with City Year. From the highest levels of AmeriCorps to members, volunteers, staff, and alumni, Black voices of service are at work across the nation. They serve for the betterment of our country and are pillars in our communities. As we celebrate the American history that is Black history, let’s continue to amplify the voices that continue to bring out the best of America. Together, we can help build more equitable, just communities that foster racial equity, expand opportunity, build bridges across divides and create lasting impact for our neighbors. Learn more about how you can join in the work at AmeriCorps.gov/Serve . Previous Fight Hunger During National Canned Food Month Next AmeriCorps Unites in Celebration: AmeriCorps Week 2023 Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-02-23/black-voices-service",
    "https://americorps.gov/serve/americorps/americorps-vista",
    "https://americorps.gov/serve/americorps/americorps-nccc",
    "https://americorps.gov/serve/americorps-seniors/americorps-seniors-foster-grandparent-program",
    "https://americorps.gov/about/what-we-do/united-we-serve",
    "https://americorps.gov/newsroom/press-release/senate-confirms-michael-smith-new-americorps-ceo",
    "https://americorps.gov/serve",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-02-23/black-voices-service&amp;title=Black Voices of Service ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-02-23/black-voices-service&amp;title=Black Voices of Service &amp;source=https://americorps.gov/blogs/2023-02-23/black-voices-service",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-02-23/black-voices-service&amp;url=https://americorps.gov/blogs/2023-02-23/black-voices-service&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-02-15/fight-hunger-during-national-canned-food-month",
    "https://americorps.gov/blogs/2023-03-03/americorps-unites-celebration-americorps-week-2023",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "02",
  "subdomain_3": "23"
}