{
  "id": "americorpsgov_blogs_2024_02_29_americorps_30_supporting_healthy_futures_west_virginian_children_familieshtml",
  "url": "https://americorps.gov/blogs/2024-02-29/americorps-30-supporting-healthy-futures-west-virginian-children-families",
  "title": "americorps-30-supporting-healthy-futures-west-virginian-children-families",
  "content": "AmeriCorps 30: Supporting Healthy Futures for West Virginian Children and Families | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps 30: Supporting Healthy Futures for West Virginian Children and Families Submitted by dsong on Wed, 02/28/2024 - 18:30 Feb 29, 2024 Step by Step West Virginia In 1988, a 13-year-old's story of surviving and escaping sexual abuse inspired the establishment of Step by Step, a writing group of youth in foster care. The organization did everything to spread stories like these to the world and develop peer support systems. For more than 35 years, Step by Step has continued to grow from the stories and needs of our communities, working to bring stories as witnesses to the world and creating opportunities for people to support each other and meet challenges during times of need. AmeriCorps members organizing a family literacy event as part of a community health fair Step by Step has grown into a multi-county nonprofit that stands with West Virginia's most challenged families in rural and urban areas. The organization supports West Virginian children's dreams and growth from birth to independent adulthood through community education, community and family resource centers, and particular initiatives in mentoring, family literacy, and food security. The creativity and groundbreaking service of national service members have been critical to the healthy futures Step by Step has created in West Virginia communities for more than three decades. National service expands healthy futures Step by Step is powered by national service, built into what it is today by AmeriCorps VISTA. In 1995, the first AmeriCorps member who had slept on the Step by Step director’s floor while serving as a spring break volunteer for three years returned to support the organization again, and in 2002, Step by Step received its first direct grant for 20 AmeriCorps members. Since then, AmeriCorps members have served more than 400 full-time and 300 summer terms and developed pilot frameworks that led to the creation of two AmeriCorps programs – a family literacy program and a mentoring initiative, Strength Corps. AmeriCorps VISTA has been instrumental in the grant development research and program piloting that has helped Step by Step grow into a $3.2 million multi-county regional effort to help keep families together. AmeriCorps members serving at a holiday dinner organized to inform the community about new services National service has empowered Step by Step to design and implement the frameworks to create programs that support children from birth through high school graduation and create spaces such as after-school programs, community centers, summer programs, and parent and youth leadership and jobs training. Step by Step developed the first AmeriCorps VISTA programs in West Virginia, engaging veterans, recruiting addicts in recovery to address substance use disorder, and building support networks among the growing numbers of those providing foster and kinship care. Today, Step by Step is at the epicenter of the opioid epidemic in the Appalachian Region, serving at sites where 80% of the children do not live with their biological parents, and many lost additional caregivers during the COVID-19 pandemic. AmeriCorps VISTA was a vital solution to a landmark mentoring program focused on the 40 students most at risk for dropping out. After partnering with middle and senior high schools and committing to follow these students from seventh grade through graduation, more than 92% graduated on time in the first two graduating classes of those cohorts. The few who couldn't graduate for economic reasons received their GEDs. AmeriCorps members supporting a community-planned field trip from Big Ugly Creek to Thurmond, West Virginia Transforming the lives of West Virginians Every day, AmeriCorps members serving with Step by Step make a difference in their community and ensure every family has the opportunity to create a healthy future. They helped the organization receive more grants to support more than 18 service sites today, made the first connections for summer and school year feeding programs, and helped raise an average of $1.5 million in funding for Step by Step and partner organizations. For AmeriCorps members, Step by Step is an opportunity for them to transform their communities and make a difference in their lives, too. Tami, right, serving at a toddler preschool group \"I joined AmeriCorps because I wanted to bring some of the programs and resources we needed into my community. Even when I was growing up, there weren't many things we could do unless we had money. Like I tell my kids, when school let out to when school started, you never went out of the holler,\" said AmeriCorps alum and current Step by Step AmeriCorps VISTA supervisor Tami . \"During my AmeriCorps VISTA service, I was most proud of starting the after-school programs in the area and getting with the families on a more personal level. We had nothing like that before. Five families could become one bigger family to make a difference in our community. And when our schools were shut down at the start of the pandemic, I first asked our Step by Step director, 'Can we still feed the kids?' The following Monday after the shutdown, we were on the road, delivering food, hygiene products, and learning packets to help fight the isolation and the fear. Our VISTA teams helped create the materials and document community needs, and that led to more than $60,000 in emergency funds to cover families until the schools and funders caught up to figure out how they could support at-home services.\" Dana during her AmeriCorps VISTA service \"I liked the idea of service. I felt it was a great idea for everyone to serve. I wanted to see a different part of the country, and the best way to do that was to live there,\" said AmeriCorps alum Dana. \"I had graduated with my master's and was interested in the nonprofit world. AmeriCorps VISTA was a great opportunity to learn, and it became my career. AmeriCorps VISTA's mission of getting at the root cause of poverty stuck with me, and I worked with dozens of nonprofits. Working with the kids was the best experience, pulling together community events and seeing first-hand how kids could grow in a year—seeing what my service meant to them and how proud they were of what they accomplished. One of my fonder memories was our students working with artists and playing dulcimer at the Vandalia Festival, a statewide stage that lets them be seen in a high-profile venue. We also worked with artists to create an oral history project, culminating years of work to document local culture. We got photos from dozens of people in communities and made quilt blocks, resulting in a multi-media 200-page book that ended up in libraries across the state. The kids were embarrassed by what they saw as 'old-fashioned,' but seeing their community celebrated helped them recognize what a special gift they had in that connection with their elders and their heritage.\" Celebrating the commitment of AmeriCorps members Programs like Step by Step are essential to our nation. From hosting that first AmeriCorps member at the Big Ugly Community Center, Step by Step has integrated AmeriCorps VISTA, State and National, and NCCC programs to expand service opportunities and meet West Virginia’s needs. In AmeriCorps' return -on- investment study , programs like Step by Step support Americans' healthy future, help increase national service members' wages and educational attainment, increase tax revenue and programmatic savings, improve community health, and maximize community resources. More than 66,000 AmeriCorps members and AmeriCorps Seniors volunteers commit to improving the physical and mental well-being of all Americans. Join us in recognizing their dedication to service during AmeriCorps' 30th anniversary . Previous AmeriCorps 30: A Healthy Future for All Detroiters Next Celebrate National Service Members of the World During AmeriCorps Week Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2024-02-29/americorps-30-supporting-healthy-futures-west-virginian-children-families",
    "https://americorps.gov/sites/default/files/document/ROI%20Healthy%20Futures_01302024_final_508.pdf",
    "https://socialpresskit.com/americorps30",
    "http://americorps.gov/americorps30",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2024-02-29/americorps-30-supporting-healthy-futures-west-virginian-children-families&amp;title=AmeriCorps 30: Supporting Healthy Futures for West Virginian Children and Families",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2024-02-29/americorps-30-supporting-healthy-futures-west-virginian-children-families&amp;title=AmeriCorps 30: Supporting Healthy Futures for West Virginian Children and Families&amp;source=https://americorps.gov/blogs/2024-02-29/americorps-30-supporting-healthy-futures-west-virginian-children-families",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2024-02-29/americorps-30-supporting-healthy-futures-west-virginian-children-families&amp;url=https://americorps.gov/blogs/2024-02-29/americorps-30-supporting-healthy-futures-west-virginian-children-families&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2024-02-22/americorps-30-healthy-future-all-detroiters",
    "https://americorps.gov/blogs/2024-03-08/celebrate-national-service-members-world-during-americorps-week",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA; AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2024",
  "subdomain_2": "02",
  "subdomain_3": "29"
}