{
  "id": "americorpsgov_blogs_2022_09_26_united_we_serve_how_national_service_unites_americanshtml",
  "url": "https://americorps.gov/blogs/2022-09-26/united-we-serve-how-national-service-unites-americans",
  "title": "united-we-serve-how-national-service-unites-americans",
  "content": "United We Serve: How National Service Unites Americans | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb United We Serve: How National Service Unites Americans Submitted by dsong on Mon, 09/26/2022 - 16:47 Sep 26, 2022 AmeriCorps staff The past few years were difficult. The global pandemic and events of 2020 and 2021 emphasized the inequity in our world. Communities from San Jose to Chicago, Charleston, Pittsburgh, El Paso, Atlanta, Buffalo, and beyond are still healing from hateful attacks. Americans are looking to rebuild and break down barriers that lead to such tragedy. In response, the White House hosted the United We Stand summit with President Biden calling upon Americans to unite through national service and volunteerism to counter the corrosive effects of hate-fueled violence on our democracy and public safety. AmeriCorps CEO Michael D. Smith announced the agency’s commitment to grow national service efforts. He also shared how AmeriCorps members and AmeriCorps Seniors volunteers are “uniters” —proving every day that service can unite people regardless of race, religion, or background. Meet four such national service members and learn more about their work to bring communities together to solve local challenges. Turning tragedy to opportunity In Oxford, Mich., on November 30, 2021, a school shooting killed four students and injured seven others. Buck and Sheri Myre struggled to make sense of how to move forward after losing their son Tate in the attack. Through their grief, they came to realize that if the young man who pulled the trigger had a sense of belonging, perhaps their son and the other students would still be alive. The Myre family created 42 Strong , a mentoring program that matches older students as mentors to younger students in the Oxford community, with a mission to create a better future by helping students develop a sense of purpose, community, and resilience. The program is designed around 12 characteristics that symbolized Tate's life – trust, care, fun, positivity, teachable, humility, confidence, selflessness, hard work, respect, accountability, and loyalty. Today, 42 Strong has helped more than 200 students. Three decades of giving back Senior advisor to AmeriCorps NCCC Sueko Kumagai has served others since 1992. She was in the inaugural class of Peace Corps volunteers in Republic of Armenia. During her service, Sueko worked with local teachers at the State Medical Institute to develop new curricula and teaching materials; teach medical courses in English to students, graduate researchers, and professors; and collaborate with the Medical Student Association to develop an HIV/AIDS awareness program for high school students. Sueko, fourth from left, with Armenian teachers Sueko stayed in Armenia after completing her Peace Corps service with the USIA-funded Freedom Support Youth Exchange program to prepare Armenian high school students to study in America. She continued her commitment to national service at the Peace Corps in the Office of Volunteer Recruitment and Selection before becoming a desk officer in the Eastern Europe, Mediterranean, and Asia Region. Sueko joined AmeriCorps in 2001, and in 2019 she became a senior advisor to the AmeriCorps NCCC program, leading strategic and operational projects. Her leadership has helped pave the way for many others to participate in national service. Passion leads to lifelong commitment Martin Cominsky has lived a life of service for 40 years. The president and CEO of Interfaith Ministries for Greater Houston , Martin has an unwavering passion for helping people. Martin in the center with AmeriCorps members serving in Houston In his 17 years as regional director of the Anti-Defamation League, Martin led efforts to unite more than 400 schools to foster respect and challenge bullying behavior through lessons of respect and acceptance He helped 1,500+ Afghan allies and their families adapt to their lives in Houston. After a mass shooting in a nearby community, Martin worked with other community members to host vigils and unite people in prayer and reflection. Martin continues to encourage the next generation to serve. Paving the way through service Patrice became a ward of the court at the age of 15. Her mother struggled with mental health issues and her father fought drug addiction. Despite her difficult childhood, Patrice continued her education. In 1987, she became one of three Black women to earn an electrical engineering degree from the University of Detroit. She earned her MBA – the only female in the program – in 2002. This experience motivated her to join national service and help other Black girls and women become a part of the skilled trades. Patrice joined AmeriCorps VISTA in Michigan and served as a member and then as a VISTA leader before she was appointed program coordinator of the state-wide AmeriCorps VISTA program in Michigan. With Patrice at the helm, recruitment of full-time and summer associate members from diverse backgrounds increased by more than 50 percent, and in some years, the program saw a75 percent growth. Her leadership has opened doors for countless national service members. Patrice is a role model to others, and she continues to transform lives. Answer the call to serve These leaders are doing extraordinary work in their communities to stand together against hate, build bridges, and heal divides. They are proof that service can unite people regardless of race, religion, or background. If you are a uniter or know someone with an incredible story of giving back, share your story with us . AmeriCorps has always been a force multiplier. We bring people together across divides and we help bring communities back stronger for a more united America. Join with us to foster a sense of constructive action, civic participation, and belonging. Join United We Serve Previous From Mentee to Mentor: How AmeriCorps Inspired Me Next Americans Unite in Service on 9/11 Day Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2022-09-26/united-we-serve-how-national-service-unites-americans",
    "https://americorps.gov/newsroom/press-release/americorps-ceo-joins-white-house-united-we-stand-summit",
    "https://www.42strongtate.org/",
    "https://www.imgh.org/",
    "https://americorps.gov/newsroom/stories/share-your-service-story",
    "http://serve.gov/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2022-09-26/united-we-serve-how-national-service-unites-americans&amp;title=United We Serve: How National Service Unites Americans ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2022-09-26/united-we-serve-how-national-service-unites-americans&amp;title=United We Serve: How National Service Unites Americans &amp;source=https://americorps.gov/blogs/2022-09-26/united-we-serve-how-national-service-unites-americans",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2022-09-26/united-we-serve-how-national-service-unites-americans&amp;url=https://americorps.gov/blogs/2022-09-26/united-we-serve-how-national-service-unites-americans&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2022-08-30/mentee-mentor-how-americorps-inspired-me",
    "https://americorps.gov/blogs/2022-10-07/americans-unite-service-911-day",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC; AmeriCorps VISTA; AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2022",
  "subdomain_2": "09",
  "subdomain_3": "26"
}