{
  "id": "americorpsgov_blogs_2023_06_16_father_child_passing_value_servicehtml",
  "url": "https://americorps.gov/blogs/2023-06-16/father-child-passing-value-service",
  "title": "father-child-passing-value-service",
  "content": "From Father to Child, Passing on the Value of Service | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb From Father to Child, Passing on the Value of Service Submitted by rfrazier on Fri, 06/16/2023 - 09:38 Jun 16, 2023 Nathaniel Benjamin AmeriCorps Chief Diversity and Inclusion Officer Nathaniel Benjamin shares his thoughts on national service ahead of the Juneteenth and Father’s Day weekend. As a Black American, I have celebrated Juneteenth most of my life. Despite President Lincoln’s Emancipation Proclamation, an executive order signed on January 1, 1863, slavery continued to exist in certain parts of the United States for more than two years. Not until June 19, 1865 in Galveston, Texas, with Major General Gordon Granger’s order to proclaim freedom for slaves in Texas, was slavery abolished. This day has been affectionally coined as “Juneteenth”, and for many individuals of African American culture, the celebration marks the true anniversary of Lincoln’s intent. Although Juneteenth's cultural relevance is well established in the African American community, until President Biden signed the Juneteenth National Independence Day Act into law in 2021, the public did not widely acknowledge this historic day. As a Black father raising children in a vastly different world than what I experienced, I value sharing with my son and daughter the accomplishments of African Americans in history and their impact on the modern world. Through legislation, innovation, science, and more – many of our culture’s forepersons did not have equitable starting points as their counterparts but excelled despite their lack of access to many resources. One of the most valuable lessons in Black history that I impart to my children is that service and volunteerism is the heartbeat to success. From a young age, my children experienced the power of service as they watched us volunteer to feed those struggling with homelessness at local DC shelters. They also witnessed my work in the Dominican Republic, organizing medical clinics and shoe donation stations. It wasn’t until months later when my kids handed me all of their shoes and said they wanted to donate them to children abroad that I realized they carried the spirit of service by virtue of example. They now seek out opportunities locally to support those in need. Their giving spirit gives me hope for the future and the world they will shape. Nathaniel with his family. Being the first executive leader for diversity at AmeriCorps, I have the pleasure of seeing some of AmeriCorps’ remarkable work with Black communities. Currently, AmeriCorps partners with the White House’s Initiative for Historically Black Colleges and Universities to provide service opportunities through AmeriCorps VISTA sponsored projects. We also raise awareness of our current funding opportunities and build partnerships through our Schools of National Service program . During my short tenure, AmeriCorps and our national service network, has consistently stepped up to improve access to service opportunities, expand community resources to support more underserved people, and promoted inclusiveness through service. I am proud to be part of the AmeriCorps community and eager to lend my experience to lift up more Black voices and experiences. Significant progress has been made since Major Gen. Granger’s order, but Black communities still face many challenges. Like my predecessors, I remain optimistic about the future despite these challenges. Through national service, we can effect lasting change and strengthen communities across the country. As we celebrate Juneteenth, I encourage everyone to step up and choose their own way to give back. Whether that’s volunteering with your local church in a community clean up or uniting with your neighbors to feed the homeless, it’s on all of us to lift each other up and invest in our shared future. Learn more about how Black Americans choose to make a difference with AmeriCorps , and head to AmeriCorps.gov/Serve to find out how you can help your community. Previous From Conservation to Education, AmeriCorps Members Make a Difference for Animals and People Next Great Outdoors Month Celebrated Across the Nation Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-06-16/father-child-passing-value-service",
    "https://americorps.gov/serve/americorps/americorps-vista",
    "https://americorps.gov/partner/partnerships/schools-national-service",
    "https://americorps.gov/blogs/2023-02-23/black-voices-service",
    "http://americorps.gov/Serve",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-06-16/father-child-passing-value-service&amp;title=From Father to Child, Passing on the Value of Service",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-06-16/father-child-passing-value-service&amp;title=From Father to Child, Passing on the Value of Service&amp;source=https://americorps.gov/blogs/2023-06-16/father-child-passing-value-service",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-06-16/father-child-passing-value-service&amp;url=https://americorps.gov/blogs/2023-06-16/father-child-passing-value-service&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-06-08/conservation-education-americorps-members-make-difference-animals-people",
    "https://americorps.gov/blogs/2023-06-29/great-outdoors-month-celebrated-across-nation",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA",
  "focus_population": [
    "Schools"
  ],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "06",
  "subdomain_3": "16"
}