{
  "id": "americorpsgov_blogs_2024_01_12_five_things_know_about_public_service_loan_forgivenesshtml",
  "url": "https://americorps.gov/blogs/2024-01-12/five-things-know-about-public-service-loan-forgiveness",
  "title": "five-things-know-about-public-service-loan-forgiveness",
  "content": "Five Things to Know About Public Service Loan Forgiveness | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Five Things to Know About Public Service Loan Forgiveness Submitted by dsong on Fri, 01/12/2024 - 16:18 Jan 12, 2024 Terra Wallin AmeriCorps expanded learning partnerships fellow Terra Wallin shares five tips to remember when applying for Public Service Loan Forgiveness. As we start the new year, now’s the time to assess individual financial circumstances and prepare for the year ahead. For millions of Americans, that means taking stock of any federal student loans they may have and identifying potential ways to decrease payments or have their loans forgiven. Public Service Loan Forgiveness is the most common way people apply to have their student loans forgiven. Current AmeriCorps members and those who served in 2007 or later may have the opportunity to have their loans forgiven, as their service can count toward the ten years of public service needed to receive PSLF. The PSLF program forgives the remaining balance on federal Direct Loans after you’ve made the equivalent of 120 qualifying monthly payments under an accepted repayment plan and while working full-time for an eligible employer , including government and nonprofit organizations. For purposes of PSLF, AmeriCorps is considered an eligible employer, and your time with AmeriCorps State and National programs, VISTA, and NCCC may count towards PSLF. Under President Biden , nearly 750,000 borrowers have had $53.5 billion forgiven under the PSLF, and you may also qualify. Apply these five tips to start the new year with one less worry. 1. It’s not too late to get your service certified. AmeriCorps alums who served after the PSLF program began in 2007 may be able to count their service towards PSLF. Submit a PSLF form for those periods, track your progress, and apply for forgiveness after 10 years of employment in public service. Federal Student Aid recommends submitting the PSLF form annually or when you change employers. To have your service as an AmeriCorps member counted, submit a digital form via the new PSLF Help Tool or a manual PSLF form. This is where the organization you served with certifies that you served “full-time” for the period indicated on the form. If you served with AmeriCorps VISTA or NCCC, please direct your employer certification form to the AmeriCorps hotline . If you served with an AmeriCorps State and National, your service can be certified by an authorized official who has access to your service records and can certify your service. This will often be someone in the human resources department, though in some cases, your direct supervisor or another individual may be authorized to certify your employment. Check with your organization to see who is allowed to certify your PSLF form. 2. The definition of “full-time” varies between AmeriCorps and PSLF. For PSLF, full-time employment is working for a qualifying employer(s) for a weekly average, alone or when combined, equal to at least 30 hours: during the period of being certified; throughout a contractual or employment period of at least eight months in a year, such as elementary and secondary school teachers, in which case the borrower is deemed to have worked full-time for the entire year; or determined by multiplying each credit or contact hour taught per week by at least 3.35 in non-tenure track employment at an institution of higher education. Although AmeriCorps State and National only considers members that serve 1,700 hours per year as “full-time,” other members may still be eligible for PSLF if: you serve for at least 30 hours during the period being certified, which could be less than one year; or you are working for another qualifying employer during your service period, and your total weekly average is 30 hours across AmeriCorps and other employer(s). It’s important to note that you do not have to work for qualifying employers for 10 consecutive years to be eligible for PSLF. 3. Think about which repayment plan is best for you. For current and potential AmeriCorps members, consider whether loan deferment, forbearance, or making payments on an income-driven is your best option. If you’re in a short-term financial bind, you may qualify for a deferment or a forbearance. With either of these options, you can temporarily suspend your payments. But keep in mind that forbearance and deferment have pros and cons. When it comes to deferment and forbearance, there are two important things to consider: In most cases, interest will accrue during your period of deferment or forbearance. This means your balance will increase, and you’ll pay more over the life of your loan. After you complete your service with AmeriCorps, you can request the AmeriCorps office of the National Service Trust to pay off the interest that accrued during your year of service. Since these payments are considered income, you will have to pay taxes on the interest paid by the Trust. If you’re pursuing loan forgiveness, including through PSLF, any period of deferment or forbearance may not count toward your forgiveness requirements. This means you’ll stop making progress toward forgiveness until you resume repayment. Federal Student Aid provides helpful information about how to handle your loans during your service period. How to leverage AmeriCorps’ education award: If you receive a deferment or forbearance during your service, you can use the Segal Education Award you receive after completing your AmeriCorps service to make a lump-sum payment on your Direct Loans. If you use some or all of your award to make a lump-sum payment, you’ll receive credit for up to 12 qualifying payments for PSLF. The number of payments for which you receive credit is determined by dividing the amount of your lump-sum payment by your scheduled full monthly payment amount. But note that you may not receive credit for more than 12 qualifying monthly payments. This benefit is available to you only once for AmeriCorps service. You can also choose to make qualifying PSLF payments during your service. If you repay your Direct Loans under an income-driven plan, your required monthly payment will likely be an amount you can afford even while serving and receiving lesser income. For some borrowers, the required monthly payment amount under one of these repayment plans may be $0. If you choose instead to make payments under an income-driven plan during your service, you could receive credit for a larger number of qualifying PSLF payments than the previous option. This is because you can receive credit for a maximum of only 12 qualifying payments if you make the lump-sum payment, but each payment you make under the income-driven plan, including a scheduled payment amount of $0, while you are serving as a full-time AmeriCorps member counts as a qualifying PSLF payment if it meets all of the other PSLF requirements. 4. Take note of when you acquired your loans. Unfortunately, you cannot count time with an eligible employer, including AmeriCorps, towards PSLF if you took out loans after your service or employment with that employer. For example, someone who completed all or a portion of their undergraduate education with no eligible federal student loans, then served with AmeriCorps, and then received federal Direct Loans for graduate school cannot count their service with AmeriCorps towards PSLF for their graduate student loans. 5. Ask if you need help. Several factors can impact your eligibility for PSLF, including whether you have worked for a qualifying employer(s), the types of loans you took out, whether you utilized loan deferment or forbearance during your service, and the repayment plan you are utilizing. We encourage you to reach out to FSA if you have any questions or want to learn more about your options. If you have additional questions about your service as an AmeriCorps member or your Segal Education Award, we encourage you to contact the AmeriCorps hotline by phone, chat, or web form. Get planning for 2024 As you look ahead, start your PSLF planning with information from AmeriCorps’ Public Service Loan Forgiveness: A Primer for AmeriCorps Members and Grantees webinar . Hear an overview of the recent changes to the program, repayment plan options, and special considerations for AmeriCorps members from the US Department of Education officials. Previous Thank You, Mentors Next Remembering Dr. King through Service Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2024-01-12/five-things-know-about-public-service-loan-forgiveness",
    "https://studentaid.gov/manage-loans/forgiveness-cancellation/public-service",
    "https://studentaid.gov/manage-loans/forgiveness-cancellation/public-service#qualifying-repayment-plans",
    "https://studentaid.gov/manage-loans/forgiveness-cancellation/public-service#qualifying-employment",
    "https://www.ed.gov/news/press-releases/biden-harris-administration-announces-nearly-5-billion-additional-student-debt-relief",
    "https://studentaid.gov/manage-loans/forgiveness-cancellation/public-service/public-service-loan-forgiveness-application",
    "https://studentaid.gov/pslf/",
    "https://americorps.gov/contact",
    "https://studentaid.gov/help-center/answers/article/pslf-credit-during-volunteer-service-period",
    "https://americorps.gov/members-volunteers/segal-americorps-education-award",
    "https://studentaid.gov/help-center/answers/landing",
    "https://gcc02.safelinks.protection.outlook.com/?url=https%3A%2F%2Famericorps.gov%2Fcontact&amp;data=05%7C01%7CTWallin%40cns.gov%7C3d75e8a801484a5a662208dbc10795fd%7Cd2f850a78dce4fb3a79c6867f9514312%7C0%7C0%7C638316010563797554%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&amp;sdata=8o4jG2d8qIIEm6DlYUTSkXif2FLSSisZ%2B7VtFQKyiXw%3D&amp;reserved=0",
    "https://gcc02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DqIlvbDHQptQ&amp;data=05%7C01%7CTWallin%40cns.gov%7C3d75e8a801484a5a662208dbc10795fd%7Cd2f850a78dce4fb3a79c6867f9514312%7C0%7C0%7C638316010563797554%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&amp;sdata=3mUHXWaYcZ6NbdopdNUc%2F8Bwgb1MI%2Bvt8EwFxk%2FHOiw%3D&amp;reserved=0",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2024-01-12/five-things-know-about-public-service-loan-forgiveness&amp;title=Five Things to Know About Public Service Loan Forgiveness",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2024-01-12/five-things-know-about-public-service-loan-forgiveness&amp;title=Five Things to Know About Public Service Loan Forgiveness&amp;source=https://americorps.gov/blogs/2024-01-12/five-things-know-about-public-service-loan-forgiveness",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2024-01-12/five-things-know-about-public-service-loan-forgiveness&amp;url=https://americorps.gov/blogs/2024-01-12/five-things-know-about-public-service-loan-forgiveness&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2024-01-09/thank-you-mentors",
    "https://americorps.gov/blogs/2024-01-15/remembering-dr-king-through-service",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps State and National; AmeriCorps VISTA",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2024",
  "subdomain_2": "01",
  "subdomain_3": "12"
}