{
  "id": "americorpsgov_blogs_2023_09_12_remembering_our_beginnings_thank_you_letterhtml",
  "url": "https://americorps.gov/blogs/2023-09-12/remembering-our-beginnings-thank-you-letter",
  "title": "remembering-our-beginnings-thank-you-letter",
  "content": "Remembering Our Beginnings: A Thank You Letter | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Remembering Our Beginnings: A Thank You Letter Submitted by dsong on Tue, 09/12/2023 - 09:40 Sep 12, 2023 AmeriCorps Staff Dear AmeriCorps members, AmeriCorps Seniors volunteers, alumni, grantees, and partners, As we gear up to celebrate AmeriCorps’ 30th anniversary on September 21, we are coming across another important milestone: the 29th anniversary of the first class of AmeriCorps members. When 20,000 Americans first took the AmeriCorps pledge on Sept. 12, 1994, they set off a spark – marking not a moment in time, but a movement that would span generations. Today, more than 1.25 million alumni have followed in their footsteps, and they are echoed by millions more AmeriCorps Seniors volunteers. And this year, we want to celebrate you. We want to celebrate the AmeriCorps members who continue to answer the call to respond to disasters, from Hurricane Katrina to the attacks on September 11th, and ongoing threats from climate change. Like America’s young adults serving in AmeriCorps NCCC who have assisted more than 20.6 million people in disaster areas and protected more than 1.6 million acres of land through firefighting and fire management since 2000. When the COVID-19 pandemic hit and students scrambled to continue their studies, our AmeriCorps Seniors volunteers were a pillar of support. These older adults quickly learned new digital skills to continue tutoring and mentoring our students virtually . You have been there with us every step of the way, helping AmeriCorps evolve and transform lives. Like AmeriCorps alumna Shani who was an incarcerated youth but leveraged her struggles to help youth with difficult life experiences create a better path through service. While some of our programs predate the agency itself, like Foster Grandparents, RSVP, and VISTA, we celebrate AmeriCorps’ 30th anniversary in September 2023 to mark the signing of the legislation that established our agency. This anniversary celebration is about honoring our roots. It’s also celebrating the work you are doing, each and every day, to build a strong present and the future for the agency. Your dedication and commitment to service is the lifeblood of our schools and shelters, hospitals and hotlines, and civic, nonprofit, and faith-based organizations across the country. Thank you for your service, for recruiting others to serve, and for creating service experiences that transform lives. Join us as we celebrate 30 years of AmeriCorps from September 2023 until September 2024. We hope you make a plan to honor AmeriCorps’ milestone moments – and your organizations’ moments too! – as we demonstrate the strength of the national service movement in our country. Share your story , your success, and the path AmeriCorps helped you pave. Join our celebratory #AmeriCorps30 Social Media Storm on Thursday, Sept. 21, 2023. We look forward to continuing our commitment to service and proving that AmeriCorps is not just a moment in our history but a movement to bring out the best of America. Sincerely, AmeriCorps Previous Choosing to Love: 9/11 Day Victims Serve to Honor Their Loved Ones Next America Unites on 9/11 Day of Service Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-09-12/remembering-our-beginnings-thank-you-letter",
    "https://americorps.gov/blogs/2023-03-13/americorps-unites-celebration-young-adults-become-nations-changemakers",
    "https://m.facebook.com/watch/?v=952660745725651&amp;paipv=0&amp;eav=AfaVGt_RFTSSx4_9nyuEkBaVgE2j33GOcCoEqQ5ZvOZtaGM2M5oJT9lMBqVnKEvgrr0&amp;_rdr",
    "https://americorps.gov/blogs/2022-07-08/how-americorps-service-put-me-path-jail-harvard-graduate-school",
    "https://socialpresskit.com/americorps30",
    "https://americorps.gov/shareyourstory",
    "https://socialpresskit.com/americorps30#americorps-30th-anniversary--social-media-shareables",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-09-12/remembering-our-beginnings-thank-you-letter&amp;title=Remembering Our Beginnings: A Thank You Letter",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-09-12/remembering-our-beginnings-thank-you-letter&amp;title=Remembering Our Beginnings: A Thank You Letter&amp;source=https://americorps.gov/blogs/2023-09-12/remembering-our-beginnings-thank-you-letter",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-09-12/remembering-our-beginnings-thank-you-letter&amp;url=https://americorps.gov/blogs/2023-09-12/remembering-our-beginnings-thank-you-letter&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-09-07/choosing-love-911-day-victims-serve-honor-their-loved-ones",
    "https://americorps.gov/blogs/2023-09-15/america-unites-911-day-service",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC; AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "09",
  "subdomain_3": "12"
}