{
  "id": "americorpsgov_blogs_2022_04_29_month_military_child_service_takes_many_formshtml",
  "url": "https://americorps.gov/blogs/2022-04-29/month-military-child-service-takes-many-forms",
  "title": "month-military-child-service-takes-many-forms",
  "content": "Month of the Military Child: Service Takes Many Forms | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Month of the Military Child:  Service Takes Many Forms Submitted by dsong on Fri, 04/29/2022 - 12:53 Apr 29, 2022 AmeriCorps staff For some, service looks like civic engagement or wearing the AmeriCorps A to get things done.  For others, it looks like combat boots and military enlistment.  Across service programs, common threads connect one to another– strength, sacrifice, and unity. This April marks the 35th anniversary of the Month of the Military Child , recognizing military children who play their own critical role in service. Military children serve our nation A pilot holds his son at a unit sendoff in Windsor Locks, Conn. on April 25, 2021. HHC 1-169th departed Connecticut that day for deployment to Kosovo. Photo credited to U.S. Army Capt. David Pytlik The average military family moves every two years and the average military child attends 10 different schools by the time they graduate. These are strong, resilient children. Military childhood often means prolonged separation from a deployed parent and 39 percent of military families experience six or more months of family separation every 18 months. Military children are also a source of great unity. Military children understand what it means to sacrifice. Their children often are the next generation most likely to serve . On average, 30 percent of military children go on to serve in the military and nearly 15 percent join branches of the Department of Homeland Security, like the Air National Guard and Coast Guard. Programs for military families Linus Bradshaw, right, hands a Purple Up! shirt to Staff Sgt. Chris Hillard, a member of the 66th Air Base Group Chapel, during a Month of the Military Child event at Hanscom Air Force Base Mass., May 3, 2021. The Hanscom Torch Club held the fitness event in support of MOMC. Photo credited to U.S. Air Force, Todd Maki. National service programs have the dual honor of both serving our veterans and military families and serving beside them. As an AmeriCorps priority, we support programs that meet the needs of military families with mentorship programs, legal assistance, affordable housing, health care and counseling to honor the tremendous sacrifice made by the 18 million American service members and their families. AmeriCorps has programs geared toward serving military families: AmeriCorps Waynesville provides academic support and mentorship to students in the Waynesville, Saint Robert and Fort Leonard Wood communities in Missouri. More than seven out of 10 of the students supported are military-affiliated children whose parents predominately serve at Fort Leonard Wood ; a hub for high-deployment careers including chemical, biological, radiological, and nuclear specialists. Waynesville's educational enrichment program provides military children education, mental health, and nutrition support. They also minimize food insecurities, a common issue among young military families, through work with the Waynesville R-VI School District SIAP program. Tse Daa Kaan Chapter of the Navajo Nation connects Tribal veterans and military children to Tribal communities, cultural traditions, and quality of life resources. Tse Daa Kaan engages military families through a child abuse prevention partnership, a community housing and development division, and an AmeriCorps office tailored to veteran support. AmeriCorps members also engage volunteer veteran families to restore local rivers, fostering both a connection to their heritage and Tribal lands. Right-sized service Service comes in all shapes and sizes. Whether a four-year military tour or volunteering a couple of hours a week, you can find the right fit for your lifestyle. Military families build and continue family legacies of service that often start in local communities. Find your best fit. National service opportunities are available in every state and territory. No matter where in the US the military takes your family, there’s an opportunity for you. AmeriCorps VISTA’s summer opportunities allow young adults to participate in an existing AmeriCorps VISTA project for eight, nine, or 10 weeks during the summer. AmeriCorps NCCC is a full-time service program that covers lodging and travel expenses, allowing young adults to serve on a team and make an impact in communities across the country while gaining valuable leadership skills. Grow personally and professionally. Advance your personal and professional growth by exploring service projects in hundreds of career fields like public health or youth mentorship. From improved mental health to giving back, national service offers military families an opportunity to join established communities wherever the military takes them. Local volunteer opportunities can be found on AmeriCorps Search , powered by VolunteerMatch. Learn more about our veteran and military family programs . AmeriCorps programs assist more than 500,000 veterans and military families each year. AmeriCorps members provide academic tutoring to more than 3,700 K-12 military-affiliated students, lead clubs and after school activities, support supplemental feeding programs, recruit volunteers to support school activities, and foster partnerships that promote economic development. Thank you Military children – thank you. As President Biden wrote in his March 31 proclamation , “This month — and every month — we share our gratitude for these children. We recognize the hardships they face and commit to supporting the physical, social, and emotional health and safety of their families.” From spending birthdays, holidays, graduations, and other important milestones without a parent, to keeping our military resilient and strong, your service deserves our thanks and our recognition. Service members and families can find additional resources for family support and local organizations at MilitaryOneSource.Mil . Thumbnail image: A young girl stands next to her father after greeting him upon his return home from deployment June 1, 2021 at Homestead Air Reserve Base, Florida. Dozens of family members, friends, and base leadership gathered to welcome home the 482nd Fighter Wing Airmen who returned from their deployment to Southwest Asia. Photo credited to U.S. Air Force Tech Sgt. Allissa Landgraff. Previous Earth Day: A future filmmaker’s start with AmeriCorps Next Heroes Come from All Generations Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2022-04-29/month-military-child-service-takes-many-forms",
    "https://www.whitehouse.gov/briefing-room/presidential-actions/2022/03/31/a-proclamation-on-the-month-of-the-military-child-2022/",
    "https://www.militarytimes.com/pay-benefits/2020/02/26/military-families-crave-stability-and-more-time-together-survey-finds/",
    "https://www.nytimes.com/2020/01/10/us/military-enlistment.html",
    "https://www.waynesville.k12.mo.us/Page/6820",
    "https://home.army.mil/wood/index.php/about/mission",
    "https://www.cbsnews.com/news/military-families-food-insecurity/#:~:text=An%20estimated%20160%2C000%20military%20families,%E2%80%94%20almost%2030%25%20need%20help.",
    "https://tsedaakaan.navajochapters.org/",
    "https://americorps.gov/members-volunteers/vista/summer-associates",
    "https://americorps.gov/serve/fit-finder/americorps-nccc",
    "https://www.americorps.gov/join/find-volunteer-opportunity#/",
    "https://www.americorps.gov/about/what-we-do/veterans",
    "https://www.whitehouse.gov/briefing-room/presidential-actions/2022/03/31/a-proclamation-on-the-month-of-the-military-child-2022/#:~:text=Each%20April%2C%20the%20Month%20of,our%20service%20members%20and%20veterans.",
    "https://www.militaryonesource.mil/family-relationships/parenting-and-children/parenting-and-children-resources/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2022-04-29/month-military-child-service-takes-many-forms&amp;title=Month of the Military Child:  Service Takes Many Forms",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2022-04-29/month-military-child-service-takes-many-forms&amp;title=Month of the Military Child:  Service Takes Many Forms&amp;source=https://americorps.gov/blogs/2022-04-29/month-military-child-service-takes-many-forms",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2022-04-29/month-military-child-service-takes-many-forms&amp;url=https://americorps.gov/blogs/2022-04-29/month-military-child-service-takes-many-forms&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2022-04-22/earth-day-future-filmmakers-start-americorps",
    "https://americorps.gov/blogs/2022-05-13/heroes-come-all-generations",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC; AmeriCorps VISTA",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2022",
  "subdomain_2": "04",
  "subdomain_3": "29"
}