{
  "id": "americorpsgov_blogs_2024_06_17_americorps_30_my_pathway_service_higher_educationhtml",
  "url": "https://americorps.gov/blogs/2024-06-17/americorps-30-my-pathway-service-higher-education",
  "title": "americorps-30-my-pathway-service-higher-education",
  "content": "AmeriCorps 30: My Pathway from Service to Higher Education | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps 30: My Pathway from Service to Higher Education Submitted by cdouglas on Mon, 06/17/2024 - 09:56 Jun 17, 2024 Daysha Jackson-Sanchez AmeriCorps alumna Daysha shares how her service journey transformed her life and paved a pathway to her career during AmeriCorps' 30th anniversary celebrations. As a first-generation college graduate, the road to a degree was an uphill journey. I began my pursuit of a Bachelor of Psychology as an undergraduate, but after encountering financial hardships and personal challenges, I left the campus and returned home. During my first few semesters, I faced a recurring issue–an outstanding housing balance that prevented me from registering for the next semester. Although my dad graciously paid off the balance for my first semester, I hesitated to ask him for more money when the problem came up again the following semester. Along with these financial struggles, I faced other personal difficulties that made continuing my education seem impossible at that time. Ultimately, after finishing my third semester, I decided to leave and return home until I could figure things out. Unable to afford college, I was determined to find a way forward, hoping to return eventually. As a single mom, I knew I needed to identify a way to ensure I created a better life for my son and me. Despite my determination to return to school and improve our lives, I was unsure how to make it happen. Following in my parents' footsteps, I initially found work in a factory but quickly realized it was not the right fit for me. It was through a temporary agency that I discovered an opportunity at the Girl Scouts, where I began doing data entry. Though I was confident about my future and determined to go back to school, I wasn’t sure how to make it happen. While this job provided a temporary solution, I could not shake the desire to return to school and finish my degree. Soon after starting at the Girl Scouts, the AmeriCorps program manager approached me about becoming a Promise Fellow. At first, I wasn't sure what this role entailed, but my interest grew as I learned more. Discovering AmeriCorps renewed my belief that achieving my degree was possible. Reflecting on it now, AmeriCorps gave me something priceless. National service provided me with more than just financial support; it also renewed my hope and gave me a clear path toward my goals. I’ve always been passionate about helping others and giving back to my community. AmeriCorps allowed me to pursue this passion while supporting my efforts to return to college and continue my education. As a Promise Fellow, I discovered a new passion: education. I served both inside and outside the classroom, teaching young girls essential life skills and discussing topics like bullying. I vividly recall leading Girl Scout meetings with elementary, middle, and high school students at just 19 years old, being addressed as Ms. Jackson, which initially felt uncomfortable being so young. However, I soon realized they saw me as a role model, and I saw reflections of myself in them. I cherished sharing my experiences and encouraging these young girls to stay focused on their future. My goal was to demonstrate that dedication and perseverance can lead to success and that setbacks and imperfect decisions do not define their futures. With determination, perseverance, and support from those around us, we can overcome adversity and achieve our dreams. After my time with AmeriCorps, I knew it was time to return to my education journey. AmeriCorps sparked my passion and prepared me to serve as a peer advisor while finishing my undergraduate degree. After graduation, I landed my first full-time job in higher education as an assistant director of admissions. This role marked the beginning of a 15-year full-time career in higher education, paving the way to my current position as Vice President of Equity Solutions at an education technology company. Now, my focus is on developing equitable products that improve student learning and promote fair outcomes. AmeriCorps played a crucial role in my education and career journey by providing the financial support I needed to continue my studies. At that time, I lacked the funds and didn't qualify for scholarships or grants, leaving me uncertain about how to pay for college. AmeriCorps not only eased this financial burden but also gave me the hope and resources to pursue my dreams. As a 17-year-old first-generation college student starting my journey as an adult, I felt lost. Despite my parents' support, they were unsure how to guide me through higher education. The AmeriCorps education award and invaluable hands-on experience were pivotal in helping me earn my degree and forge a fulfilling career path. Furthermore, my experiences at the Girl Scouts as an AmeriCorps Promise Fellow provided me with the opportunity to kickstart my career, gain new skills, and be part of something I can indeed be proud of. Previous Aging Well in America is Powered by Connection Next AmeriCorps 30: Creating New Pathways to Employment Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2024-06-17/americorps-30-my-pathway-service-higher-education",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2024-06-17/americorps-30-my-pathway-service-higher-education&amp;title=AmeriCorps 30: My Pathway from Service to Higher Education ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2024-06-17/americorps-30-my-pathway-service-higher-education&amp;title=AmeriCorps 30: My Pathway from Service to Higher Education &amp;source=https://americorps.gov/blogs/2024-06-17/americorps-30-my-pathway-service-higher-education",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2024-06-17/americorps-30-my-pathway-service-higher-education&amp;url=https://americorps.gov/blogs/2024-06-17/americorps-30-my-pathway-service-higher-education&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2024-05-31/aging-well-america-powered-connection",
    "https://americorps.gov/blogs/2024-06-20/americorps-30-creating-new-pathways-employment",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2024",
  "subdomain_2": "06",
  "subdomain_3": "17"
}