{
  "id": "americorpsgov_blogs_2019_05_29_true_tales_lives_and_futures_were_madeinamericorpshtml",
  "url": "https://americorps.gov/blogs/2019-05-29/true-tales-lives-and-futures-were-madeinamericorps",
  "title": "true-tales-lives-and-futures-were-madeinamericorps",
  "content": "True Tales of Lives and Futures that were #MadeInAmeriCorps | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb True Tales of Lives and Futures that were #MadeInAmeriCorps Submitted by admin on Wed, 05/29/2019 - 09:39 Mar 12, 2019 Katherine Parker We’re highlighting stories of AmeriCorps alumni whose paths were influenced by national service At the Corporation for National and Community Service (CNCS), we are passionate about the work we do and the mission that drives it. As part of AmeriCorps Week – our annual celebration of AmeriCorps members, alumni, and programs – we are sharing the many ways lives and futures are being #MadeInAmeriCorps. Lisa Bishop Lisa Bishop served as an AmeriCorps VISTA member from 1998-99 with the James McGregor Burns Academy of Leadership in College Park, MD. Bishop’s path to service began in high school, when she actually traveled from state to state promoting national service and service learning. After one year as an AmeriCorps VISTA, Lisa was hired by the Maryland Governor’s Office on Service and Volunteerism, spent 10 years working in education, and found herself feeling right at home after coming to CNCS in 2015. She is currently the Senior Advisor for Education Initiatives and says, “There was no other way for me. I always believed in service and service learning.” Katrina French Katrina French served three AmeriCorps terms: as an AmeriCorps NCCC member from 1997-98; an NCCC Team Leader, 2009-10; and an AmeriCorps VISTA member with the Mississippi State Service Commission, Volunteer Mississippi, 2010-11. Between her first and second terms, Katrina earned a bachelor’s degree and spent 10 years in the veterinary field. French says the most valuable skill she picked up during her service was “cat herding,” which she describes as, “being able to get a diverse group of people on the same page, progressing towards the same goal.” She is currently a Disaster Services Specialist at CNCS. Meghan Hines Meghan Hines served two terms as an AmeriCorps VISTA with a Habitat for Humanity affiliate in central Texas from 2007-09. During her service she developed a $50,000 home sponsorship and worked alongside more than 500 AmeriCorps members during the Gulf Coast hurricane recovery Habitat Build-a-Thon. After completing her service terms, Hines used her two education awards to attend graduate school at Carnegie Mellon’s Heinz College, where she earned a master’s in art management. Hines even wrote a policy paper about the need for AmeriCorps in one of her classes, and she was hired in the VISTA Member Support Unit after graduation. She is currently a Program Officer and not at all shy about her feelings for AmeriCorps. “Our programs have shaped so much of who I am both personally and professionally,” said Meghan. “I am a proud VISTA alum and proud to be #MadeInAmeriCorps.” Jennifer Irwin Jennifer Irwin served as an AmeriCorps VISTA member, 2004-05 with Ohio Campus Compact at Walsh University in Ohio. Irwin names a long list of skills she acquired while serving, including volunteer recruitment, event planning, and community relations, and says, “I was able to learn the most about who I was and what I could accomplish when I was working towards goals that I was passionate about.” After her VISTA term, Jennifer attended graduate school at Kent University and earned a master’s in education and then was hired at Ohio Campus Compact, a CNCS Learn and Service America grant. Irwin is currently a Program Officer at CNCS and recently had the opportunity to return to her VISTA project site and see how the impact of her service continued to grow long after she left. Brendan and Jennifer (Prall) Murphy Brendan and Jennifer (Prall) Murphy served separately but met years later, while working at CNCS. What started as “AmeriLove” turned into marriage – and two “AmeriBabies”! Brendan served as an AmeriCorps NCCC member in 2005-06 and a NCCC Team Leader in 2006-07 out of Colorado. Jennifer also served as an AmeriCorps NCCC member during 2004-05 and a NCCC Team Leader in 2005-06 out of Washington, DC. Brendan said the most valuable lesson he learned while serving was teamwork, “It was remarkable to watch myself gain a better understanding of the diversity of thought and experience on my team. I saw that if we used our different perspectives to work together we could produce an even greater outcome.” “It was project management for me,” said Jennifer. “I learned to prioritize tasks and tackle them one at a time.” Brendan is now a Program Manager for Operations at CNCS and Jennifer is the Lead Disaster Services Specialist. Both say they didn’t necessarily plan this path but knew early on they loved national service. Jennifer sums up her feelings by telling a story from her first service term, “A local newspaper ran a story about our team and the name fantastically got lost in translation because the headline read, ‘Miracle Workers’ instead of ‘AmeriCorps Workers.’” When it comes to national service, there are thousands of opportunities to choose from. Find the one that fits you and see how you can be #MadeInAmeriCorps. Visit our AmeriCorps Week portal to learn more about AmeriCorps and read more #MadeInAmeriCorps stories. Previous MLK Day: The Girl in the Picture Next Want a Healthier, Happier Life? Volunteer with Senior Corps Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2019-05-29/true-tales-lives-and-futures-were-madeinamericorps",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2019-05-29/true-tales-lives-and-futures-were-madeinamericorps&amp;title=True Tales of Lives and Futures that were #MadeInAmeriCorps",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2019-05-29/true-tales-lives-and-futures-were-madeinamericorps&amp;title=True Tales of Lives and Futures that were #MadeInAmeriCorps&amp;source=https://americorps.gov/blogs/2019-05-29/true-tales-lives-and-futures-were-madeinamericorps",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2019-05-29/true-tales-lives-and-futures-were-madeinamericorps&amp;url=https://americorps.gov/blogs/2019-05-29/true-tales-lives-and-futures-were-madeinamericorps&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2019-05-24/mlk-day-girl-picture",
    "https://americorps.gov/blogs/2019-05-29/want-healthier-happier-life-volunteer-senior-corps",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC; AmeriCorps VISTA",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2019",
  "subdomain_2": "05",
  "subdomain_3": "29"
}