{
  "id": "americorpsgov_blogs_2023_05_08_arizonas_older_adults_display_power_servicehtml",
  "url": "https://americorps.gov/blogs/2023-05-08/arizonas-older-adults-display-power-service",
  "title": "arizonas-older-adults-display-power-service",
  "content": "Arizona’s Older Adults Display the Power of Service | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Arizona’s Older Adults Display the Power of Service Submitted by dsong on Mon, 05/08/2023 - 14:54 May 08, 2023 AmeriCorps Staff Older Americans who serve as AmeriCorps members and AmeriCorps Seniors volunteers go beyond supporting their community. They tap into their life experiences to help address critical needs in their communities. During Older Americans Month, we join the nation to recognize and thank older adults for their invaluable contributions from coast to coast. More than 4,000 AmeriCorps members and AmeriCorps Seniors volunteers at 500 service sites are giving back across Arizona. Older Arizonians, ages 55 and older, who serve with AmeriCorps programs come from all walks of life—finding themselves united in turning their compassion into action. At Northern Arizona University Center for Service and Volunteerism and Arizona State University Lodestar Center for Philanthropy and Nonprofit Innovation, AmeriCorps Seniors volunteers step in to help fellow older adults continue to live independently while others use their talents to help children thrive in and out of classrooms. AmeriCorps CEO Michael D. Smith meeting with AmeriCorps Seniors volunteers in Arizona A support system for fellow older adults Through the Senior Companion Program, Rosemary befriends and assists older adults. For more than 15 years, she has helped her companions with everyday tasks. She lends her language skills to help translate for Spanish speakers and provides friendship to others. Her kind and friendly nature is a beacon of light for those facing loneliness, especially for an older woman who recently lost her husband. Under Rosemary's guidance, this woman was able to reengage with her community and form new connections. Rosemary's contributions to her community are truly commendable. Senior Companion Rosemary with AmeriCorps CEO Michael D. Smith In ASU’s Experience Matters AmeriCorps Seniors RSVP program, older adults provide transportation to medical appointments, grocery shopping, errands, and more. These AmeriCorps Seniors volunteers support older adults to meet their needs and help advance their dignity and quality of life—a great way to give back. Fostering the next generation Foster Grandma Jesusa with AmeriCorps CEO Michael D. Smith Jesusa, an Arizona native, spent her childhood helping her parents pick cotton from fields. Although she couldn't attend high school or college, she dreamed of becoming a teacher. But this doesn’t stop a woman with passion. Despite the hardships she faced, Jesusa has served more than 18,000 hours in the Foster Grandparent Program, helping children thrive in classrooms. She tutors and mentors fourth graders through the Northern Arizona University Center for Service and Volunteerism, and her enthusiasm for teaching is evident in her work. Foster Grandpa Fred with his students Fred, a retired police officer, has dedicated over 15 years of his life to the Foster Grandparent program. Throughout his career as a police officer, Fred recognized the crucial role of mentorship, particularly for children facing unique challenges. He knew that just one person could have a lasting, positive impact—so he raised his hand to help. Today, \"Grandpa Fred,\" as he's affectionately known, works with first and second graders, providing guidance and support to help them learn and build their confidence. Make a difference. Choose AmeriCorps. Rosemary, Jesusa, and Fred are setting an example for Arizonians, but there’s much more to be done across the nation and in your local community. Are you ready to embark on a fulfilling journey with AmeriCorps Seniors? With your time and dedication, you can ignite a spark of hope and inspiration in the hearts of the next generation. Whether it's empowering a struggling child to read, lending a helping hand to an elderly neighbor, or providing support to families in the wake of a natural disaster, the possibilities for making a positive impact in your community are endless. You possess the skills and passion needed to make a world of difference. So why not choose the path of community service and join AmeriCorps Seniors? Find out more about AmeriCorps and AmeriCorps Seniors programs for older adults and celebrate Older Americans Month with themed social media posts found in the marketing toolkit . Previous This National Public Health Week Explore Your Future with Public Health AmeriCorps Next Empowering Women and Mothers Through Service Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-05-08/arizonas-older-adults-display-power-service",
    "https://in.nau.edu/center-for-service-and-volunteerism",
    "https://lodestar.asu.edu/",
    "https://americorps.gov/seniors",
    "https://socialpresskit.com/americorpstoolkits#older-americans-month-2023",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-05-08/arizonas-older-adults-display-power-service&amp;title=Arizona’s Older Adults Display the Power of Service",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-05-08/arizonas-older-adults-display-power-service&amp;title=Arizona’s Older Adults Display the Power of Service&amp;source=https://americorps.gov/blogs/2023-05-08/arizonas-older-adults-display-power-service",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-05-08/arizonas-older-adults-display-power-service&amp;url=https://americorps.gov/blogs/2023-05-08/arizonas-older-adults-display-power-service&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-04-05/national-public-health-week-explore-your-future-public-health-americorps",
    "https://americorps.gov/blogs/2023-05-12/empowering-women-mothers-through-service",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors; Public Health AmeriCorps",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "05",
  "subdomain_3": "08"
}