{
  "id": "americorpsgov_blogs_2021_11_09_scaler_tool_boost_your_community_organizations_impacthtml",
  "url": "https://americorps.gov/blogs/2021-11-09/scaler-tool-boost-your-community-organizations-impact",
  "title": "scaler-tool-boost-your-community-organizations-impact",
  "content": "The SCALER Tool: Boost your Community Organization’s Impact | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb The SCALER Tool: Boost your Community Organization’s Impact Submitted by eschneider on Tue, 11/09/2021 - 12:33 Nov 09, 2021 Lily Zandniapour SCALER tool overview AmeriCorps members and AmeriCorps volunteers serve communities and nonprofit organizations throughout the U.S. to tackle our nation’s most pressing civic challenges. We recognize that successfully scaling effective interventions can help improve the lives of more individuals and can benefit more communities. One of the most effective ways for AmeriCorps to expand our positive impact, bridge divides, and strengthen communities is by expanding the scale and reach of our most effective national service interventions. The AmeriCorps Office of Research and Evaluation created its Scaling Evidence-Based Models initiative with an independent research partner, Mathematica, in order to deepen understanding of our most effective program innovations, and to develop a framework for successful scaling of evidence-backed interventions. The evidence-based Scaling Programs with Research Evidence and Effectiveness framework provides insights into conditions that can help identify and support effective interventions that are ready to be scaled. From this framework, AmeriCorps invested in the development of a guidance document, and eventually, a web-based resource known as the Scaling Checklists: Assessing your Level of Evidence and Readiness tool to apply and translate research into action and to demonstrate successful scaling principles gathered from the research. The framework and SCALER tool are just two components of the Scaling Evidence-Based Models initiative. The project also includes additional technical reports, and resources like practitioner and funder guides and case studies that can be utilized throughout a community-based organization’s scaling progression to determine next steps. What does the SCALER tool do? AmeriCorps-awarded sponsors and grantees, as well as community-based organizations and practitioners, interested in increasing their impact within local communities can use the SCALER tool to assess readiness of a model or intervention to scale. The framework and its scaling checklists can be used to determine whether an intervention has sufficient evidentiary support of improving participant outcomes, and to establish intervention-level and organizational-wide processes and supports necessary for successful implementation. How does the SCALER tool work? The SCALER tool assists users in exploring whether their model is ready to scale and provides insight into programmatic implementation elements that can enhance scaling preparedness. It also identifies areas of growth and improvement that can facilitate readiness and success. This could save valuable time and resources when attempting to scale, while also offering additional resources toward supporting a community based organization’s goal of scaling. Before starting to use the SCALER tool, users must gather the information to answer “yes” to each of the following three questions and have it ready as a reference throughout interaction with the tool: Are you familiar with any research studies that have been conducted on your intervention? Do you have knowledge of your organization’s preparedness and support for building evidence for your intervention if needed? Do you have a good understanding of your intervention’s core activities, target population, and implementation supports, along with your organization’s culture and infrastructure that can support scaling? If the answer to any of the questions above is no visit the additional SCALER resources section to determine next steps. If the answer to each of the questions above is yes, you’re ready to begin using the tool and progression through the steps to evaluate the likelihood of successfully scaling your intervention. The interactive framework consists of checklists that when completed help determine whether: The evidence of your intervention’s effectiveness meets industry standards for rigorous evaluation research; and The infrastructure, context, procedures, and processes in place will support successful scaling. Eight SCALER checklists The SCALER tool provides organizations with eight checklists to determine viability of successfully scaling an intervention. Checklist 1: Identifying an effective intervention Checklist 2: Building evidence of effectiveness Checklist 3: Specifying the intervention Checklist 4: Defining the target population Checklist 5: Establishing implementation supports Checklist 6: Having an enabling context Checklist 7: Establishing an implementation infrastructure Checklist 8: Summary checklist The takeaway from completing each checklist is a collection of detailed reports and responses that can: Identify activities your organization can take to enhance scaling readiness; and Address areas that need further attention, resources, or support with key stakeholders, organization leaders and funders. The framework, tool and the suite of products have more applications than simply community-based organization self-assessment. This evidence-based framework also can be used to gauge organizational progress over time by providing an entry token that can be saved to either update information or compare standing and capacity with a previous point in time assessment. The SCALER tool checklists give organizations an evidence-based and validated assessment tool to use when selecting interventions to fund and based on the likelihood of successful scaling of an intervention. A built-in worksheet supports staff discussion and input on strategies for improvement of program evidence, operations and stakeholder engagement. Finally, the resources embedded in the tool and the suite of resources inclusive of guides, case studies and recommendations, provides actionable information that improves program implementation and delivery, whether your community-based organization desires to scale or not. Scaling resources Use the SCALER Tool Discover additional resources for successfully scaling interventions Explore the Scaling Evidence Based Models suite of products Previous AmeriCorps Research Grantee and AmeriCorps Member Helps West Philadelphia Graduating Class Keep Going Next AmeriCorps Celebrates National Native American Heritage Month Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2021-11-09/scaler-tool-boost-your-community-organizations-impact",
    "https://americorps.gov/grantees-sponsors/evaluation-resources/scaler",
    "https://americorps.gov/grantees-sponsors/evaluation-resources/scaler &nbsp;",
    "https://americorps.gov/grantees-sponsors/evaluation-resources/scaler-resources &nbsp;",
    "https://americorps.gov/evidence-exchange/scaling-intervention-recommendations-resources &nbsp;",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2021-11-09/scaler-tool-boost-your-community-organizations-impact&amp;title=The SCALER Tool: Boost your Community Organization’s Impact  ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2021-11-09/scaler-tool-boost-your-community-organizations-impact&amp;title=The SCALER Tool: Boost your Community Organization’s Impact  &amp;source=https://americorps.gov/blogs/2021-11-09/scaler-tool-boost-your-community-organizations-impact",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2021-11-09/scaler-tool-boost-your-community-organizations-impact&amp;url=https://americorps.gov/blogs/2021-11-09/scaler-tool-boost-your-community-organizations-impact&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2021-10-26/americorps-research-grantee-americorps-member-helps-west-philadelphia-graduating",
    "https://americorps.gov/blogs/2021-11-26/americorps-celebrates-national-native-american-heritage-month",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "Office of Research and Evaluation",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2021",
  "subdomain_2": "11",
  "subdomain_3": "09"
}