{
  "id": "americorpsgov_blogs_2020_11_20_americorps_seniors_creativity_and_community_during_covid_19html",
  "url": "https://americorps.gov/blogs/2020-11-20/americorps-seniors-creativity-and-community-during-covid-19",
  "title": "americorps-seniors-creativity-and-community-during-covid-19",
  "content": "AmeriCorps Seniors: Creativity and Community During COVID-19 | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps Seniors: Creativity and Community During COVID-19 Submitted by kaparker on Wed, 12/09/2020 - 13:58 Nov 20, 2020 Adrienne Nash Meléndez and Andrea New While needs have increased exponentially due to COVID-19, programs like the Modern Maturity Center, Inc. (MCC) that engage senior volunteers are working to keep both volunteers and those they serve safe. AmeriCorps CEO Barbara Stewart and AmeriCorps staff Adrienne Nash Meléndez and Andrea New recently visited AmeriCorps Seniors grantee, Modern Maturity Center, Inc. (MCC) in Dover, Delaware. While needs have increased exponentially due to COVID-19, programs like MCC that engage senior volunteers are working to keep both volunteers and those they serve safe. With food insecurity at an all-time high for seniors, for example, MCC offers a variety of options including AmeriCorps Seniors volunteers in the RSVP program delivering meals through Meals on Wheels, a newly instituted “grab and go” program where seniors can drive up to the front door and have their meal handed to them like a drive through service, and in-person dining through a reservation system with socially distanced table configuration. For many, the pandemic has brought a sense of isolation. For this reason, MCC Executive Director Carolyn Fredericks, met with the Delaware Governor’s Office to advocate for the continued provision of services. This included seniors serving seniors through volunteering. She stated that people need food and support, and they had to adapt to provide the best level of care that aligned with safety protocol. New safety procedures included establishing a comprehensive screening process for volunteers and staff including a new facial recognition and temperature scanning kiosk. They sanitize all tables after use, require face masks at all times while serving, offer hand sanitizing stations and ample handwashing areas, and complete a nightly disinfecting fog procedure throughout the building. With these safeguards in place, MCC has continued to provide vital services to seniors during COVID-19. These services not only include companionship, volunteering, education, wellness, nutrition, recreation, and connections to other resources, but also something deeper: a sense of community.  As the pandemic has evolved, MCC has adapted services and volunteer opportunities to allow AmeriCorps Seniors volunteers to meet critical community needs, safely. Modern Maturity Center, Inc. Modern Maturity Center, Inc. (MMC) has been sponsoring the RSVP project in Kent County, DE since 1972. Their mission is to provide programs and services that enhance the quality of life, with respect and dignity, for individuals age 50+. The front door is where “grab and go” meals can be picked up by seniors. This is a newly instituted program as a result of COVID-19, and approximately 100 meals are picked up each day. Andrea Completing the Health Assessment Questionnaire Everyone entering Modern Maturity’s building must complete a health assessment questionnaire, sanitize their hands, and have a temperature check. Adrienne and Barbara Completing the Temperature Check Process, and Retired Nurse, Juanita, supporting the entrance process Barbara completed the entrance process with process with Randy Jenkins, RSVP Director, and several AmeriCorps Seniors volunteers. Juanita (center, floral mask), an AmeriCorps Seniors volunteer, is a retired nurse. She learned about the RSVP program from her neighbor, who also volunteers. Dorothy (far left) is a long-standing AmeriCorps Seniors volunteer who leads the entrance process. Volunteers Packing Meals by Table and Delivery Route Even during the pandemic, MCC has been able to engage over 150 new AmeriCorps Seniors volunteers – largely through word of mouth recruiting. Currently, over 300 AmeriCorps Seniors volunteers complete services like Meals on Wheels deliveries, food bank distribution, and support of a blood bank. Many of the AmeriCorps Seniors volunteers do Meals on Wheels 4-5 times a week, preparing the meals as early as 4am. Needs have continued to increase during the pandemic, and AmeriCorps Seniors volunteers continue to step up to meet these increasing needs. Sanitation of Tables Tables are spaced to allow social distancing and are sanitized as soon as volunteers leave for meal delivery. Hand sanitizer kiosks are available throughout the building, and every night, a disinfecting fog procedure occurs throughout the building. Meet Jack This is Jack, an AmeriCorps Seniors volunteer and Army Veteran. Jack had been attending MCC’s line dancing classes when he saw a flier asking for volunteers. He knew that some of the past volunteers were no longer able to serve due to their own health needs, so he jumped in to help. Jack became an AmeriCorps Seniors volunteer in the RSVP program in September and now serves 4 days a week. Jack’s commitment to helping others and his care for those he serves is obvious. He delivered 32 meals on this date. At one home, Jack learned that the senior he was delivering to had passed away the previous evening. Jack immediately stepped in to comfort the family. This level of care, in the chaos of a pandemic, shows how AmeriCorps Seniors do so much more than delivering nutritious meals: this is about being a community, lifting each other up, and being there in the worst times. Delivering Food for Ms. Waters, 99 y/o This is Ms. Waters, a vivacious 99 year old, who receives daily meal deliveries and shared with us her love of fashion. She was quick and kind, and wished her delivery team a Happy Thanksgiving. Delivering to a Participant Many homes on the meal delivery route have accessibility features such as ramps. This is an important reminder that for many seniors, having someone deliver a meal to them is essential, as they may not have transportation or the ability to go in-person. Speaking with Colleen, Who is Serving at The Front Porch This is Colleen, an AmeriCorps Seniors volunteer with MCC’s Front Porch Program, a memory loss prevention program. Colleen became a volunteer when her mother attended the program, and even after her mother passed, she continued to serve. The first of its kind in Delaware, the Front Porch program is designed specifically for individuals with Mild Cognitive Impairment, Early Alzheimer’s disease, or other memory-related disorders, and focuses on engaging clients in a warm, welcoming environment. Due to COVID-19 space restrictions, this program is at approximately 50% capacity. However, the need continues to increase, and the waitlist now has 30 individuals waiting for services. While these individuals may not be able to enroll in this program at the moment, the program continues to provide resource and referral services for future participants and their caregivers. Randy and Andrea Randy Jenkins, MCC RSVP Program Director, and Andrea New, AmeriCorps Portfolio Manager, sporting their AmeriCorps Senior Gear. Visiting the AmeriCorps Seniors volunteers serving at MCC was proof once again of the growing community needs being met by creative, resilient volunteers. We are grateful that AmeriCorps Seniors volunteers are serving, and serving safely! Previous A Lifetime of Service: Veterans Serve Through AmeriCorps Seniors Next AmeriCorps and AmeriCorps Seniors COVID-19 Response Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2020-11-20/americorps-seniors-creativity-and-community-during-covid-19",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2020-11-20/americorps-seniors-creativity-and-community-during-covid-19&amp;title=AmeriCorps Seniors: Creativity and Community During COVID-19",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2020-11-20/americorps-seniors-creativity-and-community-during-covid-19&amp;title=AmeriCorps Seniors: Creativity and Community During COVID-19&amp;source=https://americorps.gov/blogs/2020-11-20/americorps-seniors-creativity-and-community-during-covid-19",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2020-11-20/americorps-seniors-creativity-and-community-during-covid-19&amp;url=https://americorps.gov/blogs/2020-11-20/americorps-seniors-creativity-and-community-during-covid-19&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2020-11-12/lifetime-service-veterans-serve-through-americorps-seniors",
    "https://americorps.gov/blogs/2020-11-20/americorps-and-americorps-seniors-covid-19-response",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2020",
  "subdomain_2": "11",
  "subdomain_3": "20"
}