{
  "id": "americorpsgov_blogs_2021_09_29_prepare_protect_keep_your_families_safe_these_tips_readygovhtml",
  "url": "https://americorps.gov/blogs/2021-09-29/prepare-protect-keep-your-families-safe-these-tips-readygov",
  "title": "prepare-protect-keep-your-families-safe-these-tips-readygov",
  "content": "Prepare to Protect: Keep your families safe with these tips from Ready.gov | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Prepare to Protect: Keep your families safe with these tips from Ready.gov Submitted by mbrodbeck on Wed, 09/29/2021 - 13:08 Sep 29, 2021 AmeriCorps staff In the past year, the U.S. persevered through many challenges. The 2020 hurricane season was the most active on record and even now, communities are recovering from Hurricane Ida. Severe winter storms and record-breaking heat waves interrupted our power sector, and dangerous heat waves helped supercharge the wildfires raging on the west coast. All of this converges with ongoing COVID-19 crisis, which impacted every community across the United States. Every day, those wearing the AmeriCorps “A” support communities to be more resilient and ready should disaster strike. Many AmeriCorps members serving with programs like Kentucky Ready Corps , SBP’s Disaster Corps , Sewa International , Rebuilding Together’s CapacityCorps create and deliver preparedness programming, resources, trainings in partnership with local organizations across America. During National Preparedness Month , AmeriCorps encourages all Americans to join them by taking the important steps to prepare for natural and human-made threats and to ensure that all our communities are ready for any emergency at any time. Preparing for disaster protects you, your families and your community. Now is the time to have conversations with your family, neighbors and loved ones to discuss what you would do in the event of a disaster in your area. Stay prepared with these steps: Make A Plan . Make a plan today. Your family may not be together if a disaster strikes, so it is important to know which types of disasters could affect your area. Know how you’ll contact one another and reconnect if separated. Establish a family meeting place that’s familiar and easy to find. Are you Ready? Use this guide to find out what to do in any disaster, from an earthquake to a pandemic to a cyber attack. Build A Kit . After an emergency, you may need to survive on your own for several days. Being prepared means having your own food , water and other supplies to last for several days. A disaster supplies kit is a collection of basic items your household may need in the event of an emergency. Make sure your emergency kit is stocked with the items on the checklist . Once you take a look at the basic items consider what unique needs your family might have, such as supplies for pets or senior family members. Additional Resources . Use the resources on Ready.gov or Listo.gov to make sure you have taken the steps to get prepared. You can also sign up to receive local alerts and warning on your mobile phone. Download the FEMA app and receive real-time alerts from the National Weather Service for up to five locations nationwide and have the steps to prepare for disaster with you at all times to keep you and your loved ones safe. For those looking to take it one step further, there are many ways to get involved in your community. For example, you can take a disaster training course to become certified with the Red Cross . Please use these tips, not only during National Preparedness Month, but year-round. We encourage all Americans to take the important steps to prepare for natural and human-made threats and to ensure all communities are ready for any emergency. Remember, preparing for disasters is protecting everyone you love. Previous Funding Opportunity: Help AmeriCorps Build a New Generation of Leaders with Public Health AmeriCorps Next AmeriCorps Members Take on Hunger Issues Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2021-09-29/prepare-protect-keep-your-families-safe-these-tips-readygov",
    "https://kyready.eku.edu/",
    "https://sbpusa.org/about-us",
    "https://www.sewausa.org/americorps",
    "https://rebuildingtogether.org/capacitycorps",
    "https://www.whitehouse.gov/briefing-room/presidential-actions/2021/08/31/a-proclamation-on-national-preparedness-month-2021/",
    "https://www.ready.gov/plan",
    "http://www.ready.gov/be-informed",
    "https://www.ready.gov/sites/default/files/2021-03/are-you-ready-guide.pdf",
    "https://www.ready.gov/kit",
    "https://www.ready.gov/food",
    "https://www.ready.gov/water",
    "https://www.ready.gov/sites/default/files/2020-03/ready_emergency-supply-kit-checklist.pdf",
    "https://www.ready.gov/sites/default/files/2021-02/ready_checklist.pdf",
    "https://www.ready.gov/animals",
    "https://www.ready.gov/seniors",
    "https://www.ready.gov/",
    "https://www.listo.gov/es",
    "https://www.redcross.org/take-a-class/disaster-training",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2021-09-29/prepare-protect-keep-your-families-safe-these-tips-readygov&amp;title=Prepare to Protect: Keep your families safe with these tips from Ready.gov",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2021-09-29/prepare-protect-keep-your-families-safe-these-tips-readygov&amp;title=Prepare to Protect: Keep your families safe with these tips from Ready.gov&amp;source=https://americorps.gov/blogs/2021-09-29/prepare-protect-keep-your-families-safe-these-tips-readygov",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2021-09-29/prepare-protect-keep-your-families-safe-these-tips-readygov&amp;url=https://americorps.gov/blogs/2021-09-29/prepare-protect-keep-your-families-safe-these-tips-readygov&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2021-09-28/funding-opportunity-help-americorps-build-new-generation-leaders-public-health",
    "https://americorps.gov/blogs/2021-09-30/americorps-members-take-hunger-issues",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "Public Health AmeriCorps",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2021",
  "subdomain_2": "09",
  "subdomain_3": "29"
}