{
  "id": "americorpsgov_blogs_2022_06_23_gaining_perspective_through_national_servicehtml",
  "url": "https://americorps.gov/blogs/2022-06-23/gaining-perspective-through-national-service",
  "title": "gaining-perspective-through-national-service",
  "content": "Gaining Perspective through National Service | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Gaining Perspective through National Service Submitted by dsong on Wed, 06/22/2022 - 15:45 Jun 23, 2022 Madalyn Shircliff Madalyn is an AmeriCorps VISTA member at University of Maine. After struggling with burnout and fatigue, Madalyn joined AmeriCorps with the purpose to help make education more accessible at the nonprofit level. When I went to college to study journalism and political science, my dreams were almost Herculean. I had a clear image in my mind of the path to follow, the career to have, the impact to make. What I didn’t expect was the cynicism that followed – feeling inefficient and that nothing I did mattered. I believe this is something we all experience on a much larger scale today. I was tired and burnt out and didn’t know what to do. Many of us are overwhelmed and we are inundated daily with news, events, and stories that make us feel helpless. How can our voice matter in the grand scheme of things? How can the action of one person even make a dent? After a period of succumbing to this negativity, I decided to start over and seek the drive again. Surprisingly, I didn’t find this through activities I typically gravitate toward like reading or studying. Instead, I spoke to classmates serving with AmeriCorps who shared about their various roles. I joined AmeriCorps soon after with an objective to learn about a new community and ways to get involved. Madalyn during her service at Bridging the Gap At the beginning, my service varied day-to-day on campus. Some days I would recruit and talk to students who wanted to volunteer. Other days I created flyers or schedule events. I’ve often found myself in the role of just talking to people to help answer their questions about taxes, tax credits, and financial resources for our CA$H Maine project. But between all these and any other roles I took on, I ended my day with the satisfaction of knowing that my service matters. I also served with Bridging the Gap , a Goodwill organization based in Augusta, Maine, that provides the community as a warming center during cold months with a clothing bank, and basic essentials and hygiene pantry. My role was to offer resources such as matched savings programs, tuition-free classes, and free tax preparation to the people there. I was able to meet and connect with people from all walks of life. I’ve met people who raced demolition derby, and a pastry chef. I also had the opportunity to help people facing challenges during recovery and re-entry after imprisonment. I’m grateful I was a part of a team that strives to lower barriers to success in underserved areas. The connections I made reignited my ambition as well as my optimism. National service taught me a big lesson:  one person cannot change the world, even though many of us often burden ourselves by carrying the weight of the world on our shoulders. What we can do instead is recognize what’s right in front of us: our community. Sometimes the best thing we can do is help our neighbor and, more importantly,  listen to their needs. This is a lesson that I plan to carry with me into the future because serving my community and seeing the impact gives me new inspirations. Find out more about national service opportunities for students and young adults for this summer . Madalyn Shircliff (she/her) is an AmeriCorps member serving in the VISTA program as college access and success coordinator with New Ventures Maine at the University of Maine at Augusta. Originally from Fort Worth, Texas, Madalyn was thrilled to move to Maine and join a new, unique community. Previous Giving the Gift of Music Next Join the Caravan to Reframe Aging Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2022-06-23/gaining-perspective-through-national-service",
    "https://www.btgaugusta.org/",
    "https://goodwillnne.org/",
    "https://americorps.gov/serve/fit-finder/americorps-vista#summer-associate",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2022-06-23/gaining-perspective-through-national-service&amp;title=Gaining Perspective through National Service ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2022-06-23/gaining-perspective-through-national-service&amp;title=Gaining Perspective through National Service &amp;source=https://americorps.gov/blogs/2022-06-23/gaining-perspective-through-national-service",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2022-06-23/gaining-perspective-through-national-service&amp;url=https://americorps.gov/blogs/2022-06-23/gaining-perspective-through-national-service&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2022-06-21/giving-gift-music",
    "https://americorps.gov/blogs/2022-06-29/join-caravan-reframe-aging",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2022",
  "subdomain_2": "06",
  "subdomain_3": "23"
}