{
  "id": "americorpsgov_blogs_2021_11_30_continuing_serve_20k_veterans_give_back_wearing_americorpshtml",
  "url": "https://americorps.gov/blogs/2021-11-30/continuing-serve-20k-veterans-give-back-wearing-americorps",
  "title": "continuing-serve-20k-veterans-give-back-wearing-americorps",
  "content": "Continuing to Serve: 20K+ veterans give back wearing the AmeriCorps A | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Continuing to Serve: 20K+ veterans give back wearing the AmeriCorps A Submitted by eschneider on Tue, 11/30/2021 - 14:50 Nov 30, 2021 AmeriCorps staff Veterans serving in AmeriCorps are solving America’s most pressing challenges through service During National Veterans and Military Families Month, AmeriCorps is proud to have the dual honor of serving our nation’s veterans and serving alongside them. This month, we thank those who have selflessly served in our armed forces. Servicemembers make tremendous sacrifices to defend our nation, and for many veterans, the military is just the beginning of their service to country. Veterans gain unique skills and leadership abilities through their military service that can be used to address challenges at home through another tour of duty opportunities in national service. Thank you to those who have served and to the thousands of veterans who continue serving our nation each year wearing the AmeriCorps ‘A’. Across the country AmeriCorps helps community-based efforts to meet the needs of veterans and military families through mentorship programs for military children, legal assistance, affordable housing, health care, counseling, and more. More than 20,000 veterans also serve in AmeriCorps and AmeriCorps Seniors programs each year, applying the skills they acquired in the military to help their communities by responding to disasters, building homes, mentoring at-risk youth, supporting other veterans, and more. Mary Tobin, a combat veteran who served 10 years in the United States Army as a communications officer, including two tours in Iraq, who now serves as AmeriCorps senior advisor for Wounded Warrior, Veteran, and Military Family Initiatives continues to make serving and engaging veterans and military families one of the agency’s priority focus areas. “For veterans looking for new ways to serve, AmeriCorps can help connect you to communities that are looking for leaders to tackle local problems. I believe supporting successful veteran reintegration through national service will help make our communities stronger at the same time.” Read more from Mary Tobin in The Hill. In Quincy, Mass., John King drives veterans to medical appointments across Norfolk County. He’s done this for the past four years through RSVP of Norfolk County, an AmeriCorps Seniors program. “You see some guys in very tough shape and you feel you are doing something, you make a difference,” shared King. Overall, he has helped 14 people from Quincy, Weymouth and Braintree make their appointments at VA hospitals. During COVID-19, King brought extra food to a 99-year-old Milton veteran, Arthur, and then planned a car parade of more than 40 people, including police and fire, with the veteran's case manager to mark his 100th birthday. King served in the Navy from 1962-1966, while his father served in President Franklin D. Roosevelt’s Civilian Conservation Corps during the Great Depression. This month, and every month, join us in thanking veterans and those like John who served in the military. Collectively, veterans can build stronger communities with fresh ideas, energy, and human capacity to solve problems. If you know or are a veteran who is inspired to pursue another tour of service, share the opportunities available at americorps.gov/serve. And if you know of an organization that would like to apply for funding to serve veteran communities, check out the funding opportunities available. Previous AmeriCorps Celebrates National Native American Heritage Month Next Resolve to Serve in 2022 Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2021-11-30/continuing-serve-20k-veterans-give-back-wearing-americorps",
    "https://thehill.com/blogs/congress-blog/politics/581084-honoring-those-who-continue-to-serve-through-national-service",
    "https://www.patriotledger.com/story/lifestyle/2021/10/12/quincy-rsvp-navy-vet-gives-eldest-veterans-medical-rides-friendship-rides-for-vets/5955755001/",
    "https://americorps.gov/serve/americorps-seniors",
    "https://americorps.gov/partner/funding-opportunities",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2021-11-30/continuing-serve-20k-veterans-give-back-wearing-americorps&amp;title=Continuing to Serve: 20K+ veterans give back wearing the AmeriCorps A ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2021-11-30/continuing-serve-20k-veterans-give-back-wearing-americorps&amp;title=Continuing to Serve: 20K+ veterans give back wearing the AmeriCorps A &amp;source=https://americorps.gov/blogs/2021-11-30/continuing-serve-20k-veterans-give-back-wearing-americorps",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2021-11-30/continuing-serve-20k-veterans-give-back-wearing-americorps&amp;url=https://americorps.gov/blogs/2021-11-30/continuing-serve-20k-veterans-give-back-wearing-americorps&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2021-11-26/americorps-celebrates-national-native-american-heritage-month",
    "https://americorps.gov/blogs/2021-12-30/resolve-serve-2022",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [
    "Veterans and Military Families"
  ],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2021",
  "subdomain_2": "11",
  "subdomain_3": "30"
}