{
  "id": "americorpsgov_blogs_2023_10_19_30th_anniversary_americorps_movementhtml",
  "url": "https://americorps.gov/blogs/2023-10-19/30th-anniversary-americorps-movement",
  "title": "30th-anniversary-americorps-movement",
  "content": "30th Anniversary: The AmeriCorps Movement | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb 30th Anniversary: The AmeriCorps Movement Submitted by dsong on Wed, 10/18/2023 - 17:02 Oct 19, 2023 AmeriCorps Staff It’s been 30 years since AmeriCorps was created , and we celebrated in style. From Hollywood actors to political figures and grassroots activists, the entire nation came together in September 2023 to recognize the importance of national service in our country. The landmark event featured speeches from President Bill Clinton and Secretary Hillary Clinton to actor Jay Ellis, The King Center CEO Bernice A. King, and Senator Chris Coons, among others. Thousands of Americans joined in to recognize the importance of national service in our country. A New Conservation Legacy to Tackle America’s Climate Crisis But that’s not all. Ahead of the 30th anniversary celebrations, AmeriCorps celebrated the launch of a groundbreaking new conservation initiative – the AmeriCorps NCCC Forest Corps . In partnership with the US Forest Service, the first cohort of nearly 100 AmeriCorps members will be deployed in the summer of 2024 to help national forests and grasslands, mitigate risks of wildfires in high-risk regions, and support reforestation efforts and wildfire crisis response. The new initiative will help improve the lives of individuals and communities nationwide while helping the nation address climate change's catastrophic and disproportionate impacts and unequal access to training, higher education, and high-quality jobs. Social Media Shoutouts from Coast to Coast The celebrations didn’t stop there. From California to New York, Americans took to social media to show their support for AmeriCorps and its mission to lift up our communities and recognize the millions who have served. President Biden recognized the critical roles AmeriCorps members and AmeriCorps Seniors volunteers played for our communities over the past 30 years. For 30 years, @AmeriCorps has provided over 1 million Americans a career pathway and the opportunity to serve. They&#39;ve taught millions how to read, rebuilt thousands of homes after disasters, and now play a critical role in my new American Climate Corps. Happy 30th, AmeriCorps! President Biden (@POTUS) September 21, 2023 Our nation’s leaders and national service champions shared their support and recognition of AmeriCorps. They highlighted the impact of service in their state and how it can open doors to careers like it did for AmeriCorps alumnus Representative Matt Wilhelm. Happy birthday, @AmeriCorps ! 🥳 In the 30 years since President Clinton started AmeriCorps, over a million Americans have given back to their communities. It has been a delight to see this volunteer spirit take hold up and down Delaware and across our country. #AmeriCorps30 pic.twitter.com/D97GrJu0wB Senator Tom Carper (@SenatorCarper) September 21, 2023 Happy 30th Anniversary, @AmeriCorps ! As a proud two-term AmeriCorps alumnus, I know the power + potential of national service to transform our communities + our country. We need AmeriCorps now more than ever. Here’s to the next 30 years of getting things done for America! 🎉 pic.twitter.com/eQVdIk5IuL Matt Wilhelm (@RepWilhelm) September 22, 2023 AmeriCorps’ partners, grantees, and alumni also joined in on the celebrations, highlighting their milestones and memorable service moments. Actor of the hit television series “Insecure” Jay Ellis shared how his AmeriCorps service impacted not only his community but his life and perspective as well. A Moment to Commemorate in America Hundreds of Americans joined our nation’s leaders and AmeriCorps leaders, members, AmeriCorps Seniors volunteers, and alumni in a virtual event commemorating the 30th anniversary . AmeriCorps CEO Michael D. Smith was joined by: Our board member Shirley Sagawa, who helped establish the agency under former President Bill Clinton; The King Center CEO Dr. Bernice A. King discussed the importance of AmeriCorps’ partnership during Martin Luther King, Jr., Day of Service; Lieutenant Governor Billy Nungesser highlighted the impact of national service after Hurricane Katrina in Louisiana; and Senator Chris Coons shared about his experience designing one of the first AmeriCorps programs more than three decades ago. AmeriCorps ended the official 30th anniversary kickoff by welcoming the newest class of members across the nation – Team Leaders in the AmeriCorps NCCC Southwest Region , Storytime Village VISTA program , and LifeLong Medical Care AmeriCorps Health Fellows . Celebrate Milestones Yearlong AmeriCorps’ anniversary celebrations will continue all year long. Each month, AmeriCorps joins Americans, national service programs, and partners to highlight the milestones that continue to address our nation’s toughest challenges, like the Clinton Foundation's upcoming summit. The agency will join President Bill Clinton and national service champions on October 26, 2023, for the AmeriCorps: 30 Years Forward Summit to commemorate the 30th anniversary and discuss the future of service. Stay tuned for more updates and events - you won't want to miss a single moment of AmeriCorps' milestone year! Learn how you can take part in the celebrations and follow @AmeriCorps on X (formerly known as Twitter), Facebook , Instagram , and LinkedIn to learn about the latest events. Previous Recognizing the Strength and Culture of Indigenous Communities Next Fostering Diversity through Service: AmeriCorps Members and Seniors Volunteers Leading the Way Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-10-19/30th-anniversary-americorps-movement",
    "http://americorps.gov/americorps30",
    "https://americorps.gov/serve/americorps/americorps-nccc/forest-corps",
    "https://twitter.com/AmeriCorps?ref_src=twsrc%5Etfw",
    "https://twitter.com/POTUS/status/1704952386802868265?ref_src=twsrc%5Etfw",
    "https://twitter.com/AmeriCorps?ref_src=twsrc%5Etfw",
    "https://twitter.com/hashtag/AmeriCorps30?src=hash&amp;amp;ref_src=twsrc%5Etfw",
    "https://t.co/D97GrJu0wB",
    "https://twitter.com/SenatorCarper/status/1704890140760412491?ref_src=twsrc%5Etfw",
    "https://twitter.com/AmeriCorps?ref_src=twsrc%5Etfw",
    "https://t.co/eQVdIk5IuL",
    "https://twitter.com/RepWilhelm/status/1705015416865636398?ref_src=twsrc%5Etfw",
    "https://www.hbo.com/insecure",
    "https://www.youtube.com/watch?v=bBhz9Toj7hc",
    "https://americorps.gov/serve/americorps/americorps-nccc",
    "https://www.storytimevillage.org/summer-associates",
    "https://lifelongmedical.org/americorps/",
    "https://www.clintonfoundation.org/",
    "https://www.clintonfoundation.org/americorps-thirty-years-forward/",
    "https://socialpresskit.com/americorps30",
    "https://twitter.com/AmeriCorps",
    "https://facebook.com/AmeriCorps",
    "https://www.instagram.com/americorps/",
    "https://www.linkedin.com/company/americorps",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-10-19/30th-anniversary-americorps-movement&amp;title=30th Anniversary: The AmeriCorps Movement",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-10-19/30th-anniversary-americorps-movement&amp;title=30th Anniversary: The AmeriCorps Movement&amp;source=https://americorps.gov/blogs/2023-10-19/30th-anniversary-americorps-movement",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-10-19/30th-anniversary-americorps-movement&amp;url=https://americorps.gov/blogs/2023-10-19/30th-anniversary-americorps-movement&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-10-06/recognizing-strength-culture-indigenous-communities",
    "https://americorps.gov/blogs/2023-10-30/fostering-diversity-through-service-americorps-members-seniors-volunteers-leading",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC; AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "10",
  "subdomain_3": "19"
}