{
  "id": "americorpsgov_blogs_2023_05_12_empowering_women_mothers_through_servicehtml",
  "url": "https://americorps.gov/blogs/2023-05-12/empowering-women-mothers-through-service",
  "title": "empowering-women-mothers-through-service",
  "content": "Empowering Women and Mothers Through Service | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Empowering Women and Mothers Through Service Submitted by dsong on Thu, 05/11/2023 - 12:32 May 12, 2023 AmeriCorps Staff In honor of Mother’s Day and Women’s Health Care Month, AmeriCorps is celebrating AmeriCorps members and AmeriCorps Seniors volunteers who empower women and mothers. These dedicated individuals serve in communities throughout the US at organizations helping women receive the care they need, like Maggie’s Place – a community-based organization that helps pregnant and parenting women and their children experiencing homelessness in a safe space. Through various programs and services, AmeriCorps members offer assistance where it is needed the most, such as housing, counseling, parenting, child enrichment, health and wellness, and more.  Their presence creates a safe and welcoming community. A Future Healthcare Professional in the Making AmeriCorps member Isabella joined Maggie’s Place after graduating from Indiana University to gain meaningful life experiences as a future healthcare professional. There’s never a dull day for Isabella during her service. From sunset walks with moms to driving them to job interviews, rocking babies to sleep, and supporting soon-to-be moms during labor, Isabella learns new skills and creates meaningful relationships daily. \"Experiencing life with other women and learning from each other is one of my favorite things in this world. I am grateful for all the lessons, life hacks, and deep talks that I get to have with my amazing AmeriCorps cohort and the women we serve,\" said AmeriCorps member Isabella. Jessica followed her passion as an aspiring doula and joined Maggie’s Place to serve others. As a children and families major at Eastern Michigan University, Jessica adapts to different roles, such as a friend, confidant, advocate, or whomever mothers need most. She supports them from pregnancy to childbirth through postpartum, providing them with the resources to help them acclimate to their new role—motherhood. “My top memorable moments are when the moms come home from the hospital after giving birth and seeing them enter mommy mode. Through the sleep deprivation, hormonal fluctuations, the less-than-ideal circumstances, the amount of unconditional love and care they have for their babies is heartwarming,\" said AmeriCorps member Jessica. A Reward for Returning AmeriCorps Member After completing her service term, AmeriCorps member Diana joined Maggie’s Place as a team leader. Diana decided to recommit to service because she felt she could do more to help the women at Maggie’s Place. Diana supports new mothers every day, from looking after newborns to helping create a sense of belonging by organizing first holiday celebrations for moms and their babies. For many of the women at Maggie’s Place, holidays are difficult times. Diana helps prepare food, gifts, and a safe place for the moms and babies to feel special and loved. “There is something magical about a room full of people who were recently strangers coming together to create new traditions and celebrate each other during one of the most meaningful times of the year,” said AmeriCorps member Diana. An Unforgettable Bond Nikole went to Maggie’s Place when she was pregnant with her daughter. Originally from Las Vegas, Nikole lived in Mexico for the last 20 years And Diana was one of first of the three AmeriCorps members to welcome her to Maggie’s Place. “I’ve never been alone at Maggie’s Place. One of the AmeriCorps members was with me when I gave birth to my daughter, and she cut the umbilical cord. That night was New Year’s Eve and we watched fireworks together with my newborn daughter from the hospital window,” said Nikole. A Support System for Mothers and Children Whether they organize donations for diapers, provide mental health counseling services, or help care for newborns, AmeriCorps members and AmeriCorps Seniors volunteers give these women, and many more, the support, confidence and compassion they need, when they need it most. Find out how you can help empower women and mothers through national service . About Maggie’s Place Phoenix-based Maggie’s Place welcomes pregnant and parenting women and their children into a safe and loving community, providing life-changing programs and ongoing services to help them to become self-sufficient. AmeriCorps members spend up to a year living with pregnant and parenting women formerly experiencing homelessness who are now housed in a loving, caring environment. Using a trauma-informed care approach, AmeriCorps members are on the front lines of the fight to overcome adverse childhood experiences and break the relentless cycle of poverty. Find out more about Maggie’s Place AmeriCorps positions . Previous Arizona’s Older Adults Display the Power of Service Next Feeding the Hungry, Reaping the Harvest Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-05-12/empowering-women-mothers-through-service",
    "https://www.maggiesplace.org/",
    "http://americorps.gov/serve",
    "https://www.maggiesplace.org/americorpsopportunities/",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-05-12/empowering-women-mothers-through-service&amp;title=Empowering Women and Mothers Through Service",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-05-12/empowering-women-mothers-through-service&amp;title=Empowering Women and Mothers Through Service&amp;source=https://americorps.gov/blogs/2023-05-12/empowering-women-mothers-through-service",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-05-12/empowering-women-mothers-through-service&amp;url=https://americorps.gov/blogs/2023-05-12/empowering-women-mothers-through-service&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-05-08/arizonas-older-adults-display-power-service",
    "https://americorps.gov/blogs/2023-05-15/feeding-hungry-reaping-harvest",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "05",
  "subdomain_3": "12"
}