{
  "id": "americorpsgov_blogs_2021_08_31_americorps_called_help_keep_families_their_homeshtml",
  "url": "https://americorps.gov/blogs/2021-08-31/americorps-called-help-keep-families-their-homes",
  "title": "americorps-called-help-keep-families-their-homes",
  "content": "AmeriCorps Called on to Help Keep Families in their Homes | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps Called on to Help Keep Families in their Homes Submitted by mbrodbeck on Tue, 08/31/2021 - 09:32 Aug 31, 2021 Acting CEO Mal Coles US Attorney General Merrick Garland issued today a call to action in response to the growing housing and evictions crisis in so many in our communities. As an organization steeped in a long history of tackling inequity and financial hardships, AmeriCorps is ready to answer this call. Our AmeriCorps VISTA program is wholly devoted to eradicating poverty in rural and urban communities. AmeriCorps Seniors, NCCC, and State and National programs all serve to improve our neighborhoods, one day at a time. And as part of the Administration’s Build Back Better plan, our members and volunteers are laser-focused on delivering programs that help prepare young Americans for the workforce; develop skills which lead to high-quality jobs; expand and create educational opportunities during a time when education has become unaffordable for too many. In short, AmeriCorps is committed to serving Americans wherever there is need. Today, there is no doubt that young Americans, older individuals, and families of every size are suffering. Now that the federal eviction moratorium ended, people are incredibly frightened and in need of relief. The federal government has supplied Emergency Rental Assistance to provide significant economic relief to individuals. However, since evictions are subject to state laws and local regulations, there is no national “one size fits all” solution. That doesn’t change the clear message from Attorney General Garland: this relief needs to get in the hands of those who need it immediately . The Attorney General, state court leaders, and advocates acknowledge that individuals need help accessing this relief right now and without delay. AmeriCorps, and the national service community, can help meet this moment and accept the Attorney General’s call to action by working in our local communities to support those in need. How can you help? Attorney General Garland’s letter provides specific suggestions for how you can help one of the more than 6 million American households who are at risk of losing their homes. Four top suggestions include: Asking our legal and community support organizations to make a commitment to offer pro bono hours and identify, in each local jurisdiction, the legal service providers who can aid in providing direct help and counseling to those who need it most. Providing legal counsel or representation to help mediate disputes and, if there are court proceedings, assistance navigating the courts. Supporting state courts, which are being encouraged to adopt eviction diversion strategies. If you are interested in assisting, perhaps by acting as a mediator or appointed counsel, contact your local court to determine if such a program exists, who is eligible to provide assistance, and how to engage with their efforts. Sharing this information and a video statement from Attorney General Garland far and wide on your social channels and throughout your communities. Together, the AmeriCorps family is more than 1.2 million strong. Our collective voice, combined with your expertise and commitment to serve, can help ensure that no person in need of assistance is left wanting. I’m asking you to again stand with AmeriCorps to help those who need us most. In service, Mal Coles Acting Chief Executive Officer Previous When COVID-19 derailed her post-graduate plans, this AmeriCorps Member Committed to a Year of Service and Empowering Women Next Four Ways for Millennials and Gen Z to Make an Impact on 9/11 Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2021-08-31/americorps-called-help-keep-families-their-homes",
    "https://www.justice.gov/ag/page/file/1428626/download",
    "https://www.justice.gov/opa/video/attorney-general-rental-assistance",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2021-08-31/americorps-called-help-keep-families-their-homes&amp;title=AmeriCorps Called on to Help Keep Families in their Homes",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2021-08-31/americorps-called-help-keep-families-their-homes&amp;title=AmeriCorps Called on to Help Keep Families in their Homes&amp;source=https://americorps.gov/blogs/2021-08-31/americorps-called-help-keep-families-their-homes",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2021-08-31/americorps-called-help-keep-families-their-homes&amp;url=https://americorps.gov/blogs/2021-08-31/americorps-called-help-keep-families-their-homes&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2021-08-26/when-covid-19-derailed-her-post-graduate-plans-americorps-member-committed-year",
    "https://americorps.gov/blogs/2021-09-07/four-ways-millennials-gen-z-make-impact-911",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA; AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2021",
  "subdomain_2": "08",
  "subdomain_3": "31"
}