{
  "id": "americorpsgov_about_agency_overview_privacy_policyhtml",
  "url": "https://americorps.gov/about/agency-overview/privacy-policy",
  "title": "privacy-policy",
  "content": "Privacy Policy | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb About Agency Overview Privacy Policy Agency Overview Agency-Wide Policies and Notices AmeriCorps Fraud Alert AmeriCorps’ Equity Action Plan Budget and Performance Plans Civil Rights for Employees, Service Members, and Volunteers Digital Strategy Disability and Accessibility Federal Register Notices FOIA and the Privacy Act No FEAR Act Open Government Plain Writing Privacy Policy Results of Grant Competitions Statutes and Regulations Strategic Plan Vulnerability Disclosure Policy AmeriCorps is committed to implementing and administering a Privacy Policy that protects AmeriCorps employees and other individuals’ personally identifiable information (PII), consistent with the principles of the Privacy Act of 1974, as amended (“The Privacy Act”) at Title 5 (U.S.C.) 552a, Section 208 of the E-Government Act of 2002, OMB Circular A-130 (July 2016), the Federal Records Act of 1950, as amended; 44 U.S.C. Chapter 31 and other applicable Federal laws, regulations, and government-wide policy. Senior Agency Official for Privacy (SAOP) – Prabhjot Bajwa Chief Privacy Officer – Bilal Razzaq Privacy Program Analyst – ZhuoHong Liu Email: privacy@americorps.gov Privacy Policy Toggle This Privacy Policy describes what general information AmeriCorps collects, how that information is used, and how information is maintained when you visit AmeriCorps public-facing websites or official AmeriCorps accounts on third-party websites and applications. AmeriCorps is committed to protecting your privacy and securing the personal information you made available to us when accessing or using our public-facing websites and applications. Information Collected and Stored Automatically When you visit our websites, AmeriCorps does not collect personal information unless you choose to provide that information. However, we do collect some general technical information about your visit to our websites. We use the aggregated information for statistical analysis to measure the number of visitors to our site and learn about the types of technology used, to detect operational problems, and to improve the website's overall security to make our websites be more useful and secure to visitors. When you access information on our websites, AmeriCorps, or a contractor operating on behalf of AmeriCorps will automatically collect and store the following basic information. The name of the internet domain The Internet Protocol (IP) address The type of browser and operating system used to access our site The date and time you access our site The internet address of the website from which you linked directly to our site The pages you visit and the information you request Information Automatically Collected by a Third-Party Website or Application AmeriCorps maintains official accounts on third-party websites and applications. These third-party website and application service providers may themselves automatically collect and store additional information about you, in accordance with their terms of service and privacy policies. AmeriCorps does not control what these third-parties service providers do with the information they collect, does not control or guarantee the accuracy, relevance, timeliness, or completeness of information contained on a linked website, and does not endorse the third-party websites. AmeriCorps strongly recommend that you review the policies of any outside websites you visit from this site. Link to External Sites AmeriCorps websites may contain links to websites created and maintained by other public or private organizations. We provide these links as a service to visitors to our site. When you follow a link to an external site, you are leaving AmeriCorps website and are subject to the privacy and security policies of the external site. Social Media AmeriCorps maintains blogs and profiles on several third-party social media sites that provide public forum for AmeriCorps to present and interact with our audiences. Any information you provide on social media sites will be visible to the public. While some Personally Identifying Information (PII) you voluntarily share may become visible and available to AmeriCorps through your use of social media, AmeriCorps will not collect, share, or store that information. Website Measurement and Customization Technologies Website measurement and customization technologies (commonly called “cookies\") are small bits of text that are downloaded to your internet browser when you visit a website. Cookies are commonly used to recognize your computer. AmeriCorps uses single-session cookies (Tier 1) to serve technical purposes, such as providing seamless navigation through our site. These cookies do not permanently record data, and they are not stored on your computer's hard drive. AmeriCorps session cookies are only available during an active browser session. When you close your browser, the session cookie disappears. AmeriCorps also uses persistent cookies (Tier 2) to help us understand how people use the site, and how we can make it better. Traffic statistics are collected anonymously and aggregated, and no information is traceable to any specific individual. AmeriCorps uses Tier 1 cookie and Tier 2 cookie on AmeriCorps websites in compliance with OMB Memorandum 10-22, Guidance for Online Use of Web Measurement and Customization Technologies . Cookies may also be set by the following third-party providers on AmeriCorps websites. Google Analytics (link is external) : A tier 2 cookie sets when the page is loaded - used to improve web metrics capabilities. You can remove or block cookies by changing the settings of your browser. For Opt-out instructions relating to cookies, please visit: https://www.usa.gov/optout-instructions . Personal Information That You Voluntarily Provide You are not required to provide any personal information to AmeriCorps to access information on our websites. If you choose to provide us with personal information, AmeriCorps may use that information to respond to your message or to fulfill the stated purpose of the communication. AmeriCorps provides visitors with a notice at the point of collection. AmeriCorps maintains and disposes of personal information you provide according to the requirements of the Federal Records Act, and the regulations and records schedules approved by the National Archives and Records Administration. In some cases, the information you provide may be covered by the Privacy Act of 1974 (Privacy Act), or subject to the Freedom of Information Act (FOIA). AmeriCorps may share information you voluntarily provide it with other entities, consistent with the Privacy Act and other applicable laws. Commercial Marketing AmeriCorps does not collect or use your personal information for commercial marketing. Children and Privacy on AmeriCorps Websites AmeriCorps do not knowingly contact or collect personal information from children under 13.  Unless otherwise stated, our websites are not intended to solicit information of any kind from children under 13. Security For site security purposes and to ensure that this service remains available to all users, AmeriCorps’ information systems, and information systems operated by contractors on behalf of the AmeriCorps, employ software programs to monitor network traffic to identify unauthorized attempts to upload or change information, or otherwise cause damage.  Anyone using these information systems expressly consents to such monitoring and is advised that if such monitoring reveals evidence of possible abuse or criminal activity, such evidence may be provided to appropriate law enforcement officials. Unauthorized attempts to upload or change information on these information systems are strictly prohibited and may be punishable by law, including the Computer Fraud and Abuse Act of 1986 and the National Information Infrastructure Protection Act of 1996. Burden and Privacy Statements Burden and Privacy Statements Breach Notification The Breach Notification Form is available to assist in properly documenting a suspected or confirmed privacy breach. Please complete the form in its entirety and return to privacy@americops.gov for processing. Completion of this form does not exempt you from properly notifying individuals affected by the breach or following any locally applicable notification procedures. Breach Response Form System of Records Notices A system of records is group of records under the control of the agency from which information about individuals is retrieved by name of the individual or some identifier assigned to the individual. The Privacy Act requires federal agencies to publish a notice in the Federal Register for each system of records that an agency maintains. The notice, known as System of Records Notice (SORN), informs the public of the purpose of the system, and other details about the system. Government-wide SORNs Toggle Government-wide SORNs maintained by other agencies may be viewed on the Federal Privacy Council (FPC) website. Agency-wide SORNs Toggle CNCS-01-OGC-Office of General Counsel (OGC) Legal Files [84 FR 45999] 09/03/2019 PURPOSE(S) OF THE SYSTEM: The Corporation for National and Community Service (CNCS) Office of General Counsel (OGC) uses the system to track, store, and manage the records it develops and acquires on matters that could or have led to investigations, mediation, or other legal actions before a judicial, administrative, or adjudicative body (collectively, “legal action records”). OGC also uses the system to track, store, and manage the records it develops and acquires to complete legal reviews, provide legal opinions, oversee transactions, coordinate with other agencies, and perform other legal activities on behalf of CNCS (collectively, “legal advice and guidance records”). CATEGORIES OF INDIVIDUALS COVERED BY THE SYSTEM: Categories of individuals covered by the system may include individuals who are or were involved in: Potential or actual legal actions with CNCS or referenced in the legal action. That may include parties to the legal action, mediators, arbiters, judges, other court personnel, witnesses, individuals with information that pertains to the legal action, CNCS employees, grantees, service members, and applicants. A transaction with CNCS, contract involving CNCS, or a CNCS program or matter that involves a legal or compliance review or other legal activity. CNCS-02-OGC-FOIA/PA-Freedom of Information Act (FOIA)/Privacy Act (PA) Request Files [84 FR 18268] 4/30/2019 PURPOSE(S) OF THE SYSTEM: The Corporation for National and Community Service (CNCS) Office of General Counsel uses the system to: Track, process, and respond to CNCS's FOIA and Privacy Act inquiries and any disputes involving those inquiries (collectively, “Requests”); Create reports about those Requests for oversight and reporting purposes; and Execute other responsibilities related to those Requests. CATEGORIES OF INDIVIDUALS COVERED BY THE SYSTEM: The system contains records about individuals who: Sent a written Request to CNCS which cited to, or was handled according to, FOIA or the Privacy Act, plus anyone who represented those individuals (collectively, “Requestors”); Participate in responding to a Request on behalf of CNCS (collectively, “Respondents”); Are the subject of a Request; Are referenced in the requested records; and Are otherwise connected to a Request. CNCS-03-OIG-Investigative Files [85 FR 2723] 01/16/2020 PURPOSE(S) OF THE SYSTEM: The Corporation for National and Community Service (CNCS) Office of Inspector General (CNCS-OIG) uses the system to track and maintain the files acquired and developed when CNCS-OIG investigates individuals associated with a CNCS program or operation pursuant to the Inspector General Act of 1978, as amended. CNCS-OIG is statutorily directed to conduct and supervise investigations relating to CNCS programs and operations to promote economy, efficiency and effectiveness in the administration of such programs and operations, and to prevent and detect fraud, waste and abuse in such programs and operations. Accordingly, the records in the system are used to investigate individuals and entities suspected of having committed illegal or improper acts and to conduct criminal prosecutions, civil proceedings, and administrative actions against those individuals and entities. CATEGORIES OF INDIVIDUALS COVERED BY THE SYSTEM: In connection with CNCS-OIG's investigative duties, the system maintains records on the following categories of individuals: Individuals or entities that are or have been the subject of inquiries or investigations conducted by CNCS-OIG. These include current and former employees of CNCS, and current and former contractors (or applicants for contracts), subcontractors, consultants, or the recipients of (or applicants for) CNCS grants, subgrants, or cooperative agreements, and their current or former employees; and, Individuals who are witnesses, complainants, confidential or nonconfidential informants, and other parties who have been identified by CNCS-OIG (on the basis of information received or developed by CNCS-OIG) as potentially possessing information relevant to an investigation under CNCS-OIG's jurisdiction. CNCS–04–CPO–MPMF–Member Program Management Files (MPMF) [89 FR 65866] 08/13/2024 PURPOSE(S) OF THE SYSTEM: AmeriCorps uses the system to select, place, manage, oversee, and support individuals who apply to become an AmeriCorps service member (Applicants), and those who are or have been an active AmeriCorps service member (Members). AmeriCorps also uses the system to track and support the post service career pathway development of AmeriCorps alumni who continuously show interest or/and actively participate in AmeriCorps’ collaborative programs with other Federal, State, or local agencies or Tribes. CATEGORIES OF INDIVIDUALS COVERED BY THE SYSTEM: The system contains records about individuals who apply to become an AmeriCorps Service Member, individuals who are or have been an active AmeriCorps Service Member, individuals from the public asked to provide a reference for those individuals (References), and AmeriCorps alumni. CNCS–05–OEA–SNPE Social Network and Public Engagement System of Records [88 FR 30728] 05/12/2023 PURPOSE(S) OF THE SYSTEM: The information is being collected in the system to support AmeriCorps' external interactions concerning its programs. The Agency uses social network platforms and its websites to increase its collaboration and transparency with the public, as well as with employees, members, grantees, contractors, and others who are interested in AmeriCorps' programs and services. The system will enable AmeriCorps to effectively expand its public outreach, interact with the public in meaningful ways, and encourage wide sharing of information about AmeriCorps' programs. AmeriCorps will also use the information for program analytics, program segmentation research, and administrative purposes to ensure quality control, program performance, and improving management processes. CATEGORIES OF INDIVIDUALS COVERED BY THE SYSTEM: The system contains records about these categories of individuals: users of social networks who interact with AmeriCorps through the Agency's website, or through various social network outlets, including but not limited to third-party sites, services such as Meta, YouTube, LinkedIn, or other social media platforms. Other covered individuals may include those who sign on to various parts of AmeriCorps' website with a user identity, including but not limited to sites and services such as Meta and Twitter. These may be public individuals, members and grantees of AmeriCorps programs, and AmeriCorps employees and contractors. CNCS-06-CPO-ACB-AmeriCorps Child Care Benefit System (ACB) [84 FR 46002] 09/03/2019 PURPOSE(S) OF THE SYSTEM: The Corporation for National and Community Service (CNCS) uses the system to manage, administer, and evaluate the child care benefits program offered to eligible AmeriCorps Service Members (Members). CATEGORIES OF INDIVIDUALS COVERED BY THE SYSTEM: The system contains information about Members who have applied for, or received, child care benefits, plus their AmeriCorps supervisors, children who required child care, spouses, and other household members. CNCS-10-CEO-PHRI-Personal Health and Religious Information [86 FR 64458] 11/18/2021 PURPOSE(S) OF THE SYSTEM: AmeriCorps' Equal Employment Opportunity Program (EEOP) proposes to collect this information to maintain personal health and religious information collected in response to (1) medical-based and religious-based reasonable accommodation requests; (2) public health emergency or similar health and safety incidents, such as a pandemic, epidemic, or man-made emergency; and/or (3) any other lawful collection of health-related information that is necessary to ensure a safe and healthy environment for individuals who are occupying AmeriCorps facilities, attending AmeriCorps-sponsored events, participating in AmeriCorps programs, or otherwise engaged in official business on behalf of the agency. The system will assist the agency in the collection, storing, dissemination, and disposal of personal health and religious information collected and maintained by the agency. CATEGORIES OF INDIVIDUALS COVERED BY THE SYSTEM: Individuals covered by the system include all AmeriCorps employees (including political appointees, career employees, detailees, and interns), applicants and candidates for employment, contractors, national service members, volunteers, applicants and candidates for AmeriCorps national service programs, and visitors to AmeriCorps facilities. This includes authorized individuals or representatives who file a request for a reasonable accommodation on behalf of any of the above-referenced parties. CNCS-10-CEO-CRCM-Civil Rights Case Management System of Records [89 FR 33336] 05/29/2024 PURPOSE(S) OF THE SYSTEM: CRCM enables AmeriCorps' Office of Diversity, Equity, Inclusion, and Accessibility to modernize the Title VI Civil Rights complaint filing management and conduct streamlined complaint intake, counseling, and investigation under current legal authorities. CATEGORIES OF INDIVIDUALS COVERED BY THE SYSTEM: The system covers individuals who have filed informal or formal complaints with, or against, AmeriCorps, including any recipient of services, programs, or benefits from AmeriCorps or one of its programs; AmeriCorps members, applicants, or trainees for volunteer or service status, or employees of a grantee or program beneficiary. CNCS–11–CPO–AHB-AmeriCorps Health Benefits System of Records [88 FR 30728] 07/28/2023 PURPOSE(S) OF THE SYSTEM: AmeriCorps and its contractors use the system to track, store, manage, and evaluate the records associated with the health benefits offered to the members of AmeriCorps VISTA, AmeriCorps NCCC, and AmeriCorps FEMA Corps. CATEGORIES OF INDIVIDUALS COVERED BY THE SYSTEM: The system contains records about (1) current and former Members, (2) individuals who maintained an insurance policy that covered a Member, and (3) individuals connected to an accident or injury that resulted in a Member seeking medical care. CNCS-20-COO-ERC Emergency Response Communication System of Records [89 FR 21498] 03/28/2024 PURPOSE(S) OF THE SYSTEM: AmeriCorps uses this system to collect and maintain the contact information of its personnel to whom the system will send emergency notifications. AmeriCorps uses this system to execute pre-defined communication processes in emergency situations and to administer its operational response to critical events to maintain business continuity and to keep its personnel safe. CATEGORIES OF INDIVIDUALS COVERED BY THE SYSTEM: The federal employees and contractors of AmeriCorps. Momentum Financials Open Obligations and Automated Disbursement Files—Corporation-1* Momentum Financials Accounts Receivable Files—Corporation-2* Employee and Applicant Records Files—Corporation-5* Counselors’ Report Files—Corporation-9* Discrimination Complaint Files—Corporation-10* Employee Pay and Leave Record Files—Corporation-11* Merit Promotion Plan Files—Corporation-14* Momentum Financials Vendor Files—Corporation-17* USA Freedom Corps Record of Service—Corporation-19* *The official System of Records Notice was published in the Federal Register on January 30, 2002 ( 67 FR 4395-4410 ) or July 25, 2002 ( 67 FR 48616-48617 ). If it references the General Routine Uses contained in Preliminary Statement , that was included in the publication on January 30, 2002 ( 67 FR 4395-4410 ). Any exemptions noted in the SORNs were published in the Code of Federal Regulations at 45 CFR 2508.19 . Read the Privacy Act Implementation Rules 45 U.S.C. 2508 , AmeriCorps Implementation of the Privacy Act of 1974. Privacy Impact Assessments Toggle Privacy Impact Assessments (PIAs) have been completed for the AmeriCorps general support system and all major applications. AmeriCorps collects and maintains a limited amount of personally identifiable information from applications to serve in AmeriCorps and AmeriCorps Seniors programs and applications to become a grantee organization. This information is used to process the application and subsequently manage and support AmeriCorps members, volunteers, and grantees. The process for collecting and maintaining personally identifiable information within AmeriCorps’ Network, Momentum, ESPAN, and the Health and Childcare information systems meets the requirements set by OMB Memorandum 03-22.* The following are the PIAs for AmeriCorps: AmeriCorps Child Care Benefit System (ACB) PIA AmeriCorps Health Benefits System (AHB) PIA eSPAN PIA Equal Employment Opportunity (EEO) PIA Everbridge PIA General Support System (GSS) PIA Momentum PIA AmeriCorps Online Ordering System (OOS) PIA AmeriCorps Public Websites (PUB) PIA FedHR Navigator PIA Webgrants PIA Civil Rights Interface (CRI) PIA OfficeSpace PIA GovDelivery PIA Everlaw PIA American Climate Corps (ACC) PIA *Personally Identifiable Information (PII) is defined by OMB as any information about an individual maintained by an agency, including, but not limited to, education, financial transactions, medical history, and criminal or employment history and information which can be used to distinguish or trace an individual's identity, such as their name, social security number, date and place of birth, mother’s maiden name, biometric records, etc., including any other personal information which is linked or linkable to an individual. Submit a Privacy Act Request Toggle §2508.13 What Are the Procedures for Acquiring Access to AmeriCorps Records by an Individual About Whom a Record is Maintained? a) Any request for access to records from any individual about whom a record is maintained will be addressed to AmeriCorps, Office of the General Counsel, Attn: Privacy Act Officer, 250 E Street SW., Washington, DC 20525, or delivered in person during regular business hours, whereupon access to his or her record, or to any information contained therein, if determined to be releasable, shall be provided. b) If the request is made in person, such individual may, upon his or her request, be accompanied by a person of his or her choosing to review the record and shall be provided an opportunity to have a copy made of any record about such individual. c) A record may be disclosed to a representative chosen by the individual as to whom a record is maintained upon the proper written consent of such individual. d) A request made in person will be promptly complied with if the records sought are in the immediate custody of AmeriCorps. Mailed requests or personal requests for documents in storage or otherwise not immediately available, will be acknowledged within 10 working days, and the information requested will be promptly provided thereafter. e) With regard to any request for disclosure of a record, the following procedures shall apply: Medical or psychological records shall be disclosed to an individual unless, in the judgment of AmeriCorps, access to such records might have an adverse effect upon such individual. When such determination has been made, AmeriCorps may require that the information be disclosed only to a physician chosen by the requesting individual. Such physician shall have full authority to disclose all or any portion of such record to the requesting individual in the exercise of his or her professional judgment. Test material and copies of certificates, the disclosure of which would violate the privacy of any other individual or be otherwise exempted by the provisions of the Privacy Act, shall be removed from the record before disclosure to any individual to whom the record pertains. [64 FR 19294, Apr. 20, 1999, as amended at 81 FR 12600, Mar. 10, 2016] PART 2508—IMPLEMENTATION OF THE PRIVACY ACT OF 1974 Computer Matching Program Toggle Computer Matching Agreement (CMA) With... Current CMA Federal Notice of CMA Annual Matching Activity Report Social Security Administration Link to current CMA Link to federal notice Link to current activity report Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/about/agency-overview/privacy-policy",
    "http://www.whitehouse.gov/sites/default/files/omb/assets/memoranda_2010/m10-22.pdf",
    "http://www.google.com/intl/en/privacy/",
    "https://www.usa.gov/optout-instructions",
    "https://www.fpc.gov/resources/SORNs/",
    "https://www.federalregister.gov/documents/2019/09/03/2019-18918/privacy-act-of-1974-system-of-records",
    "https://www.federalregister.gov/documents/2019/04/30/2019-08657/privacy-act-of-1974-system-of-records",
    "https://www.federalregister.gov/documents/2020/01/16/2020-00581/privacy-act-of-1974-system-of-records",
    "https://www.federalregister.gov/documents/2024/08/13/2024-17951/privacy-act-of-1974-system-of-records",
    "https://www.federalregister.gov/documents/2023/05/12/2023-10164/privacy-act-of-1974-system-of-records",
    "https://www.federalregister.gov/documents/2019/09/03/2019-18917/privacy-act-of-1974-system-of-records",
    "https://www.federalregister.gov/documents/2021/11/18/2021-24868/privacy-act-of-1974-system-of-records",
    "https://www.federalregister.gov/documents/2024/04/29/2024-09147/privacy-act-of-1974-system-of-records",
    "https://www.federalregister.gov/documents/2023/07/28/2023-16026/privacy-act-of-1974-system-of-records",
    "https://www.federalregister.gov/documents/2024/03/28/2024-06602/privacy-act-of-1974-system-of-records",
    "https://www.govinfo.gov/app/details/FR-2002-01-30/02-2240",
    "https://www.govinfo.gov/app/details/FR-2002-07-25/02-18820",
    "https://nationalservice.gov/sites/default/files/page/privacy_pdf/General%20Routine%20Uses%20contained%20in%20Preliminary%20Statement.pdf",
    "https://www.govinfo.gov/app/details/FR-2002-01-30/02-2240",
    "https://www.ecfr.gov/cgi-bin/text-idx?SID=dcfe3a111aac84203f743e9ac1f18990&amp;mc=true&amp;node=se45.4.2508_119&amp;rgn=div8",
    "https://www.ecfr.gov/cgi-bin/text-idx?SID=a2de38796b462e6931a250a0be857816&amp;mc=true&amp;tpl=/ecfrbrowse/Title45/45cfr2508_main_02.tpl",
    "https://www.ecfr.gov/cgi-bin/text-idx?SID=a2de38796b462e6931a250a0be857816&amp;mc=true&amp;node=se45.4.2508_113&amp;rgn=div8",
    "https://www.federalregister.gov/documents/2018/08/29/2018-18684/privacy-act-of-1974-matching-program",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/AmeriCorps-Burden-and-Privacy-Statements-2024-02.pdf",
    "https://americorps.gov/sites/default/files/document/Breach_Response_Form.pdf",
    "https://americorps.gov/sites/default/files/document/ACB%20PIA_%20FFP_16032023.pdf",
    "https://americorps.gov/sites/default/files/document/AHB%20PIA.pdf",
    "https://americorps.gov/sites/default/files/document/eSPAN%20PIA_Final%20for%20Publication_0.pdf",
    "https://americorps.gov/sites/default/files/document/EEO%20PIA%202023.pdf",
    "https://americorps.gov/sites/default/files/document/Everbridge%20PIA%202023.pdf",
    "https://americorps.gov/sites/default/files/document/GSS%20PIA%20-%202023.pdf",
    "https://americorps.gov/sites/default/files/document/Momentum%20PIA.pdf",
    "https://americorps.gov/sites/default/files/document/OOS%20PIA%202023.pdf",
    "https://americorps.gov/sites/default/files/document/AmeriCorps%20Public%20Websites%20%28PUB%29%20PIA_V4_Publish.pdf",
    "https://americorps.gov/sites/default/files/document/FedHR%20PIA%202024.pdf",
    "https://americorps.gov/sites/default/files/document/WebGrant%20PIA%20for%20Publication.pdf",
    "https://americorps.gov/sites/default/files/document/CRI%20PIA%20-%202023%20-%20Publication.pdf",
    "https://americorps.gov/sites/default/files/document/OfficeSpace%20PIA%202023.pdf",
    "https://americorps.gov/sites/default/files/document/Privacy%20Impact%20Assessment%20Form%20_V4%20for%20GovDelivery%20Final%2010012024.pdf",
    "https://americorps.gov/sites/default/files/document/Everlaw%20PIA%202023.pdf",
    "https://americorps.gov/sites/default/files/document/American%20Climate%20Corps%20%28ACC%29%20PIA_PUBLISHING_ES_10OCT24.pdf",
    "https://americorps.gov/sites/default/files/documents/Number_23_2018-18684.pdf",
    "https://americorps.gov/sites/default/files/documents/Number%2018%20-%202016-03164.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC; AmeriCorps VISTA; AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "about",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "about",
  "subdomain_1": "agency-overview"
}