{
  "id": "americorpsgov_blogs_2020_04_20_senior_corps_shares_innovative_ways____safe_volunteering____continueshtml",
  "url": "https://americorps.gov/blogs/2020-04-20/senior-corps-shares-innovative-ways-___safe-volunteering___-continues",
  "title": "senior-corps-shares-innovative-ways-___safe-volunteering___-continues",
  "content": "Senior Corps Shares Innovative Ways ‘Safe Volunteering’ Continues | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Senior Corps Shares Innovative Ways ‘Safe Volunteering’ Continues Submitted by admin on Mon, 04/20/2020 - 09:27 Apr 20, 2020 Deborah Cox-Roush, Senior Corps Director A message to our Senior Corps grantees: I’d like to share some examples of how different Senior Corps organizations are finding the light in this difficult time. Thank you for all you do. I have such admiration and respect for the volunteer service that continues in communities through your programs. Each day, I am in awe while reading about how many of you are finding new ways for your volunteers to continue to participate in their regular service activities or you are finding innovative ways to transition what would normally be face-to-face service to “safe volunteering” service activities. Not only are you finding ways to support your volunteers during this time, but you are finding ways to continue the vital services you perform. Thank you for packing and delivering groceries; taking meals to homebound individuals; providing curbside pickup service for individuals; providing telephone reassurance wellness calls to check on seniors living alone, along with the other activities too numerous to list. We are seeing so much creativity in how you’re delivering services that I wanted to share a few examples: Emergency Volunteer Recruitment: Working remotely, one RSVP program partnered with the local Department of Health and Human Services to coordinate emergency volunteer recruitment and nonprofit needs assessment efforts to combat the effects of the pandemic on seniors, the disadvantaged, and others at-risk throughout three counties. Volunteers register with RSVP, which then sends them to the nonprofits most in need of support Sewing Mask and Gowns: Programs are recruiting volunteers and sewing clubs to make face masks to be used by medical professionals, first responders, senior centers, and other facilities in need. Some are also sewing hospital gowns Medicare Counsel: Counselors were granted access to work phones so they could continue their telephone counseling Social Distance Transportation: Volunteers continue providing transportation to critical medical appointments, pharmacies, and grocery stores. Volunteers and clients are provided gloves and masks, and clients ride in the back seat as far from the volunteer as possible VITA Tax Service: Three days per week, volunteers provide a pick-up and drop-off service for tax clients Quick Action Groups: RSVP leaders, along with other local community organization leaders, mobilized to develop a Quick Action Group to provide services for high-risk populations affected by the pandemic Monthly In-Service/Recognition: Programs holding monthly in-service and recognition activity via Zoom conference calls and mailing newsletters, timesheets, and recognition certificates to volunteers Developing Intergenerational Relationships: Middle and high school students are being recruited to make phone calls and develop relationships with RSVP volunteers Money Management Program: Transitioned in-person volunteer money management assistance service to provide tele-bill paying assistance to include a review of possible COVID-19 fraud and scams affecting elder clients. Volunteers also helped develop a partner COVID Transportation Task Force to address essential medical appointments such as dialysis, radiation, and chemotherapy treatments Pen Pal Program: Program director and school teachers worked together to ensure that the Foster Grandparents could remain in touch with their students by writing letters and emails to each other Senior Care Calls: RSVP program developed a “Senior Care Calls” initiative to check on isolated and homebound seniors Senior Social Support: Senior Companions shifted their schedules to provide wellness checks and social support to their clients via phone. Companions and staff make daily calls to provide wellness checks, information and referral support, and socialization. They also continue to assist their clients with grocery deliveries, medication deliveries, helping reschedule doctor appointments, enrolling clients for mobile meals, and connecting folks to mental health support services through these phone visits Volunteer-to-Volunteer Calls: As many live alone, volunteers are placing wellness checks by calling their colleagues to ensure that they are safe and healthy Stress-Reduction Support: Using email, volunteers distribute information on depression and stress reduction, call to inquire about any anxiety issues, and provide referrals to call for help Again, these are only just a few examples of how you are continuing to serve your communities. Activities like these deserve a spotlight. I am so proud to be your national leader at this moment. Stay safe. Stay healthy. And remember, America Works Together! Deborah Cox-Roush is the Director of Senior Corps. Previous Corporation for National and Community Service & AmeriCorps NCCC Donate Surplus N95 Masks to Louisiana Next Volunteering Brings out the Best in America Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2020-04-20/senior-corps-shares-innovative-ways-%E2%80%98safe-volunteering%E2%80%99-continues",
    "https://www.nationalservice.gov/programs/senior-corps",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2020-04-20/senior-corps-shares-innovative-ways-%E2%80%98safe-volunteering%E2%80%99-continues&amp;title=Senior Corps Shares Innovative Ways ‘Safe Volunteering’ Continues",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2020-04-20/senior-corps-shares-innovative-ways-%E2%80%98safe-volunteering%E2%80%99-continues&amp;title=Senior Corps Shares Innovative Ways ‘Safe Volunteering’ Continues&amp;source=https://americorps.gov/blogs/2020-04-20/senior-corps-shares-innovative-ways-%E2%80%98safe-volunteering%E2%80%99-continues",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2020-04-20/senior-corps-shares-innovative-ways-%E2%80%98safe-volunteering%E2%80%99-continues&amp;url=https://americorps.gov/blogs/2020-04-20/senior-corps-shares-innovative-ways-%E2%80%98safe-volunteering%E2%80%99-continues&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2020-04-08/corporation-national-and-community-service-americorps-nccc-donate-surplus-n95-masks",
    "https://americorps.gov/blogs/2020-04-20/volunteering-brings-out-best-america",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2020",
  "subdomain_2": "04",
  "subdomain_3": "20"
}