{
  "id": "americorpsgov_blogs_2020_05_15_americorps_vista_helped_save_his_life_now_he___s_working_do_samehtml",
  "url": "https://americorps.gov/blogs/2020-05-15/americorps-vista-helped-save-his-life-now-he___s-working-do-same",
  "title": "americorps-vista-helped-save-his-life-now-he___s-working-do-same",
  "content": "AmeriCorps VISTA Helped Save His Life. Now He’s Working to Do the Same. | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps VISTA Helped Save His Life. Now He’s Working to Do the Same. Submitted by admin on Fri, 05/15/2020 - 09:03 May 15, 2020 Nicole Jackson Nothing went horribly wrong for Mikah Wagner to end up at a homeless shelter at 19. A fight with his stepmom and no other place to go led him to a youth shelter, a place he was grateful for, but also a place where he struggled. A few years later, this is the exact message he wants to get through to people: “It can happen to anybody so quickly. People don’t really understand how quickly you can fall into this place where you feel like you have no options, and then you’re trapped.” It was this passion for sharing his story through public speaking and advocacy that led Mikah to AmeriCorps VISTA, an experience he would later call “magical.” While speaking at a conference, Mikah was invited to help lead a new initiative: Metro Denver Homeless Initiative’s (MDHI) Youth Action Board, where young adults who have experienced homelessness work to use their knowledge and expertise to improve how youth services are provided. Within months of joining, the team at MDHI invited Mikah to be part of its AmeriCorps VISTA program. The AmeriCorps VISTA program came into Mikah’s life at a time when he desired to do something that mattered. This was his opportunity to not only help the voices of youth with lived experience to be heard, but it was also his chance to commit himself fully to something of significance. AmeriCorps VISTA was his opportunity to gain direction and the life skills he felt he had been missing. He jumped in, continuing the work he started with the Youth Action Board, and took on new responsibilities that included helping support MDHI’s committees, helping to manage the organization’s last resort funding stream for those trying to get into housing, and the Point-in-Time, an annual count of people experiencing homelessness in the area. Being an AmeriCorps VISTA coupled with the opportunity to support a group he knew so well, empowered Mikah. His work helped make change happen - to policies, to the way people thought, and to the way equity was approached. As Mikah’s year of service was coming to an end, he had a “surreal experience.” He went back to the youth shelter where he had stayed and served breakfast. “Being able to give service to people who are in a situation very similar to my own a few years ago brought me a huge amount of pride.” Hearing Mikah talk about his experience as an AmeriCorps VISTA is like hearing someone explain how it felt winning the lottery: “VISTA saved my life in a lot of ways.” He does have a word of caution to those thinking of joining AmeriCorps VISTA: “VISTA is fantastic if you approach it the way it needs to be approached. If you give yourself for a year to really commit to something and help it benefit your community, it’s an invaluable opportunity to learn a lot of skills, learn about a community, and influence how programs in your community are assisting people. It’s magical.” Mikah is now an employee at MDHI, where he serves as the Operations and Administrative Assistant. Due to COVID-19, his organization is working from home while also continuing their work for the Denver metro community. They have put together resource guides and have led online trainings to support those who work in homeless services better serve their communities through the COVID-19 pandemic. Having experienced life at a homeless shelter, he knows the dangers people are facing dealing with a highly transmittable virus while in a shelter. Although Mikah sees the strain communities are going through and will continue to face, he is hopeful. When asked for inspiration particularly for those who will be facing a new reality, Mikah’s parting words were a reminder of his will to not only survive but thrive: “We have to go back to living.” Previous May 14 Update: AmeriCorps and Senior Corps COVID-19 Response Next May 22 Update: AmeriCorps and Senior Corps COVID-19 Response Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2020-05-15/americorps-vista-helped-save-his-life-now-he%E2%80%99s-working-do-same",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2020-05-15/americorps-vista-helped-save-his-life-now-he%E2%80%99s-working-do-same&amp;title=AmeriCorps VISTA Helped Save His Life. Now He’s Working to Do the Same.",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2020-05-15/americorps-vista-helped-save-his-life-now-he%E2%80%99s-working-do-same&amp;title=AmeriCorps VISTA Helped Save His Life. Now He’s Working to Do the Same.&amp;source=https://americorps.gov/blogs/2020-05-15/americorps-vista-helped-save-his-life-now-he%E2%80%99s-working-do-same",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2020-05-15/americorps-vista-helped-save-his-life-now-he%E2%80%99s-working-do-same&amp;url=https://americorps.gov/blogs/2020-05-15/americorps-vista-helped-save-his-life-now-he%E2%80%99s-working-do-same&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2020-05-14/may-14-update-americorps-and-senior-corps-covid-19-response",
    "https://americorps.gov/blogs/2020-05-22/may-22-update-americorps-and-senior-corps-covid-19-response",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2020",
  "subdomain_2": "05",
  "subdomain_3": "15"
}