{
  "id": "americorpsgov_evidence_exchange_Analysis_of_the_AmeriCorps_NCCC_Service_Project_Database__How_NCCC_Service_Projects_Strengthen_Communities_and_Impact_Members_Final_Reporthtml",
  "url": "https://americorps.gov/evidence-exchange/Analysis-of-the-AmeriCorps-NCCC-Service-Project-Database_-How-NCCC-Service-Projects-Strengthen-Communities-and-Impact-Members---Final-Report",
  "title": "Analysis-of-the-AmeriCorps-NCCC-Service-Project-Database_-How-NCCC-Service-Projects-Strengthen-Communities-and-Impact-Members---Final-Report",
  "content": "Analysis of the AmeriCorps NCCC Service Project Database: How NCCC Service Projects Strengthen Communities and Impact Members - Final Report | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Analysis of the AmeriCorps NCCC Service Project Database: How NCCC Service Projects Strengthen Communities and Impact Members - Final Report Back AmeriCorps National Civilian Community Corps (NCCC) is one of AmeriCorps’ core programs, which engages people between the ages 18-24 in a ten-month, full-time term of team-based, residential national service. AmeriCorps, formerly known as Corporation for National and Community Service (CNCS), contracted JBS International to support NCCC’s efforts in assessing its impact on member development and strengthening communities. JBS first constructed a prototype AmeriCorps NCCC Service Projects Database (SPD) containing sample project information and was subsequently awarded a second contract to populate the database with qualitative and quantitative project information on the NCCC service projects from FY 2012 to Spring 2019 across all campuses and analyze that data. The database contains information on 5,004 NCCC service projects completed between 2012 and Spring of 2019 from the four regional campuses plus 120 service projects randomly selected from the Atlantic campus. It includes information on things like project issue area, characteristics, sponsor organization information, and goals and accomplishments. The two primary purposes of the database are to: Capture key data about NCCC service projects in one location where data can be analyzed both across and within projects Support the selection of case studies for a NCCC study Study Goals The purpose of the report is to describe the types and characteristics of service projects and understand how NCCC service projects strengthen communities and affect members. Research Questions There are two sets of research questions based on the study goals: Characteristics of service projects: What are the characteristics of NCCC service projects by issue/focus areas? What are NCCC’s service project accomplishments to communities by issue/focus areas? How has the type of sponsor changed over time? How have the characteristics of NCCC service projects changed over time? What are the characteristics of recurring service projects? What community needs have service projects addressed over time by issue/focus areas? How frequently does NCCC serve the same community with the same needs? How many individual service projects are nested within unique sponsors? What is the number of sites and the average number of sites for each sponsor type? Understanding service project impact: What does the data show on how NCCC projects impact and strengthen communities? What does the data show on how NCCC projects impact members? Do these impacts vary and, if so, how? What are the main themes associated with strengthening communities and Member impact? What are NCCC’s service project contributions: to communities’ disaster preparation and mitigation? to support recovery and response in communities that experienced disaster? in building community and organization capacity? Findings Characteristics of NCCC Service Projects and Communities Served Analysis of the database reveals the following top-level results regarding the characteristics of NCCC service projects and the communities they serve: The top three issue areas are: Natural and Other Disasters, which made up 50% of AmeriCorps NCCC service projects Urban and Rural Development service projects, with 26% of projects Environmental Stewardship and Conservation service projects, which accounted for 18%. Service projects typically had multiple project characteristics, which describe the general purpose of the project and are related to accomplishments Service project characteristics most often reported were community support (41%), at-risk ecosystems (34%), infrastructure improvement (34%), and capacity building and leverage (34%). Community support and at-risk ecosystems were recurring characteristics across the five primary issue areas. Infrastructure improvement is also a recurring characteristic across all the primary issue areas, but only 5% of service projects reported Infrastructure Improvement as their primary issue area. Lastly, Capacity building and leverage characteristics were noted in four of the five primary issue areas, but this characteristic is most frequently reported under service projects in the natural and other disasters primary issue area. The greatest number of accomplishments or outputs were reported in the Natural and Other Disasters primary issue area with 9,250 outputs, and these accomplishments were reported under the disaster recovery, disaster prevention preparedness and mitigation, and disaster response categories. Service projects in the Environmental Stewardship, and Urban and Rural Development primary issue areas had the second greatest number of reported accomplishments or outputs, with more than 6,000. In these two primary issue areas, the categories with high numbers of reported accomplishments include natural resources and community well-being. Between 2012 and 2019, 1,439 unique sponsors were associated with the 5,004 service projects. The Federal Government, national non-profits, and other non-profits sponsored most service projects between 2012 and 2018. The Federal Government most frequently sponsored service projects in the Natural and Other Disaster issue area. Strengthening Communities and Impact on Members Analysis of the database reveals the following top-level results of how service projects strengthen communities and the impacts on Corps Members: Service projects supported communities by providing direct impacts including tangible and intangible benefits to both individuals and organizations, enhancing disaster prevention, preparedness, and mitigation, and assisting communities with disaster recovery. The most common organization-level impacts noted were in infrastructure support, which included enhancing an organization’s data infrastructure or physical infrastructure. Infrastructure support also included Members organizing and conducting inventory of an organization’s supplies or donations. The most common community-level impacts of NCCC service projects were on the built and natural capital of communities through work on improving accessibility to public structures; building trails, gardens and farms; and supporting youth camps. The most common individual-level impacts are on helping people meet basic needs such as accessing food and shelter, receiving disaster assistance, and developing human capital and learning through teaching volunteers or tutoring youth. About half of all service projects during the eight-year period involved disaster services. Projects that focused on disaster prevention, preparedness, and mitigation most commonly reported enhancing disaster knowledge and preparedness by assembling and distributing informational materials and by providing information to individuals.’ Disaster response projects most commonly reported impacts associated with organizational effectiveness, such as supporting disaster service facilities or volunteer facilities in disaster areas. Disaster recovery projects most commonly reported impacts associated with organizational infrastructure, for example developing resource guides or reports or completing damage or needs assessments Specific populations assisted by projects include military veterans, individuals in crisis (such as disaster survivors or the homeless), immigrants and refugees, disabled persons, the elderly, at-risk youth, and Members of Native American communities. Many projects supported more than one vulnerable population. Impacts of projects on Corps Members included enhancing personal and life skills, building professional skills, growing interpersonal skills, and fostering an understanding of civic engagement. The most commonly reported impacts on Members were enhancing construction and environmental management skills, increasing communication skills, building leadership skills, and fostering personal growth in areas like adaptability and confidence. Full Report Fact Sheet Full report Full Report SPD Final Research Report - Final Report_508.pdf Further information Program/Intervention NCCC Service Project Database Implementing Organization AmeriCorps NCCC AmeriCorps Program(s) AmeriCorps NCCC Focus Population(s)/Community(s) Rural Suburban Urban Low-income Outcome Category Energy efficiency At-risk ecosystems Awareness of environmental issues Green jobs Disaster assistance provided Veterans and military families served Benefit to national service members/volunteers Nonprofit development Improving AmeriCorps Study Type(s) Case Study or Descriptive Review or Meta-analysis Study Design(s) Non-experimental Researcher/Evaluator JBS International Published Year 2020 Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/evidence-exchange/Analysis-of-the-AmeriCorps-NCCC-Service-Project-Database%3A-How-NCCC-Service-Projects-Strengthen-Communities-and-Impact-Members---Final-Report",
    "https://americorps.gov/sites/default/files/evidenceexchange/SPD%20Final%20Research%20Report%20-%20Final%20Report_508_1.pdf",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/SPD%20Fact%20Sheet_11072023_final_508.pdf",
    "https://americorps.gov/sites/default/files/evidenceexchange/SPD%20Final%20Research%20Report%20-%20Final%20Report_508_1.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC",
  "focus_population": [
    "Rural",
    "Suburban",
    "Urban",
    "Low-income"
  ],
  "ages_studied": [],
  "resource_type": "evidence-exchange",
  "topic": "",
  "year": "",
  "domain": "evidence-exchange"
}