{
  "id": "americorpsgov_blogs_2020_07_15_americorps_members_helping_illinois_respond_covid_19html",
  "url": "https://americorps.gov/blogs/2020-07-15/americorps-members-helping-illinois-respond-covid-19",
  "title": "americorps-members-helping-illinois-respond-covid-19",
  "content": "AmeriCorps Members Helping Illinois Respond to COVID-19 | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps Members Helping Illinois Respond to COVID-19 Submitted by admin on Wed, 07/15/2020 - 11:09 Jul 15, 2020 Barbara Stewart Last week, I visited an AmeriCorps program at Chicago’s Northwestern Settlement. Visiting AmeriCorps members in Illinois is always special for me because of my own Prairie State roots – and a rare treat in this age of social distancing. At CNCS, we believe that our communities, states, and country are better when people work together to solve challenges. I am proud of how our national service community has continued to step up during the pandemic. As our nation responds to COVID-19, AmeriCorps and Senior Corps continue to do amazing things. In Chicago alone, hundreds of AmeriCorps members have been helping combat food insecurity, tutoring and mentoring students virtually, and even supporting medical volunteer recruitment and contact tracing efforts. Serve Illinois has even activated their Illinois Disaster Corps to help coordinate medical volunteers through IllinoisHelps/Medical Reserve Corps, in partnership with American Red Cross. I saw a passion for service on the faces of the five AmeriCorps members I visited. They spoke about their backgrounds, their interests, what inspired them to serve, and the careers they hoped to pursue. They had signed on to an education-focused program, but COVID-19 changed that plan. Their community’s needs shifted with the pandemic’s arrival. Suddenly, new tasks were paramount, like distributing PPE and food to those in need. I was incredibly inspired to see their resilience. When COVID-19 hit, they did not turn away. Instead, they asked where their community could best put them to use. I also saw a passion to serve in a Northwestern Settlement staff member, Yasmin, who works with the AmeriCorps program and has been working on-site since the pandemic hit. While I was inside thanking the members for their service, Yasmin headed back outside, back into the heat, to finish handing out needed supplies to her neighbors. It is this kind of servant leadership that will allow us to survive - and even thrive - in these difficult times. To all of our national service partners: thank you for your service, because we all are counting on you.  Know that your work matters. Know that every day you are making a difference, and that you are bringing out the best in all of us. Previous June 19: COVID-19 AmeriCorps and Senior Corps Story Round-Up Next Iowa Governor Visits AmeriCorps Site Tackling Food Insecurity Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2020-07-15/americorps-members-helping-illinois-respond-covid-19",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2020-07-15/americorps-members-helping-illinois-respond-covid-19&amp;title=AmeriCorps Members Helping Illinois Respond to COVID-19",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2020-07-15/americorps-members-helping-illinois-respond-covid-19&amp;title=AmeriCorps Members Helping Illinois Respond to COVID-19&amp;source=https://americorps.gov/blogs/2020-07-15/americorps-members-helping-illinois-respond-covid-19",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2020-07-15/americorps-members-helping-illinois-respond-covid-19&amp;url=https://americorps.gov/blogs/2020-07-15/americorps-members-helping-illinois-respond-covid-19&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2020-06-19/june-19-covid-19-americorps-and-senior-corps-story-round",
    "https://americorps.gov/blogs/2020-07-22/iowa-governor-visits-americorps-site-tackling-food-insecurity",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2020",
  "subdomain_2": "07",
  "subdomain_3": "15"
}