{
  "id": "americorpsgov_blogs_2023_11_16_honoring_sacrifices_made_our_hometown_heroeshtml",
  "url": "https://americorps.gov/blogs/2023-11-16/honoring-sacrifices-made-our-hometown-heroes",
  "title": "honoring-sacrifices-made-our-hometown-heroes",
  "content": "Honoring the Sacrifices Made by Our Hometown Heroes | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Honoring the Sacrifices Made by Our Hometown Heroes Submitted by dsong on Wed, 11/15/2023 - 15:30 Nov 16, 2023 Washington State Department of Veteran Affairs During November, the nation honor s and recognize s the valuable contributions and sacrifices made by veterans, active duty military, and military family members to our country. At AmeriCorps, we recognize our responsibility to the military community , including caring for veterans and their families . We also honor our AmeriCorps members and AmeriCorps Seniors volunteers from the veteran communities where they continue their legacy of service, like those serving in the Washington State Department of Veteran Affairs Vet Corps . Caring for Veterans and Military Families Before, During, and After Their Tours of Duty The Washington State Department of Veterans Affairs Vet Corps program was created in 2005 to help veterans and their families navigate their journey from military to civilian and collegiate life. The program provides veterans, and their families , support through connection to resources and services they need in their transitional journey out of the military and into their next phase in life. AmeriCorps members and Vet Corps program participants While stationed at colleges, universities, and community organizations throughout Washington state, AmeriCorps members and AmeriCorps Seniors volunteers: Connect veterans to service officers, housing support, emergency financial aid, counseling services, and other needed resources every day. Support services to veterans to improve their academic outcomes, graduation rates, and postsecondary success after college through peer mentoring, resources, and referrals to veterans in college. Educate university faculty and administrative employees about veteran needs and increase veteran cultural competence to increase veteran student retention rates, graduation rates among program participants, and post-service earnings by AmeriCorps members. Not only does the program provide veterans and their family members access to educational benefits and services earned through their military service, but AmeriCorps’ return-on-investment study found that the program returns as much as $17.52 to communities and the government for every federal dollar invested. Peer-to-Peer Connection and Support AmeriCorps members and AmeriCorps Seniors volunteers serving in Vet Corps are mostly veterans or military-connected family members who provide a peer connection for fellow hometown heroes by building on shared experiences and creating supportive relationships. Through peer connection, members and volunteers develop stronger bonds and a support system for fellow veterans. AmeriCorps member serving with Vet Corps (left) “ I joined AmeriCorps because I wanted an opportunity to connect and do meaningful work with v eterans and their families. My most memorable moment during my service was when we conducted a state-wide Veterans Day event during the peak of the COVID-19 pandemic and brought people together when the nation was feeling the most isolated , ” said an AmeriCorps alumnus Eric . Since its inception, Vet Corps has supported more than 6,600 veterans across 104 service sites across Washington state. With more than 400 AmeriCorps alums and 351 veteran alum s our members and volunteers dedicated more than 865,000 service hours to empower our nation’s veterans and military families. But the program isn’t only making a difference in the lives of those served. It’s also transforming the lives of our members and AmeriCorps Seniors volunteers. “I joined AmeriCorps because I was unsure of what I wanted to do with my life post-college. It turned out to be one of the best decisions I have made in my life. One of my favorite moments was hosting a thank you card signing event for Veterans Day. I then took the cards down to the Portland Veterans Affairs Hospital in Oregon and went floor to floor, handing out the cards to the veterans who were patients. Being able to bring a little bit of joy to the veterans, along with connecting with them and sharing stories, is something that I will never forget,” said AmeriCorps alumnus Bryan . 30 Years of Serving Alongside Hometown Heroes For 30 years, AmeriCorps programs like Vet Corps have been a pathway for thousands of veterans across the country to continue serving and leading in their community after military service while veterans who serve in AmeriCorps and AmeriCorps Seniors gain valuable professional, educational, and life benefits. By welcoming and tapping into the talent and leadership skills of veterans and military families to serve in national service opportunities in their community, nearly 15,000 veterans take the AmeriCorps pledge each year to continue to serve and tackle our nation’s most pressing challenges. Join us in recognizing our nation’s veterans and hometown heroes during our 30th anniversary and learn more about AmeriCorps’ commitment to supporting them . Previous Honoring Our Nation’s Veterans Through Service: Thoughts from an AmeriCorps Alumna Next Building Bridges and Fostering Civic Engagement Through AmeriCorps Partnerships Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-11-16/honoring-sacrifices-made-our-hometown-heroes",
    "https://www.dva.wa.gov/counseling/vet-corps",
    "https://www.americorps.gov/sites/default/files/document/36039_WDVA_Vet_Corps_2022_ROI_Study_RELEASE_508.pdf",
    "https://socialpresskit.com/americorps30",
    "http://americorps.gov/americorps30",
    "https://americorps.gov/about/what-we-do/veterans",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-11-16/honoring-sacrifices-made-our-hometown-heroes&amp;title=Honoring the Sacrifices Made by Our Hometown Heroes",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-11-16/honoring-sacrifices-made-our-hometown-heroes&amp;title=Honoring the Sacrifices Made by Our Hometown Heroes&amp;source=https://americorps.gov/blogs/2023-11-16/honoring-sacrifices-made-our-hometown-heroes",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-11-16/honoring-sacrifices-made-our-hometown-heroes&amp;url=https://americorps.gov/blogs/2023-11-16/honoring-sacrifices-made-our-hometown-heroes&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-11-09/honoring-our-nations-veterans-through-service-thoughts-americorps-alumna",
    "https://americorps.gov/blogs/2023-12-07/building-bridges-fostering-civic-engagement-through-americorps-partnerships",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [
    "Veterans and Military Families"
  ],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "11",
  "subdomain_3": "16"
}