{
  "id": "americorpsgov_blogs_2023_12_21_everyone_can_be_leaders_act_lead_your_cause_mlk_dayhtml",
  "url": "https://americorps.gov/blogs/2023-12-21/everyone-can-be-leaders-act-lead-your-cause-mlk-day",
  "title": "everyone-can-be-leaders-act-lead-your-cause-mlk-day",
  "content": "Everyone Can Be Leaders: Act and Lead Your Cause on MLK Day | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Everyone Can Be Leaders: Act and Lead Your Cause on MLK Day Submitted by dsong on Thu, 12/21/2023 - 09:11 Dec 21, 2023 AmeriCorps Staff Each year, we honor the legacy of Dr. Martin Luther King, Jr., by uniting in service to build the Beloved Community. Martin Luther King, Jr., National Day of Service is an opportunity for Americans of all walks of life to come together to heal divides and create everlasting connections with one another. It also allows us to become champions who lead our own causes. Dr. King inspired generations of Americans with his resonating “I Have a Dream” speech and his constant dedication to racial equality. As we continue working towards creating a more just and equitable community, we must also empower our communities, choosing to make a difference and get things done to encourage others to take the same leap. Find the inspiration to make a difference this MLK Day. Leading through Action For nearly 30 years, MLK Day has grown with an unwavering amount of support thanks to our country’s leaders and volunteers. Last year, our nation’s leaders demonstrated how service is a vessel that can unite and transform communities. AmeriCorps CEO Michael D. Smith joined Vice President Kamala Harris, US Department of Education Secretary Miguel Cardona, US Department of Transportation Secretary Pete Buttigieg, and Governor Wes Moore to serve alongside our nation’s students and volunteers in honor of MLK Day. From beautifying schools to joining in tutoring sessions and assembling care packages, our leaders rolled up their sleeves to help our communities in need. AmeriCorps CEO Michael D. Smith with Vice President Kamala Harris and US Department of Education Secretary Miguel Cardona on MLK Day Americans Continue to Unite, Serve, and Transform on MLK Day This year, Americans will once again step up to help build Dr. King’s dream of the Beloved Community. From sharing their transformative stories to days-long gatherings, people have the opportunity to honor Dr. King’s legacy through service. Literacy New Jersey’s students during MLK Day of Service This year, Literacy New Jersey , an organization that helps adults read, write, and communicate effectively, invites participants to hear how service helped transform the lives of many in the community. Our nation’s leaders, like Representative Reginald Atkins, join the annual MLK Day event to hear student success stories, meet the AmeriCorps members and volunteers, and learn about the importance of adult literacy in the community. Compassion Games' MLK Day 2024 service project Compassion Games , an organization that encourages people to inspire one another to reveal and promote acts of compassion that better lives and communities, will host the 40 Days of Peace hybrid events to educate about the importance of Dr. King’s legacy in our communities. From concerts to discussions and panels with leaders, the events will bring together people from all walks of life to share their service stories and explore how to build the Beloved Community. Find Your Inspiration on MLK Day Now is the time to become a leader and inspire others this MLK Day by uniting in service. Whether it's helping an elderly person cross the street, recovering a house destroyed by severe weather, or volunteering at your local recreation center, you empower your community while encouraging others to step up and help fight injustices. Start building your pathway to leadership this Martin Luther King, Jr., National Day of Service . Find a volunteer opportunity near you or even find resources to create a project yourself. Previous Commitment to Do Good: Partners Who Help Supercharge AmeriCorps Next Goodbye, 2023: AmeriCorps’ Resolutions Checklist Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-12-21/everyone-can-be-leaders-act-lead-your-cause-mlk-day",
    "https://literacynj.org/",
    "https://www.compassiongames.org/mlkconvergence/",
    "http://americorps.gov/MLKDay",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-12-21/everyone-can-be-leaders-act-lead-your-cause-mlk-day&amp;title=Everyone Can Be Leaders: Act and Lead Your Cause on MLK Day",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-12-21/everyone-can-be-leaders-act-lead-your-cause-mlk-day&amp;title=Everyone Can Be Leaders: Act and Lead Your Cause on MLK Day&amp;source=https://americorps.gov/blogs/2023-12-21/everyone-can-be-leaders-act-lead-your-cause-mlk-day",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-12-21/everyone-can-be-leaders-act-lead-your-cause-mlk-day&amp;url=https://americorps.gov/blogs/2023-12-21/everyone-can-be-leaders-act-lead-your-cause-mlk-day&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-12-15/commitment-do-good-partners-who-help-supercharge-americorps",
    "https://americorps.gov/blogs/2023-12-29/goodbye-2023-americorps-resolutions-checklist",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "12",
  "subdomain_3": "21"
}