{
  "id": "americorpsgov_blogs_2021_11_26_americorps_celebrates_national_native_american_heritage_monthhtml",
  "url": "https://americorps.gov/blogs/2021-11-26/americorps-celebrates-national-native-american-heritage-month",
  "title": "americorps-celebrates-national-native-american-heritage-month",
  "content": "AmeriCorps Celebrates National Native American Heritage Month | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps Celebrates National Native American Heritage Month Submitted by eschneider on Fri, 11/26/2021 - 14:53 Nov 26, 2021 AmeriCorps staff November is National Native American Heritage Month in which we observe and honor the rich history, culture and contributions of our nation's first peoples. The observance of National Native American Heritage Month is also representative of AmeriCorps' dedication to further racial equity and uplift the agency's core values – compassion, integrity and determination. AmeriCorps has a long commitment of supporting Native American communities, partnering hand-in-hand to address the critical issues unique to their communities, and leveraging the culture of service that has existed in tribal communities for generations. In September, AmeriCorps announced more than $3.4 million in funding, including grants and education awards, to 12 American Indian and Alaskan native Tribes and entities. The grants awarded will support more than 150 AmeriCorps members in Alaska, Arizona, California, Minnesota, New Mexico, North Dakota, Texas, Washington, and Wisconsin. A complete list of awards, including organizations and funding totals can be found online . This investment is part of the Administration’s larger commitment to create lasting change in Indian Country by strengthening tribal communities through education and economic development. Many AmeriCorps members with native heritage, past and present, and our partner organizations committed themselves to national service through their work in AmeriCorps. AmeriCorps member Jillian serves in Hoonah, AK with the Hoonah Indian Association to learn about the environmental conservation efforts from locals who are fighting for the preservation of their home and culture. See how Jillian Schuyler is #GettingThingsDone as an environmental scientist serving in #AmeriCorpsVISTA in Hoonah, Alaska - focusing on #climatechange and learning from locals who are fighting for the conservation of their home and culture. #NationalNativeAmericanHeritageMonth pic.twitter.com/J7aCdIIG80 — AmeriCorps VISTA (@AmeriCorpsVISTA) November 5, 2021 In Arizona, the Gila River Indian Community is currently revising its Veterans Serving Veterans AmeriCorps program to expand services in support of broader community employment and training opportunities. And in Billings, Montana, Colleen was thrilled to return to the classroom this fall as a volunteer for the St. Vincent Healthcare of Billings AmeriCorps Foster Grandparent Program. Colleen is a member of the Assiniboine Tribe and helps to raise students’ self-esteem and love of learning, many of whom are also members of her tribe or the Gros Ventre Tribe. AmeriCorps members continue to #GetThingsDone in American Indian and Alaska Native communities. This month, celebrate the rich history, culture and contributions Native Americans, and at AmeriCorps we will continue to provide support, break down barriers and build bridges. Previous The SCALER Tool: Boost your Community Organization’s Impact Next Continuing to Serve: 20K+ veterans give back wearing the AmeriCorps A Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2021-11-26/americorps-celebrates-national-native-american-heritage-month",
    "https://nativeamericanheritagemonth.gov/",
    "https://americorps.gov/newsroom/press-release/americorps-announces-34-million-tribal-funding",
    "https://americorps.gov/funded-grants/2021-americorps-tribal-grants",
    "https://twitter.com/AmeriCorpsVISTA/status/1456611003408338949",
    "https://twitter.com/hashtag/GettingThingsDone?src=hash&amp;ref_src=twsrc%5Etfw",
    "https://twitter.com/hashtag/AmeriCorpsVISTA?src=hash&amp;ref_src=twsrc%5Etfw",
    "https://twitter.com/hashtag/climatechange?src=hash&amp;ref_src=twsrc%5Etfw",
    "https://twitter.com/hashtag/NationalNativeAmericanHeritageMonth?src=hash&amp;ref_src=twsrc%5Etfw",
    "https://t.co/J7aCdIIG80",
    "https://twitter.com/AmeriCorpsVISTA/status/1456611003408338949?ref_src=twsrc%5Etfw",
    "https://grictraining.org/index.php/americorps",
    "https://www.chausa.org/publications/catholic-health-world/archives/issues/september-15-2021/young-students-and-seniors-shine-in-st.-vincent-foster-grandparent-program",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2021-11-26/americorps-celebrates-national-native-american-heritage-month&amp;title=AmeriCorps Celebrates National Native American Heritage Month ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2021-11-26/americorps-celebrates-national-native-american-heritage-month&amp;title=AmeriCorps Celebrates National Native American Heritage Month &amp;source=https://americorps.gov/blogs/2021-11-26/americorps-celebrates-national-native-american-heritage-month",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2021-11-26/americorps-celebrates-national-native-american-heritage-month&amp;url=https://americorps.gov/blogs/2021-11-26/americorps-celebrates-national-native-american-heritage-month&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2021-11-09/scaler-tool-boost-your-community-organizations-impact",
    "https://americorps.gov/blogs/2021-11-30/continuing-serve-20k-veterans-give-back-wearing-americorps",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2021",
  "subdomain_2": "11",
  "subdomain_3": "26"
}