{
  "id": "americorpsgov_blogs_2022_03_07_happy_birthday_peace_corpshtml",
  "url": "https://americorps.gov/blogs/2022-03-07/happy-birthday-peace-corps",
  "title": "happy-birthday-peace-corps",
  "content": "Happy Birthday Peace Corps | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Happy Birthday Peace Corps Submitted by eschneider on Thu, 03/03/2022 - 13:38 Mar 07, 2022 AmeriCorps staff Spotlighting Returned Peace Corps Volunteers Who Continued their National Service Journey Happy Birthday, Peace Corps – from your domestic partner in service. On March 1, 1961, just three months into his presidency, President John F. Kennedy established the Peace Corps. The bold idea of an international volunteer organization was first mentioned at the University of Michigan in Ann Arbor after then-Senator Kennedy was campaigning for the presidency on October 14, 1960. During his remarks at 2 a.m. to more than 10,000 students, the senator issued a challenge: “How many of you who are going to be doctors, are willing to spend your days in Ghana? Technicians or engineers, how many of you are willing to work in the Foreign Service and spend your lives traveling around the world? On your willingness to do that, not merely to serve one year or two years in the service, but on your willingness to contribute part of your life to this country, I think will depend the answer whether a free society can compete. I think it can! And I think Americans are willing to contribute. But the effort must be far greater than we have ever made in the past.” / John F. Kennedy Following this speech, 1,000 students signed a petition to serve abroad. Two weeks later, Senator Kennedy proposed “a peace corps of talented men and women.” After becoming the president and receiving more than 25,000 letters responding to his call to serve, President Kennedy signed an executive order establishing the Peace Corps. In August 1961, President Kennedy welcomed the inaugural group of volunteers to serve in Africa to the White House before they departed. Tanganyika, Ghana, and Colombia were the first countries to participate. For more than 60 years, the Peace Corps has promoted world peace and friendship in 142 countries. And during the pandemic they did not stop serving. Over the past two years, the Peace Corps continued its development work led by the agency’s counterparts and overseas staff members, virtual service, and the second-ever domestic deployment in the US to aid in the COVID-19 response alongside FEMA. And aside from all this service, did you know many Returned Peace Corps Volunteers come back from their service ready to continue their national service journey with AmeriCorps? And many that had to leave service early overseas due to the pandemic, chose to keep serving in AmeriCorps. Like Kieran. He began his two-year service in Madagascar as an English teacher. He taught sophomore classes, each with nearly 60 students. In addition to lesson planning and evaluating students’ progress, he also privately tutored anyone interested. However, due to the pandemic, Kieran left Madagascar and returned to the US only 18 months into his service. Previous Next Wanting to do something more, Kieran joined AmeriCorps and served with the VISTA program in North Kansas City with KidSight MO, a children’s vision screening nonprofit that specializes in providing follow-up care and financial assistance to kids who have potential vision problems. While serving Kieran said, “The impact of my service has been positive. I work with truly wonderful people doing great work! COVID makes things difficult, but I am happy to be where I am.” George Austin, an AmeriCorps member serving with FEMA Corps as a team leader in Southern Region joined AmeriCorps after serving in the Peace Corps. “My Peace Corps service helped me prepare for my AmeriCorps NCCC service by preparing me to become more self-sufficient and thus allow me to become more independent,” said George. “Peace Corps is an incredible experience, and doing AmeriCorps beforehand is a great steppingstone into Peace Corps.” Sage was selected to serve as a Peace Corps volunteer in Mozambique as a community health and youth services promoter starting in April 2020. But due to the pandemic, never deployed. After the disappointment of having her service term canceled, Sage contacted a former professor who recommended AmeriCorps. She serves with the VISTA program with CASA of Yellowstone County in Billings, Mont. In this role, Sage recruited Native American and culturally competent mentor matches for Native American children who have been removed from their homes. Sage recruited 16 volunteers to serve 14 youth in need, expanding their families’ access to services addressing educational, housing, and mental health needs. “Serving as an AmeriCorps member has given me the chance to serve a new community in ways that I would not have imagined for myself,” said Sage. “My work challenges me and gives me the opportunity to work with a group of amazing people.\" Astin joined the Peace Corps after her AmeriCorps service with the State and National program. She served at Social Capital Inc in Woburn, Mass., at the James L. McKeown Boys & Girls Club. She supported the After the Bell program, an afterschool program featuring mentoring youth and leading specific activities   focused on the environment and engineering. In the Peace Corps she served in Nkob, Morocco, as a yaouth development volunteer in a Dar Chabab (translated to ‘Youth House’). Her main focus, in collaboration with Moroccan counterparts, was to create, schedule, and implement engaging activities like doing arts and craft, skits, and English classes. “My time with AmeriCorps inspired me to continue serving with the Peace Corps because of the natural next step in community development,” said Astin. “I had just spent my AmeriCorps service within a community, new to me, and I was able to succeed by learning from others and sharing my skills and ideas. I was eager to see if my experience could translate in a foreign country.” These are just four examples of Americans who stayed on their national service journey through both Peace Corps and AmeriCorps. There are so many more out there. Did you successfully complete both a full-time service term or its equivalent in AmeriCorps, and the Peace Corps or Peace Corps Response? Learn more and apply for the Harris Wofford Joint Service Award. Americans serving in Peace Corps, AmeriCorps, or both come together to meet the moment and step up for those in need, even when there are considerable challenges. We are thankful for all the Returned Peace Corps Volunteers who bring their service experience with them when they join the AmeriCorps team. Please join us in wishing Peace Corps a happy birthday. AmeriCorps is keeping the national service celebration going in the month of March. Join us in celebrating AmeriCorps Week. Inspired to serve? Visit americorps.gov/serve or peacecorps.gov/volunteer to learn more. Previous Celebrate with Us: AmeriCorps Week is March 13-19 Next New $25K grants available to bring generations together in service Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2022-03-07/happy-birthday-peace-corps",
    "https://www.peacecorps.gov/about/history/founding-moment/",
    "https://americorps.gov/partner/partnerships/awards#wofford",
    "https://americorps.gov/blogs/2022-03-02/celebrate-us-americorps-week-march-13-19",
    "http://americorps.gov/serve",
    "http://peacecorps.gov/volunteer",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2022-03-07/happy-birthday-peace-corps&amp;title=Happy Birthday Peace Corps",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2022-03-07/happy-birthday-peace-corps&amp;title=Happy Birthday Peace Corps&amp;source=https://americorps.gov/blogs/2022-03-07/happy-birthday-peace-corps",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2022-03-07/happy-birthday-peace-corps&amp;url=https://americorps.gov/blogs/2022-03-07/happy-birthday-peace-corps&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2022-03-02/celebrate-us-americorps-week-march-13-19",
    "https://americorps.gov/blogs/2022-03-16/new-25k-grants-available-bring-generations-together-service",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2022",
  "subdomain_2": "03",
  "subdomain_3": "07"
}