{
  "id": "americorpsgov_blogs_2020_11_10_even_amidst_pandemic_veterans_never_stop_servinghtml",
  "url": "https://americorps.gov/blogs/2020-11-10/even-amidst-pandemic-veterans-never-stop-serving",
  "title": "even-amidst-pandemic-veterans-never-stop-serving",
  "content": "Even Amidst a Pandemic, Veterans Never Stop Serving | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Even Amidst a Pandemic, Veterans Never Stop Serving Submitted by admin on Tue, 11/10/2020 - 17:13 Nov 10, 2020 Brooklyn Montgomery, AmeriCorps Government Relations Intern Veterans respond to COVID-19 in their communities through AmeriCorps. Earlier this week, AmeriCorps CEO Barbara Stewart held a video conference with veteran AmeriCorps members to learn about their service with Washington Vet Corps and the Mt. Adams Institute in Washington. Whether continuing their service to our country on college campuses or public lands, the veterans serving in AmeriCorps have adapted to the changes caused by COVID-19. After serving in the military, many veterans wish to pursue a degree but need guidance navigating the resources and programs meant to help them achieve their higher education goals. The Washington Vet Corps enlists AmeriCorps members to serve as peer mentors and counselors to veterans in colleges and universities across Washington state. These AmeriCorps members provide training to help institutions meet the needs of their veteran students and directly support veterans new to higher education through peer connections and direction to available benefits. Eric Burns, a former combat medic in the US Army and current AmeriCorps member, originally joined the Vet Corps program while pursuing his master’s degree and deemed it “one of the most rewarding experiences I’ve ever had.” In the face of the COVID-19 pandemic, Eric noted that it has been challenging to connect with the community while virtual, but he’s worked to remedy this barrier with events such as a virtual Veteran’s Day celebration for veterans and their families. Another AmeriCorps member, former Army Combat Engineer Trent Mortensen, shifted his focus to rural outreach after the pandemic hit. Through the transition from in person to a virtual space, Mortensen noted that he’s reaching people who wouldn’t have otherwise had access. Reflecting on his own experience after leaving the military, Mortensen notes that being “able to push [veterans] to resources that I never had” has been a “big motivation factor.” The Mt. Adams Institute, another AmeriCorps program in Washington, provides veterans with apprenticeship opportunities focused on improving public lands and managing their natural resources. There are multiple programs for veterans to choose from, ranging from natural resource management to wildland firefighting. Veterans often acquire unique skills during their service, and Mt. Adams Institute provides the opportunity to use and expand upon those abilities. Most alluring for some is the chance to continue service to the public. Jon Knepper, Marine Corps veteran, explained that he “struggled with finding a sense of fulfillment” upon discharge. The Mt. Adams Institute allowed him to do work that made an impact on the world around him., As part of his service, Knepper worked on a community garden to provide the surrounding area with access to fresh food. In the face of Covid-19, he hopes that it can help anyone struggling with food insecurity as well as reduce the need for trips to markets in more populated areas. For many veterans, AmeriCorps programs have served as both a launchpad to future goals and as a tangible career path. With the guidance of his program supervisor, former Navy intelligence analyst Hunter Haley applied and was accepted to Portland State University’s Environmental Science Program. Both Trent Mortensen and Eric Burns hope to continue their service in AmeriCorps as regional coordinators. Channette Purser-Smith, current North Seattle College student, credits Washington Vet Corps with helping her stay in school, going on to state that “being in the program really helped me succeed.” For veterans looking to continue their service, AmeriCorps programs not only offer the chance to complete meaningful work, while gaining valuable resources and experiences for the future. Previous An AmeriCorps VISTA Taking On Poverty and Racial Injustice in Higher Education Next A Lifetime of Service: Veterans Serve Through AmeriCorps Seniors Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2020-11-10/even-amidst-pandemic-veterans-never-stop-serving",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2020-11-10/even-amidst-pandemic-veterans-never-stop-serving&amp;title=Even Amidst a Pandemic, Veterans Never Stop Serving",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2020-11-10/even-amidst-pandemic-veterans-never-stop-serving&amp;title=Even Amidst a Pandemic, Veterans Never Stop Serving&amp;source=https://americorps.gov/blogs/2020-11-10/even-amidst-pandemic-veterans-never-stop-serving",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2020-11-10/even-amidst-pandemic-veterans-never-stop-serving&amp;url=https://americorps.gov/blogs/2020-11-10/even-amidst-pandemic-veterans-never-stop-serving&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2020-11-10/americorps-vista-taking-poverty-and-racial-injustice-higher-education",
    "https://americorps.gov/blogs/2020-11-12/lifetime-service-veterans-serve-through-americorps-seniors",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA; AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2020",
  "subdomain_2": "11",
  "subdomain_3": "10"
}