{
  "id": "americorpsgov_blogs_2023_03_03_americorps_unites_celebration_americorps_week_2023html",
  "url": "https://americorps.gov/blogs/2023-03-03/americorps-unites-celebration-americorps-week-2023",
  "title": "americorps-unites-celebration-americorps-week-2023",
  "content": "AmeriCorps Unites in Celebration: AmeriCorps Week 2023 | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps Unites in Celebration: AmeriCorps Week 2023 Submitted by dsong on Wed, 03/01/2023 - 11:56 Mar 03, 2023 AmeriCorps Staff Get ready for a weeklong celebration of Americans who get things done for our nation! From young adults to retired older adults, AmeriCorps members and AmeriCorps Seniors from coast to coast make a difference in their community every day. AmeriCorps Week celebrates and thanks those who previously and currently wear the AmeriCorps ‘A’ across the nation. AmeriCorps members and AmeriCorps Seniors volunteers unite in service to address unique needs, help children thrive in and out of the classroom, assist older adults to live independently, fight hunger, support veterans and military families, combat climate change, support disaster relief and recovery, and improve public health. More than one million Americans donned the AmeriCorps ‘A’ For nearly 30 years, Americans dedicated their time and skills to help lift up our nation’s communities through AmeriCorps. Former President Bill Clinton helped launch AmeriCorps in 1994 after signing the National and Community Service Trust Act, swearing in the first class of 20,000 AmeriCorps members. Former President Bill Clinton meeting AmeriCorps members (Photo credit Clinton Foundation ) Today, more than 200,000 members and AmeriCorps Seniors serve in nearly 40,000 locations with more than 1.2 million alumni whose commitment to service has helped and inspired new generations of civic engagement. Members showcasing their AmeriCorps ‘A’ Join with the national service community to celebrate the 2023 Day of the A on Thursday, March 16. Show off your AmeriCorps pride by sharing on social media images from your service term, your favorite AmeriCorps gear, or your most creative A art project. Giving AmeriThanks for making a difference Throughout the week, AmeriCorps members and volunteers making a positive impact in their community will take center stage on all agency channels. Whether they serve for one year or become a lifeline volunteer, these Americans make good things happen: AmeriCorps members serving in the NCCC program protect millions of acres of land, improve parks and public lands, and create the next generation of conservation and climate resilience leaders; AmeriCorps members in FEMA Corps served on more than 80 federally declared disasters across 31 states and territories since its inception 10 years ago; AmeriCorps Seniors volunteers share their life skills to tutor and mentor children, befriend fellow older adults, and help community members in need; AmeriCorps members serving in the VISTA program address poverty, fight hunger, and support healthy futures in their community; Veterans choose to continue to serve their nation through national service, help engage their fellow service members and their families before, during, and after their tours of duty; and AmeriCorps members serve with Public Health AmeriCorps , an initiative in partnership with the Centers for Disease Control and Prevention, to address their community’s public health needs and health inequities. AmeriCorps CEO Michael D. Smith (left) with members during AmeriCorps Week 2022 As a nation, we witnessed unprecedented challenges that affected our schools, mental health, livelihood, and safety. President Biden called on Americans to unite through service and help put forward a shared vision for a more united America. AmeriCorps “uniters” prove every day that service can unite people regardless of race, religion, or background. Join AmeriCorps Week celebrations Whether you choose to become a uniter or show your gratitude to those wearing the AmeriCorps ‘A’, join us as we celebrate and thank our members, volunteers, and programs for making a positive impact on those they serve. How to participate in AmeriCorps Week Join the #AmeriThanks Social Storm on Monday, March 13 at noon ET. Kick off AmeriCorps Week by giving gratitude to the thousands of AmeriCorps members and AmeriCorps Seniors volunteers. Be a part of the storm by sharing our #AmeriThanks Social Storm post from your Twitter, Facebook, and/or Instagram account. To achieve the greatest reach, please use the graphic and tags included below and publish your posts at. Share AmeriCorps’ impact. Through op-eds, letters to the editor, or other communications channels, highlight the impact of the work AmeriCorps members and AmeriCorps Seniors volunteers do in your community.  Share videos, photos, and posts on social media about AmeriCorps or your own experience throughout the week to help encourage the next generation of AmeriCorps members. You also can share your story on Americorps.gov . Host an “honorary AmeriCorps member”. Invite media, an elected official, a community leader, school principal, AmeriCorps alumnus, or other local dignitary to see AmeriCorps in action by becoming an \"honorary AmeriCorps member” or by doing a site visit. Join us on Day of the A. Show off your AmeriCorps ‘A’ to share your national service pride. Showcase how serving others makes you feel or what a day in your AmeriCorps life is like. Don your favorite AmeriCorps tee, break out your old baseball cap, or show off your AmeriCorps-themed arts and crafts project. Take a photo or video and share it on your personal social media channels on Thursday, March 16, in honor of #DayoftheA. Don't forget to share your state’s National Service Report, reflecting the profound impact AmeriCorps and AmeriCorps Seniors programs, members, and volunteers make across the nation. Demonstrate how these members and volunteers change and improve countless lives through the power of service. Use these reports and graphics to celebrate your state or territory during AmeriCorps Week. Follow AmeriCorps on Facebook , Instagram , LinkedIn , and Twitter to join AmeriCorps Week and Day of the A. Celebrate with your followers with AmeriCorps Week-themed social media posts found in the marketing toolkit . Previous Black Voices of Service Next AmeriCorps Unites in Celebration: Young Adults Become the Nation’s Changemakers Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-03-03/americorps-unites-celebration-americorps-week-2023",
    "https://americorps.gov/newsroom/events/americorps-week",
    "https://www.clintonfoundation.org/",
    "https://americorps.gov/blogs/2022-07-29/ten-years-responding-crisis-situations",
    "https://www.americorps.gov/about/what-we-do/public-health-americorps",
    "https://americorps.gov/about/what-we-do/united-we-serve",
    "https://americorps.gov/blogs/2022-09-26/united-we-serve-how-national-service-unites-americans",
    "http://americorps.gov/serve",
    "https://socialpresskit.com/americorpstoolkits",
    "https://americorps.gov/newsroom/stories/share-your-service-story",
    "https://americorps.gov/about/our-impact#NSR",
    "https://socialpresskit.com/americorpstoolkits#2023-national-service-reports",
    "https://www.facebook.com/americorps",
    "https://www.instagram.com/americorps/",
    "https://www.linkedin.com/company/americorps/",
    "http://twitter.com/AmeriCorps",
    "https://socialpresskit.com/AmeriCorpsToolkits",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-03-03/americorps-unites-celebration-americorps-week-2023&amp;title=AmeriCorps Unites in Celebration: AmeriCorps Week 2023 ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-03-03/americorps-unites-celebration-americorps-week-2023&amp;title=AmeriCorps Unites in Celebration: AmeriCorps Week 2023 &amp;source=https://americorps.gov/blogs/2023-03-03/americorps-unites-celebration-americorps-week-2023",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-03-03/americorps-unites-celebration-americorps-week-2023&amp;url=https://americorps.gov/blogs/2023-03-03/americorps-unites-celebration-americorps-week-2023&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-02-23/black-voices-service",
    "https://americorps.gov/blogs/2023-03-13/americorps-unites-celebration-young-adults-become-nations-changemakers",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors; Public Health AmeriCorps",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "03",
  "subdomain_3": "03"
}