{
  "id": "americorpsgov_blogs_2021_07_30_conservation_corps_north_carolina_tackling_first_living_shoreline_projecthtml",
  "url": "https://americorps.gov/blogs/2021-07-30/conservation-corps-north-carolina-tackling-first-living-shoreline-project",
  "title": "conservation-corps-north-carolina-tackling-first-living-shoreline-project",
  "content": "Conservation Corps North Carolina is tackling the first living shoreline project | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Conservation Corps North Carolina is tackling the first living shoreline project Submitted by eschneider on Fri, 07/30/2021 - 14:42 Jul 30, 2021 AmeriCorps staff AmeriCorps features stories in the news about programs, partners, and members committed to improving our communities through service Every day, AmeriCorps works to mitigate the adverse effects of climate change. More than 16,000 AmeriCorps members and AmeriCorps Seniors volunteers annually are making strides in conservation, renewable energy, and community resilience projects that address the climate crisis . AmeriCorps has decades of proven experience in environmental stewardship, a vast network of partners and community-driven infrastructure that supports both current needs and builds pathways from service to employment. In communities around the country, AmeriCorps members are getting things done. Conservation Corps North Carolina’s mission is to connect youth and young adults to meaningful conservation service work that benefits North Carolina communities and connect them to nature and the outdoors. Participants work on projects that preserve, restore, and improve public lands and trails across the state. Right now they are tackling a project, first of its kind, focused on coastal restoration and living shorelines through a partnership with North Carolina Coastal Federation. You can read more in the following excerpt from the Coastal Review article: Conservation Corps North Carolina plugs first living shoreline project The six-person AmeriCorps crew, volunteers and federation staff planted the salt marsh grass, completing a restoration project put in place to reduce shoreline erosion, protect the area’s maritime forest from storms, provide fish habitat and help improve coastal water quality, according to the federation. The AmeriCorps crew also collected marine debris and did maintenance work at Cape Lookout National Seashore, Carolina Beach State Park, Morris Landing in Holly Ridge and other spots on the central and southern North Carolina coast. The living shoreline was built with bags of recycled oyster shells placed along the shoreline by Restoration Systems LLC, an environmental restoration business based in Raleigh. The state Department of Justice’s Environmental Enhancement Grant program and the North Carolina Land and Water Fund funded that portion of the project. Though there was a torrential downpour that morning and into early afternoon, the sky cleared by about 2 p.m. May 7, allowing enough time to plant the thousands of plugs. AK Kelly, from Florida, was among the six-member crew planting salt marsh grass that day. Kelly joined the Conservation Corps earlier this year, after deciding it was time to get back into the field, literally. Kelly earned a degree in environmental science focusing in conservation a few years ago, but after graduating, ended up in the service industry. “I was just ready to get back into my field, ready to get back into stuff relevant to my degree,” Kelly said about choosing the organization. “Conservation Corps was a great opportunity for me to do that in a way where I’m going to very clearly build my skill set, get my confidence back, get to do a wide variety of work, and remember why I love what I love.” Read more the full article in the Coastal Review: Conservation Corps North Carolina plugs first living shoreline project Engaging passionate, committed adults of all ages in national service to tackle the climate crisis for a more sustainable future and is at the core of what AmeriCorps is all about. Hats off to these all-stars! #WhatsAtYourCore? Learn more about how to protect the environment through service . Previous Honor. Serve. Unite. Give back on the 20th Anniversary of 9/11 Next AmeriCorps Seniors are Heading Back to School Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2021-07-30/conservation-corps-north-carolina-tackling-first-living-shoreline-project",
    "https://americorps.gov/blogs/2021-04-23/americorps-tackling-climate-crisis-building-clean-energy-future",
    "https://coastalreview.org/2021/06/conservation-corps-nc-plugs-first-living-shoreline-project/",
    "https://coastalreview.org/2021/06/conservation-corps-nc-plugs-first-living-shoreline-project/",
    "https://americorps.gov/about/what-we-do/climate-corps",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2021-07-30/conservation-corps-north-carolina-tackling-first-living-shoreline-project&amp;title=Conservation Corps North Carolina is tackling the first living shoreline project ",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2021-07-30/conservation-corps-north-carolina-tackling-first-living-shoreline-project&amp;title=Conservation Corps North Carolina is tackling the first living shoreline project &amp;source=https://americorps.gov/blogs/2021-07-30/conservation-corps-north-carolina-tackling-first-living-shoreline-project",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2021-07-30/conservation-corps-north-carolina-tackling-first-living-shoreline-project&amp;url=https://americorps.gov/blogs/2021-07-30/conservation-corps-north-carolina-tackling-first-living-shoreline-project&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2021-08-03/honor-serve-unite-give-back-20th-anniversary-911",
    "https://americorps.gov/blogs/2021-08-12/americorps-seniors-are-heading-back-school",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2021",
  "subdomain_2": "07",
  "subdomain_3": "30"
}