{
  "id": "americorpsgov_blogs_2021_05_21_disaster_national_modelhtml",
  "url": "https://americorps.gov/blogs/2021-05-21/disaster-national-model",
  "title": "disaster-national-model",
  "content": "From Disaster to National Model | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb From Disaster to National Model Submitted by pnolan on Fri, 05/21/2021 - 12:11 May 21, 2021 AmeriCorps Staff 10 years after the Joplin tornado, disaster response has become an AmeriCorps staple, focused on serving communities – and the human spirit Within hours after one of the nation's deadliest tornadoes ripped through Joplin 10 years ago, the first team of AmeriCorps members arrived. They immediately went to work, setting up a missing persons hotline and opening a volunteer center at Missouri Southern State University to handle the 3,000 volunteers who showed up the next day. In the years that followed, more than 425 AmeriCorps members from across the country served in Joplin, assisting more than 3,000 households. They removed tons of debris, provided homeowner assistance and casework, operated donation and distribution warehouses, provided legal services, and repaired and built homes. Most importantly, AmeriCorps members, working with federal, state, and local agencies, played a critical role in helping bring order, safety, and direction to more than 150,000 citizen volunteers who came to Joplin to offer needed assistance and hope, delivering more than 1 million hours of service. AmeriCorps members were instrumental to mobilizing an influx of volunteers and donations, which later saved the city more than $17.7 million in disaster costs. On the 10th anniversary, Acting CEO Mal Coles issues a statement to the volunteers and community members whose lives were forever changed. Read the full statement “Joplin will always have a special place in the heart of AmeriCorps. Even in its bleakest moments, the city opened its doors to our members and thousands of volunteers, welcoming them with open arms. While this made the hard work a little easier, it is ‘the miracle of the human spirit’ that carried this heartland city toward recovery.” / Mal Coles, Acting CEO National Service: Count on Us – Joplin Response This video shows the vital role AmeriCorps played in supporting the people of Joplin as they recover and rebuild after the deadliest tornado in more than 60 years struck Joplin, Missouri on May 22, 2011. From the Archives AmeriCorps Members Working Night and Day to Help Joplin Recover , May 27, 2011 AmeriCorps Director John Gomperts Commentary on Joplin Tornado Volunteer Response , July 7, 2011 Lessons Learned: Q&A with AmeriCorps Alum and Joplin Veteran, Quinn Gardner , May 20, 2012 Lessons Learned: A Q&A with AmeriCorps Member and Joplin Veteran, Abby Simons , May 20, 2012 One Year After Joplin Tornado, AmeriCorps Still Hard at Work , May 21, 2012 The Miracle of the Human Spirit , May 25, 2012 On the Record “No city in America is more grateful for AmeriCorps than Joplin. No city believes more in the group’s mission. These young people have been with us since day one, and while their hours can be counted and a dollar value put on their labor, what they have given to and done for Joplin since May 22 is immeasurable ….AmeriCorps has done heroic service for Joplin. Tapping deeper into its strengths just makes sense. Editorial, Joplin Globe, March 16, 2012 “The members of the Missouri House of Representatives join unanimously to applaud the history, goals, and accomplishments associated with the AmeriCorps program and to convey to all of those involved this legislative body’s most heartfelt commendation of their efforts in Joplin and Duquesne following the devastating EF-5 tornado,” states Missouri House Resolution 244. Missouri House of Representatives, Missouri House Resolution 244 , passed January 31, 2012 “The Miracle of the Human Spirit symbolizes the incredible outpouring of volunteers who have lifted Joplin out of the rubble. Countless volunteers from all walks of life have offered themselves to the Joplin effort without request, serving as a reminder of the overwhelming power of human generosity and the steadfast tenacity to rebuild the once broken city…Joplin and its residents are eternally grateful to those heroes.” A section of Cunningham Park in Joplin is set aside as a tribute to AmeriCorps members and other volunteers who came to help in response to the May 2011 tornado. Symbols of the volunteer response are cast in bronze – a sledgehammer, work gloves, an AmeriCorps hardhat, and a simple plaque. Previous AmeriCorps Partners with MTV Entertainment Next What’s at your core? Put your values into action and serve. Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2021-05-21/disaster-national-model",
    "https://americorps.gov/newsroom/press-release/americorps-statement-10th-anniversary-joplin-tornado",
    "https://americorps.gov/newsroom/press-releases/2011/americorps-members-working-night-and-day-help-joplin-recover",
    "https://americorps.gov/newsroom/official-statements/2011/americorps-director-john-gomperts-commentary-joplin-tornado",
    "https://nationalservice.tumblr.com/post/144653900947/lessons-learned-qa-with-americorps-alum-and",
    "https://nationalservice.tumblr.com/post/144655686597/lessons-learned-a-qa-with-americorps-member-and",
    "https://americorps.gov/newsroom/press-releases/2012/one-year-after-joplin-tornado-americorps-still-hard-work",
    "https://nationalservice.tumblr.com/post/144655437682/the-miracle-of-the-human-spirit",
    "http://www.nationalservice.gov/about/newsroom/statements_detail.asp?tbl_pr_id=2071",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2021-05-21/disaster-national-model&amp;title=From Disaster to National Model",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2021-05-21/disaster-national-model&amp;title=From Disaster to National Model&amp;source=https://americorps.gov/blogs/2021-05-21/disaster-national-model",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2021-05-21/disaster-national-model&amp;url=https://americorps.gov/blogs/2021-05-21/disaster-national-model&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2021-05-20/americorps-partners-mtv-entertainment",
    "https://americorps.gov/blogs/2021-06-02/whats-your-core-put-your-values-action-serve",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2021",
  "subdomain_2": "05",
  "subdomain_3": "21"
}