{
  "id": "americorpsgov_blogs_2022_01_28_celebrating_life_national_service_champion_diana_londonhtml",
  "url": "https://americorps.gov/blogs/2022-01-28/celebrating-life-national-service-champion-diana-london",
  "title": "celebrating-life-national-service-champion-diana-london",
  "content": "Celebrating the Life of National Service Champion Diana London | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Celebrating the Life of National Service Champion Diana London Submitted by eschneider on Fri, 01/28/2022 - 09:13 Jan 28, 2022 AmeriCorps staff National service has lost a pioneer and champion with the passing of Diana London. Diana was a trailblazer, known for her long-time leadership of VISTA under The Corporation for National and Community Service, now known as AmeriCorps, and was the primary force behind the emergence of the program as the centerpiece of service in low-income communities. In 1965, Diana began working with the newly created Office of Economic Opportunity as a volunteer, phoning potential AmeriCorps VISTA applicants and checking their references. She was then hired to serve as Program Officer for the OEO Mid Atlantic field office and focused her work on Appalachia. From there she began her stellar career working full-time in the AmeriCorps VISTA program. She served in various management positions including program director, deputy program director, management of program development and field support, planning and budget operations, and evaluation. On innumerable occasions Diane served as the Acting AmeriCorps VISTA Director. During her time with AmeriCorps VISTA, she served under seven administrations and numerous program directors. In the 1980’s when the program was targeted by the Administration and some members in Congress for elimination, she was a leader in the efforts to save it. The program would not exist today were it not for her leadership and mobilization of the Friends of VISTA, who were instrumental in protecting its legacy and continuation. She continued her work with AmeriCorps VISTA into the late 1990s before retiring. Diana was also the connection to Sargent Shriver and other founders of the program, and their philosophy for what AmeriCorps VISTA could and should be. The late Harris Wofford said of Diana, upon her retirement in 1999, that “It has been a great privilege to work with Diana during my time as CEO of [AmeriCorps]. She is one of the outstanding leaders of national service.” Diana died October 10, 2021 in Durham, NC. She will be missed by so many. Her passion, spirit, and commitment to national service will live on through those her knew and loved her. Previous Thank You for Stepping up on MLK Day Next Conservation Corps Becomes Topic for Dissertation, Passion for Life Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2022-01-28/celebrating-life-national-service-champion-diana-london",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2022-01-28/celebrating-life-national-service-champion-diana-london&amp;title=Celebrating the Life of National Service Champion Diana London",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2022-01-28/celebrating-life-national-service-champion-diana-london&amp;title=Celebrating the Life of National Service Champion Diana London&amp;source=https://americorps.gov/blogs/2022-01-28/celebrating-life-national-service-champion-diana-london",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2022-01-28/celebrating-life-national-service-champion-diana-london&amp;url=https://americorps.gov/blogs/2022-01-28/celebrating-life-national-service-champion-diana-london&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2022-01-26/thank-you-stepping-mlk-day",
    "https://americorps.gov/blogs/2022-02-03/conservation-corps-becomes-topic-dissertation-passion-life",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2022",
  "subdomain_2": "01",
  "subdomain_3": "28"
}