{
  "id": "americorpsgov_blogs_2023_12_29_goodbye_2023_americorps_resolutions_checklisthtml",
  "url": "https://americorps.gov/blogs/2023-12-29/goodbye-2023-americorps-resolutions-checklist",
  "title": "goodbye-2023-americorps-resolutions-checklist",
  "content": "Goodbye, 2023: AmeriCorps’ Resolutions Checklist | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Goodbye, 2023: AmeriCorps’ Resolutions Checklist Submitted by dsong on Fri, 12/29/2023 - 09:08 Dec 29, 2023 AmeriCorps Staff As we wrap up 2023, AmeriCorps reflects on our resolutions and historic milestone moments from this year and looks forward to kicking off 2024 with our members, volunteers, grantees, and partners. AmeriCorps’ 2023 Resolutions Celebrate the millions of Americans who strengthen our nation’s civic engagement every day ️ In January, AmeriCorps released the Volunteering and Civic Life in America research to highlight the millions of individuals who make a significant impact on the world around them. The research shows that 60.7 million Americans volunteered more than 4.1 billion hours of service between September 2020 and 2021 , even during the height of the COVID-19 pandemic. Together with US Surgeon General Dr. Vivek Murthy, AmeriCorps CEO Michael D. Smith, Boys & Girls Club of America , Feeding America , and Communities In Schools , we explored how Americans helped bridge divides, the importance of volunteering to combat isolation and loneliness, and how to further strengthen our communities through service. Provide service pathways to help create sustainable and healthy communities across the country In 2023, more than 2,340 AmeriCorps members served in the VISTA Summer Associates program, an opportunity for Americans to serve on a short-term basis and engage in a current project for eight to ten weeks, beginning in May. Summer associates united in the mission to alleviate poverty in 2023, served alongside full-time AmeriCorps members in the VISTA program, and supported more than 165 service projects in 720 service sites in 48 states, Washington, DC, and Puerto Rico. Summer associates serving at Skagit County Public Hospital District 304 in Washington State helped reach out to more than 300 people with information about substance misuse and overdose prevention. Summer associates serving in 2023 Summer Associates created connections with people of all ages and gave out lifesaving materials such as locking medication storage containers and naloxone, the medication that temporarily reverses an opioid overdose. Support disaster recovery efforts after natural disasters from coast to coast From Florida to Hawaii, our nation and territories’ communities faced devastating natural disasters in 2023. Hawaii was hit by a series of wildfires in early August that caused extensive damage and resulted in the death of at least 115 people in Lahaina, making this the deadliest wildfire in modern US history. Days after, AmeriCorps deployed 40 members, like Michael, to begin disaster recovery efforts, supporting volunteer and donations management. View this post on Instagram A post shared by AmeriCorps (@americorps) Hurricane Idalia made landfall in Florida as a category-three hurricane in late August. The strongest hurricane to make landfall in Florida’s Big Bend region in more than 125 years. AmeriCorps deployed more than 60 members and staff to help. Our members assisted with tree removal, temporary roof repair, debris removal, mold suppression, and muck and gut services. Create new pathways to expand service opportunities and address our nation’s most pressing needs On September 20, 2023, AmeriCorps celebrated a new conversation legacy launched by President Biden – the AmeriCorps NCCC Forest Corps . In partnership with the US Forest Service, the new initiative will help improve the lives of individuals and communities nationwide while helping the nation address climate change's catastrophic and disproportionate impacts and unequal access to training, higher education, and high-quality jobs. View this post on Instagram A post shared by AmeriCorps NCCC (@americorpsnccc) AmeriCorps also joined forces with the Departments of Commerce, the Interior, Agriculture, Labor and Energy, and the Environmental Protection Agency to out the mission, goals, priorities, and next steps for implementing President Biden’s American Climate Corps under a Memorandum of Understanding . Celebrate 30 years of AmeriCorps From Hollywood actors to political figures and grassroots activists, the nation came together in September and October 2023 to celebrate AmeriCorps’ 30th anniversary . AmeriCorps CEO Michael D. Smith presenting President Clinton with AmeriCorps’ letterman jacket Hundreds of Americans joined our nation’s leaders and AmeriCorps leaders, members, AmeriCorps Seniors volunteers, and alums in a virtual event commemorating the 30th anniversary . AmeriCorps CEO was joined by our board member Shirley Sagawa, The King Center CEO Dr. Bernice A. King, Lieutenant Governor Billy Nungesser, Senator Chris Coons, and a special shoutout from AmeriCorps alum turned actor Jay Ellis. A month later, we joined the AmeriCorps: 30 Years Forward S ummit hosted by the Clinton Center . Alongside President Clinton, national service champions, leaders in the public and private sectors, and AmeriCorps alums and members, we discussed our greatest milestones and the future of service. Our Movement Continues We’re grateful to our members, AmeriCorps Seniors volunteers, alums, grantees, partners, and champions who continue to help us meet our New Year’s resolutions and strengthen national service across our country. As we end the year, we look forward to seeing how we will continue to empower our communities in 2024. Stay tuned as we keep this momentum going. We’re kicking off the new year with Martin Luther King, Jr., National Day of Service on January 15, 2024, stay updated on upcoming events and news . Then, follow our 30th anniversary announcements as we celebrate until September 2024 . Previous Everyone Can Be Leaders: Act and Lead Your Cause on MLK Day Next Thank You, Mentors Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2023-12-29/goodbye-2023-americorps-resolutions-checklist",
    "https://www.bgca.org/",
    "https://www.feedingamerica.org/",
    "https://www.communitiesinschools.org/",
    "https://americorps.gov/newsroom/press-release/florida-hawaii-americorps-disaster-response-teams-continue-serve-help",
    "https://www.instagram.com/reel/C0R7CByrgcV/?utm_source=ig_embed&amp;utm_campaign=loading",
    "https://www.instagram.com/reel/C0R7CByrgcV/?utm_source=ig_embed&amp;utm_campaign=loading",
    "https://www.instagram.com/reel/C0R7CByrgcV/?utm_source=ig_embed&amp;utm_campaign=loading",
    "https://americorps.gov/serve/americorps/americorps-nccc/forest-corps",
    "https://www.instagram.com/reel/C0URD4ygqyk/?utm_source=ig_embed&amp;utm_campaign=loading",
    "https://www.instagram.com/reel/C0URD4ygqyk/?utm_source=ig_embed&amp;utm_campaign=loading",
    "https://www.instagram.com/reel/C0URD4ygqyk/?utm_source=ig_embed&amp;utm_campaign=loading",
    "https://americorps.gov/newsroom/press-release/biden-harris-administration-announces-new-agreement-between-seven-federal",
    "http://socialpresskit.com/daysofservice",
    "https://www.youtube.com/watch?v=bBhz9Toj7hc",
    "https://www.clintonfoundation.org/americorps-thirty-years-forward/",
    "http://americorps.gov/mlkday",
    "https://socialpresskit.com/daysofservice",
    "http://americorps.gov/americorps30",
    "https://socialpresskit.com/americorps30",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2023-12-29/goodbye-2023-americorps-resolutions-checklist&amp;title=Goodbye, 2023: AmeriCorps’ Resolutions Checklist",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2023-12-29/goodbye-2023-americorps-resolutions-checklist&amp;title=Goodbye, 2023: AmeriCorps’ Resolutions Checklist&amp;source=https://americorps.gov/blogs/2023-12-29/goodbye-2023-americorps-resolutions-checklist",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2023-12-29/goodbye-2023-americorps-resolutions-checklist&amp;url=https://americorps.gov/blogs/2023-12-29/goodbye-2023-americorps-resolutions-checklist&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2023-12-21/everyone-can-be-leaders-act-lead-your-cause-mlk-day",
    "https://americorps.gov/blogs/2024-01-09/thank-you-mentors",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps NCCC; AmeriCorps Seniors",
  "focus_population": [
    "Schools"
  ],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2023",
  "subdomain_2": "12",
  "subdomain_3": "29"
}