{
  "id": "americorpsgov_blogs_2021_09_30_americorps_members_take_hunger_issueshtml",
  "url": "https://americorps.gov/blogs/2021-09-30/americorps-members-take-hunger-issues",
  "title": "americorps-members-take-hunger-issues",
  "content": "AmeriCorps Members Take on Hunger Issues | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb AmeriCorps Members Take on Hunger Issues Submitted by mbrodbeck on Thu, 09/30/2021 - 16:05 Sep 30, 2021 AmeriCorps staff For tens of millions of people in America, a daily meal isn’t a choice between different dishes. It’s a choice between food and other crucial needs—like medicine, electricity, or childcare. During the COVID-19 pandemic, unemployment and food insecurity soared. In 2020, more than 60 million people turned to food banks and community programs for help putting food on the table—a 55% increase, according to Feeding America. In 2020, food banks nationwide distributed 6 billion meals to our neighbors facing hunger in the United States – enough to provide every single resident of the United States with breakfast, lunch and dinner for just over six days. Because of the pandemic, the number of people visiting food banks for the first time is also on the rise with an estimated 4 in 10 people visiting food banks for the first time. AmeriCorps members in the VISTA program across the US are working to end hunger. We’re excited to introduce you to two members whose national service illustrates how much impact even one member has in their community. Serving in Communications and Outreach at the Maine Department of Agriculture, Conservation, and Forestry, Grace works on the Ending Hunger in Maine project. Recently, she helped create recipes for the Commodity Supplemental Food Program – a program that sends boxes to seniors in need using surplus foods purchased in buybacks by the US Department of Agriculture from American farmers to prevent profit losses when crops overproduce or are in low demand. These extra foods are made shelf stable, packed in boxes and shipped to qualified seniors monthly across the state. Additionally, Maine’s senior farm share program gives $50 in fresh produce, herbs or honey per season to seniors with demonstrated need. “So many of these hunger issues aren’t due to food availability,” explained Grace. “Institutionalized poverty creates hunger, and this poverty is maintained through the legacies of redlining, racism, poor job quality or job options, disability, and the costs of healthcare, transportation and housing. We hope through the creation of the Ending Hunger plan that vast systems-based changes we need take place.” Also in the Northeast, William is serving with Campus Compact at the New Hampshire Food Bank, an AmeriCorps sponsor. William’s service journey started a few years ago at City Year after graduating high school where he witnessed the systemic barriers that kept many of his friends from succeeding. Seeing this injustice led him to City Year where he served for two years mentoring and tutoring elementary school students in Manchester, New Hampshire. Through his service at City Year, he found purpose and meaning. “Every day I knew that I was contributing to the education and the lives of my students,” said William. “However, I was also acutely aware that there were bigger systemic issues influencing my students’ lives, issues that I could only do so much about.” These experiences led him to serve with the AmeriCorps VISTA program. “The hardest moments for me as an educator were hearing my students tell me they were food insecure and knowing that all I could do was refer them to the social worker who might be able to help, but that I could not change what caused them to be food insecure,” said William. “This is why I serve as an AmeriCorps member in the Food Insecurity Project, because I want to change our system; so people are able to leave poverty, not just make poverty more bearable.” What Grace and William have learned in their community, applies to every community in the country. No community is without families who face hunger, including rural and suburban communities. Many households that experience food insecurity do not qualify for federal nutrition programs and visit their local food banks and other food programs for extra support. That’s where AmeriCorps steps in to lend a helping hand. If you are interested in helping your community combat hunger, consider joining an upcoming webinar to learn more about becoming a member in the VISTA program where everyday citizens are tackling these issues. Previous Prepare to Protect: Keep your families safe with these tips from Ready.gov Next Wearing the AmeriCorps 'A', Hispanic and Latino Americans Show America at its Best Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2021-09-30/americorps-members-take-hunger-issues",
    "https://americorps.gov/serve/fit-finder/americorps-vista",
    "https://americorps.zoomgov.com/webinar/register/WN_2-lQI7EPSHi4Zsj5eK_0rw",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2021-09-30/americorps-members-take-hunger-issues&amp;title=AmeriCorps Members Take on Hunger Issues",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2021-09-30/americorps-members-take-hunger-issues&amp;title=AmeriCorps Members Take on Hunger Issues&amp;source=https://americorps.gov/blogs/2021-09-30/americorps-members-take-hunger-issues",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2021-09-30/americorps-members-take-hunger-issues&amp;url=https://americorps.gov/blogs/2021-09-30/americorps-members-take-hunger-issues&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2021-09-29/prepare-protect-keep-your-families-safe-these-tips-readygov",
    "https://americorps.gov/blogs/2021-10-14/wearing-americorps-hispanic-latino-americans-show-america-its-best",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps VISTA",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "domain": "blogs",
  "subdomain_1": "2021",
  "subdomain_2": "09",
  "subdomain_3": "30"
}