{
  "id": "americorpsgov_about_agency_overview_federal_register_noticeshtml",
  "url": "https://americorps.gov/about/agency-overview/federal-register-notices",
  "title": "federal-register-notices",
  "content": "Federal Register Notices | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb About Agency Overview Federal Register Notices Agency Overview Agency-Wide Policies and Notices AmeriCorps Fraud Alert AmeriCorps’ Equity Action Plan Budget and Performance Plans Civil Rights for Employees, Service Members, and Volunteers Digital Strategy Disability and Accessibility Federal Register Notices FOIA and the Privacy Act No FEAR Act Open Government Plain Writing Privacy Policy Results of Grant Competitions Statutes and Regulations Strategic Plan Vulnerability Disclosure Policy The Federal Register is the official daily publication for rules, proposed rules, and notices of Federal agencies and organizations, as well as executive orders and other presidential documents. The Federal Register is published by the Office of Federal Register, National Archives and Records Administration (NARA). The following notices have been published in the Federal Register by AmeriCorps. To review the complete text of the following notices, please visit the GPO website . Federal Register Displaying page 1 of 20 November 13, 2024 Notice of Board Meeting, November 20, 2024 Sunshine Act Notice Download November 7, 2024 Correction, Protection of Human Subjects Final Rule Download October 29, 2024 Protection of Human Subjects Final Rule Download September 25, 2024 Employers of National Service Form and Survey 30-Day Public Comment Notice Download September 6, 2024 Applicant Operational and Financial Survey 30-Day Public Comment Notice Download August 30, 2024 AmeriCorps Seniors Regulation Updates Final Rule Download August 16, 2024 AmeriCorps State and National Updates; Correction Final Rule Download August 13, 2024 CNCS-04-CPO-MPMF-Members Program Management Files 30-Day Public Comment Notice Download July 17, 2024 Notice of Public Board Meeting, July 24, 2024 Sunshine Act Notice Download July 8, 2024 AmeriCorps Program Life Cycle Evaluation - Puerto Rico Bundled Evaluation 30-Day Public Comment Notice Download June 12, 2024 Employers of National Service Enrollment Form & Survey 60-Day Public Comment Notice Download June 5, 2024 American Climate Corps Recruitment Form 30-Day Public Comment Notice Download Pagination Current page 1 Page 2 Page 3 Page 4 Page 5 … Last Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/about/agency-overview/federal-register-notices",
    "http://www.gpo.gov/fdsys/browse/collection.action?collectionCode=FR",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2024-26385%20Sunshine%20Act%20board%20meeting%202024-11-20.pdf",
    "https://americorps.gov/sites/default/files/document/2024-25881%20Correction%20to%20Final%20Rule%2C%20Protection%20of%20Human%20Subjects.pdf",
    "https://americorps.gov/sites/default/files/document/2024-24517%20Protection%20of%20Human%20Subjects%20Common%20Rule.pdf",
    "https://americorps.gov/sites/default/files/document/2024-21919%20EONS%20Form%20%26%20Survey%2030.day_.pdf",
    "https://americorps.gov/sites/default/files/document/2024-19841%20Applicant%20Operational%20%26%20Financial%20Survey%2030%20day.pdf",
    "https://americorps.gov/sites/default/files/document/2024-19348%20AmeriCorps%20Seniors%20Final%20Rule.pdf",
    "https://americorps.gov/sites/default/files/document/2024-18125%20ASN%20Rule%20corrections.pdf",
    "https://americorps.gov/sites/default/files/document/2024-17951%20MPMF%20SORN.pdf",
    "https://americorps.gov/sites/default/files/document/2024-15875%20Notice%20of%20Public%20Board%20Meeting%20July%2024%2C%202024.pdf",
    "https://americorps.gov/sites/default/files/document/2024-14795%20PR%20Bundled%20Evaluation%2030%20day.pdf",
    "https://americorps.gov/sites/default/files/document/2024-12853%20EONS%2060%20day.pdf",
    "https://americorps.gov/sites/default/files/document/2024-12272%20ACC%20Recruitment%20Form%2030.day_.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps State and National; AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "about",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "about",
  "subdomain_1": "agency-overview"
}