{
  "id": "americorpsgov_blogs_2021_03_23_vice_president_second_gentleman_visit_sites_where_americorps_here_helphtml",
  "url": "https://americorps.gov/blogs/2021-03-23/vice-president-second-gentleman-visit-sites-where-americorps-here-help",
  "title": "vice-president-second-gentleman-visit-sites-where-americorps-here-help",
  "content": "Vice President, Second Gentleman Visit Sites Where AmeriCorps is ‘Here to Help’ | AmeriCorps An official website of the United States government Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock A locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive\n              information only on official, secure websites. Skip to main content Join Donate About About About About menu block one What We Do Our Impact Agency FAQs About menu block two Our Team Careers About menu block three Agency Overview Budget and Performance Plans Disability and Accessibility Federal Register Notices Open Government Plain Writing Privacy Policy Strategic Plan Serve Serve Serve Serve menu block one AmeriCorps AmeriCorps NCCC AmeriCorps State and National AmeriCorps VISTA AmeriCorps Seniors AmeriCorps Seniors Foster Grandparent Program AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion Program Serve menu block two Volunteer 9/11 Day MLK Day Serve menu block three Find Your Fit Serve FAQs Partner Partner Partner Partner menu block one How it Works AmeriCorps NCCC AmeriCorps Seniors Foster Grandparent AmeriCorps Seniors RSVP AmeriCorps Seniors Senior Companion AmeriCorps State and National AmeriCorps VISTA Research and Evaluation Volunteer Generation Fund Partner menu block two Partnerships Communities and Initiatives Funding Opportunities Partner menu block three Partner FAQs Members & Volunteers Members & Volunteers Members & Volunteers Members & Volunteers menu block one Your Benefits Segal AmeriCorps Education Award Education Award FAQs Members & Volunteers menu block two Alumni Members in VISTA Members & Volunteers menu block three Member and Volunteer FAQs Safety and Security Grantees & Sponsors Grantees & Sponsors Grantees & Sponsors Grantee & Sponsors menu block one State Service Commissions State and National Direct Grantees State Subgrantees VISTA Sponsors Research and Evaluation Grantees Volunteer Generation Fund and Days of Service Grantees Grantee & Sponsors menu block two RSVP Grantees Foster Grandparent Program Grantees Senior Companion Program Grantees Senior Demonstration Program Grantees NCCC Project Sponsors Grantee & Sponsors menu block three Manage Your Grant Grantee and Sponsor FAQs Newsroom Newsroom Newsroom Newsroom menu block one News Blog In the News Newsroom menu block two Stories Events Newsroom menu block three Communication Resources Press Kit Contact Contact Join Donate search Breadcrumb Vice President, Second Gentleman Visit Sites Where AmeriCorps is ‘Here to Help’ Submitted by pnolan on Tue, 03/23/2021 - 18:48 Mar 23, 2021 Janice Rottenberg, AmeriCorps On March 22, Vice President Kamala Harris and Second Gentleman Doug Emhoff continued the Biden Administration’s ‘Help is Here’ tour with stops in Jacksonville, Fla. and Des Moines, Iowa. In each of these locations, AmeriCorps members stand alongside neighbors and community leaders responding to COVID-19, just as they are across the country. AmeriCorps members and AmeriCorps Seniors volunteers are on the ground, delivering aid where it’s needed, and helping vaccinate thousands throughout Florida. Speaking to a group of local leaders during a visit to Feeding Northeast Florida’s warehouse, Vice President Harris stated , “The work you all have been doing is extraordinary. I'm certain that history is going to show that this was a moment of extreme crisis that challenged us, and there were the heroes that just showed up.” At AmeriCorps, we share that same belief. We know that not all heroes wear capes. Sometimes they wear an “A.” Reducing Hunger and Strengthening Food Systems Joined by Secretary Tom Vilsack, Second Gentleman Doug Emhoff visited the Food Bank of Iowa , one of the many AmeriCorps partners working to improve food insecurity. While Mr. Emhoff didn’t get the opportunity to meet any AmeriCorps members, the work matters no less. For the past year, just as millions have faced increasing hunger needs, volunteers have been a part of the critical part of the response to ensure that every American is able to put food on the table. AmeriCorps has joined this effort, with teams supporting food banks and other hunger programs across the country. Spring partnership announced with Baylor Collaborative on Hunger and Poverty, McLennan County Hunger Coalition Ohio National Guard transitions out; AmeriCorps in at Greater Cleveland Food Bank Feeding Washington: Facing food insecurity head on Iowa AmeriCorps Site Tackling Food Insecurity Receives VIP Visit Supporting Vaccination Outreach and Delivery In recent months, AmeriCorps has joined the urgent campaign to vaccinate as many Americans as possible. Hundreds of AmeriCorps members are providing the extra people power to increase the capacity of state, local, and FEMA supported centers. Vice President Kamala Harris stopped by one of these centers in Jacksonville, Fla. where she said a few brief words to the Naval Officers and AmeriCorps members supporting the center: “That’s some of the most noble work any human being can do: to live a life of service. To protect, to support, and to lift up our neighbors. That’s what you guys are doing. So, I’m here on behalf of the President and myself to say thank you. Thank you. Thank you. Thank you. Keep doing what you’re doing.” Vaccinations Elsewhere Rutgers University’s Resilient, Innovative Year Confronting COVID-19 FEMA Corps Team Joining West Virginia’s Fight Against COVID-19 Berkeley tries grassroots methods to avoid ‘vaccine hunters,’ reach vulnerable groups Previous Family Reunion Makes Lasting Impression on AmeriCorps Members Next Help Health and Human Services Support Migrant Children Back to main content Sign up to hear about our latest news, events, and opportunities. Sign up for our newsletter Footer about About What We Do Our Impact Our Team Careers Agency Overview Footer serve Serve AmeriCorps AmeriCorps Seniors Volunteer Find Your Fit Footer partner Partner How it Works Funding Opportunities Footer Members & Volunteers Members & Volunteers Your Benefits Segal AmeriCorps Education Award Alumni Safety and Security Footer grantees & sponsors Grantees & Sponsors eGrants History Checks Litmos Footer newsroom Newsroom News Blog Stories Events In the News Communication Resources Bringing Americans together to serve communities Follow us 1-800-942-2677 Ask A Question USA.gov / Office of Inspector General / FOIA and Privacy Act / Federal Register notices / No FEAR Act / Employee Whistleblower Rights / Contractor and Grantee Whistleblower Rights / Office of Special Counsel / STOCK Act / Fraud Alert Accessibility / Privacy policy / Site map / Donate / Join AmeriCorps.gov An official website of AmeriCorps. Produced and published at taxpayer expense. You are leaving AmeriCorps.gov The website you’re going to is not part of the AmeriCorps domain and may not be under AmeriCorps’ control. Its privacy and security practices and policies may differ from AmeriCorps’. AmeriCorps is not responsible for the link, nor does it endorse the content of the third-party website. Click on the continue button to proceed to the external website; otherwise click cancel to stay on AmeriCorps.gov. Cancel Continue",
  "embedded_urls": [
    "https://americorps.gov/blogs/2021-03-23/vice-president-second-gentleman-visit-sites-where-americorps-here-help",
    "https://www.jacksonville.com/story/news/nation-world/2021/03/22/vp-kamala-harris-visit-feeding-northeast-florida-jacksonville/4796087001/",
    "https://www.desmoinesregister.com/picture-gallery/news/2021/03/22/agriculture-secretary-tom-vilsack-doug-emhoff-and-rep-cindy-axne-tour-food-bank-iowa/4797112001/",
    "https://www.fox44news.com/news/local-news/local/spring-partnership-announced-with-baylor-collaborative-on-hunger-and-poverty-mclennan-county-hunger-coalition/",
    "https://fox8.com/news/coronavirus/ohio-national-guard-to-transition-out-of-assisting-greater-cleveland-food-bank/",
    "https://www.seattletimes.com/sponsored/feeding-washington-facing-food-insecurity-head-on/",
    "https://americorps.gov/blogs/2020-07-22/iowa-governor-visits-americorps-site-tackling-food-insecurity",
    "https://twitter.com/VP/status/1374138040176803847",
    "https://www.newswise.com/coronavirus/rutgers-university-s-resilient-innovative-year-confronting-covid-19/?article_id=747220",
    "https://www.jacksonnewspapers.com/story/news/2021/03/16/fema-corps-team-joining-west-virginias-fight-against-covid-19/4716673001/",
    "https://www.berkeleyside.com/2021/02/26/berkeley-covid-19-vaccine-hunters-outreach-equity",
    "https://www.facebook.com/share.php?u=https://americorps.gov/blogs/2021-03-23/vice-president-second-gentleman-visit-sites-where-americorps-here-help&amp;title=Vice President, Second Gentleman Visit Sites Where AmeriCorps is ‘Here to Help’",
    "https://www.linkedin.com/shareArticle?mini=true&amp;url=https://americorps.gov/blogs/2021-03-23/vice-president-second-gentleman-visit-sites-where-americorps-here-help&amp;title=Vice President, Second Gentleman Visit Sites Where AmeriCorps is ‘Here to Help’&amp;source=https://americorps.gov/blogs/2021-03-23/vice-president-second-gentleman-visit-sites-where-americorps-here-help",
    "https://twitter.com/intent/tweet?url=https://americorps.gov/blogs/2021-03-23/vice-president-second-gentleman-visit-sites-where-americorps-here-help&amp;url=https://americorps.gov/blogs/2021-03-23/vice-president-second-gentleman-visit-sites-where-americorps-here-help&amp;hashtags=Hashtag",
    "https://americorps.gov/blogs/2021-03-23/family-reunion-makes-lasting-impression-americorps-members",
    "https://americorps.gov/blogs/2021-04-05/help-health-human-services-support-migrant-children",
    "https://public.govdelivery.com/accounts/USCNCS/subscriber/new",
    "https://egrants.cns.gov/espan/main/login.jsp",
    "https://americorpsonlinecourses.litmos.com/account/login",
    "https://www.facebook.com/americorps/",
    "https://twitter.com/americorps?lang=en",
    "https://www.instagram.com/americorps/?hl=en",
    "https://www.youtube.com/channel/UC1VuXCdPlovso1vcqi2dMng",
    "https://www.linkedin.com/company/americorps",
    "https://questions.americorps.gov/app/ask",
    "http://www.usa.gov/",
    "https://www.americorpsoig.gov/",
    "https://www.americorps.gov/about/agency-overview/federal-register-notices",
    "https://osc.gov",
    "https://www.oge.gov/web/oge.nsf/section_landing_ethics-docs",
    "https://americorps.gov/about/agency-overview/fraud-alert"
  ],
  "pdf_urls": [
    "https://americorps.gov/sites/default/files/document/2021_08_27_Whistleblower_Rights_Employees_OGC.pdf",
    "https://americorps.gov/sites/default/files/document/2021_08_25_Whistleblower_Rights_and_Remedies_Contractors_Grantees_OGC.pdf"
  ],
  "programs": "AmeriCorps Seniors",
  "focus_population": [],
  "ages_studied": [],
  "resource_type": "blogs",
  "topic": "",
  "year": "",
  "Status": "Open",
  "CFDA_number": "94.011",
  "domain": "blogs",
  "subdomain_1": "2021",
  "subdomain_2": "03",
  "subdomain_3": "23"
}